Repository: Alexey-T/TRegExpr
Catalog: docs/locale/*/LC_MESSAGES/about.po
Languages: bg_bg, de_de, es_es, fr_fr, ru_ru

source: I’m software developer from St-Petersburg, Russia
bg_bg: Аз съм разработчик на софтуер от Санкт Петербург, Русия
de_de: Ich bin Softwareentwickler aus St. Petersburg, Russland
es_es: Soy desarrollador de software de San Petersburgo, Rusia.
fr_fr: Je suis développeur de logiciels de Saint-Pétersbourg, en Russie
ru_ru: Я разработчик программного обеспечения из Санкт-Петербурга, Россия

source: In february 1994 I concluded my study in `Saint Petersburg Electrotechnical University “LETI” <http://www.eltech.ru/en/university>`__, it was 6-years study but there were no Bachelor/Master degrees in Russia, just “high education”.
bg_bg: През февруари 1994 г. завърших обучението си в &quot;Санкт Петербургски електротехнически университет&quot; ЛЕТИ &quot; <http://www.eltech.ru/en/university> `__, това е 6-годишно обучение, но не е имало бакалавърска / магистърска степен в Русия, просто“ висше образование ”.
de_de: Im Februar 1994 beendete ich mein Studium an der St. Petersburger Elektrotechnischen Universität &quot;LETI&quot;. <http://www.eltech.ru/en/university> Es war ein 6-jähriges Studium, aber in Russland gab es keine Bachelor- / Master-Abschlüsse, nur „High Education“.
es_es: En febrero de 1994, terminé mi estudio en la Universidad LEEC de San Petersburgo. <http://www.eltech.ru/en/university> `__, fue un estudio de 6 años, pero no había licenciatura / maestría en Rusia, solo&quot; educación superior &quot;.
fr_fr: En février 1994, j&#39;ai terminé mes études à l&#39;Université électrotechnique de Saint-Pétersbourg «LETI». <http://www.eltech.ru/en/university> `__, il s’agissait de six années d’études, mais il n’y avait pas de diplômes de Bachelor / Master en Russie, mais seulement de« hautes études ».
ru_ru: В феврале 1994 года я закончил учебу в Санкт-Петербургском электротехническом университете «ЛЭТИ». <http://www.eltech.ru/en/university> «___, это было 6-летнее обучение, но в России не было степеней бакалавра / магистра, только« высшее образование ».

source: Department of Electron Devices Design and Manufacturing, at the time it was pretty close to computer science.
bg_bg: Катедра &quot;Електронни устройства за проектиране и производство&quot;, по това време беше доста близо до компютърните науки.
de_de: Abteilung für Design und Herstellung von Elektronengeräten, damals war es ziemlich nah an der Informatik.
es_es: Departamento de Diseño y Fabricación de Dispositivos Electrónicos, en el momento en que estaba bastante cerca de la informática.
fr_fr: Département de conception et de fabrication d&#39;appareils électroniques, à l&#39;époque, c&#39;était assez proche de l&#39;informatique.
ru_ru: Кафедра проектирования и производства электронных устройств в то время была довольно близка к информатике.

source: Some snapshots of my life
bg_bg: Някои снимки от живота ми
de_de: Einige Momentaufnahmen meines Lebens
es_es: Algunas fotos de mi vida.
fr_fr: Quelques instantanés de ma vie
ru_ru: Несколько снимков моей жизни

source: 1995 year. 3 years **before** captain rank.
bg_bg: 1995 година. 3 години ** преди ** капитан ранг.
de_de: 1995 Jahr. 3 Jahre ** vor ** Kapitänsrang.
es_es: 1995 año. 3 años ** antes ** de rango de capitán.
fr_fr: 1995 année. 3 ans ** avant ** le grade de capitaine.
ru_ru: 1995 год. 3 года **до** звание капитана

source: It’s another dead Trident 9000i video adapter
bg_bg: Това е още един мъртъв видео адаптер Trident 9000i
de_de: Es ist ein weiterer toter Trident 9000i-Videoadapter
es_es: Es otro adaptador de video Trident 9000i muerto
fr_fr: C&#39;est une autre carte vidéo morte Trident 9000i
ru_ru: Это еще один мертвый видеоадаптер Trident 9000i

source: Tools: MSM-system (hierarchical DB from Massachusets, now `Caché <https://en.wikipedia.org/wiki/InterSystems_Cach%C3%A9>`__, Pascal, C, ASM, VBA, big hammer and AK-47 ;)
bg_bg: Инструменти: MSM-система (йерархична DB от Massachusets, сега `Caché <https://en.wikipedia.org/wiki/InterSystems_Cach%C3%A9> `__, Pascal, C, ASM, VBA, голям чук и AK-47;)
de_de: Tools: MSM-System (hierarchische DB von Massachusets, jetzt `Caché &#39;) <https://en.wikipedia.org/wiki/InterSystems_Cach%C3%A9> , Pascal, C, ASM, VBA, großer Hammer und AK-47;)
es_es: Herramientas: sistema MSM (DB jerárquico de Massachusets, ahora `Caché <https://en.wikipedia.org/wiki/InterSystems_Cach%C3%A9> `__, Pascal, C, ASM, VBA, big hammer y AK-47;)
fr_fr: Outils: Système MSM (base de données hiérarchique de Massachusets, maintenant `Caché <https://en.wikipedia.org/wiki/InterSystems_Cach%C3%A9> `__, Pascal, C, ASM, VBA, gros marteau et AK-47;)
ru_ru: Инструменты: MSM-система (иерархическая БД из Массачусетса, теперь `Caché &#39; <https://en.wikipedia.org/wiki/InterSystems_Cach%C3%A9> `___, Паскаль, C, ASM, VBA, большой молоток и АК-47;)

source: 2001 year. 3 years **after** captain rank, already retired from military service
bg_bg: 2001 година. 3 години ** след ** капитан ранг, вече пенсиониран от военна служба
de_de: 2001 Jahr. 3 Jahre ** nach ** Kapitänsrang, bereits vom Militärdienst zurückgetreten
es_es: Año 2001. 3 años ** después ** de rango de capitán, ya retirado del servicio militar
fr_fr: Année 2001. 3 ans ** après ** grade de capitaine, déjà retraité du service militaire
ru_ru: 2001 год. 3 года ** после ** звания капитана, уже в отставке с военной службы

source: Rest after digital money development
bg_bg: Почивка след развитието на цифровите пари
de_de: Ruhe nach der Entwicklung des digitalen Geldes
es_es: Descansa después del desarrollo del dinero digital.
fr_fr: Reste après le développement de l&#39;argent numérique
ru_ru: Отдых после освоения цифровых денег

source: Tools: MS SQL and others, Delphi, C++, PHP, DHTML, XML, DCOM, etc.
bg_bg: Инструменти: MS SQL и други, Delphi, C ++, PHP, DHTML, XML, DCOM и др.
de_de: Tools: MS SQL und andere, Delphi, C ++, PHP, DHTML, XML, DCOM usw.
es_es: Herramientas: MS SQL y otros, Delphi, C ++, PHP, DHTML, XML, DCOM, etc.
fr_fr: Outils: MS SQL et autres, Delphi, C ++, PHP, DHTML, XML, DCOM, etc.
ru_ru: Инструменты: MS SQL и другие, Delphi, C ++, PHP, DHTML, XML, DCOM и т. Д.

source: But on the photo I am just on vacations in Istanbul.
bg_bg: Но на снимката съм на почивка в Истанбул.
de_de: Aber auf dem Foto mache ich gerade Urlaub in Istanbul.
es_es: Pero en la foto estoy de vacaciones en Estambul.
fr_fr: Mais sur la photo, je suis juste en vacances à Istanbul.
ru_ru: Но на фото я только на каникулах в Стамбуле.

source: 2003 year
bg_bg: 2003 година
de_de: 2003 Jahr
es_es: Año 2003
fr_fr: Année 2003
ru_ru: 2003 год

source: And how I supposed to reach the ground?!
bg_bg: И как трябва да стигна до земята ?!
de_de: Und wie soll ich den Boden erreichen ?!
es_es: ¡¿Y como se supone que llegue al suelo ?!
fr_fr: Et comment j&#39;ai supposé atteindre le sol?!
ru_ru: И как мне спуститься?!

source: Tools: Anything and everywhere 8-) Last vacations in Crimea..
bg_bg: Инструменти: Всичко и навсякъде 8-) Последни ваканции в Крим ..
de_de: Werkzeuge: Alles und überall 8-) Letzte Ferien auf der Krim ..
es_es: Herramientas: Cualquier cosa y en todas partes 8-) Últimas vacaciones en Crimea ..
fr_fr: Outils: n&#39;importe quoi et partout 8-) Dernières vacances en Crimée ..
ru_ru: Инструменты: все и везде 8-) Последние каникулы в Крыму ..

source: Contact me
bg_bg: Свържи се с мен
de_de: Kontaktiere mich
es_es: Contáctame
fr_fr: Contactez moi
ru_ru: Свяжитесь со мной

source: `Blog <http://masterandrey.com>`__
bg_bg: `Блог <http://masterandrey.com> `__
ru_ru: `Блог <http://masterandrey.com> `__

source: `Andrey V. Sorokin, anso@mail.ru <mailto:anso@mail.ru>`__
bg_bg: `Андрей В. Сорокин, anso@mail.ru <mailto:anso@mail.ru> `__
ru_ru: `Андрей В. Сорокин, anso@mail.ru <mailto:anso@mail.ru> `__
