Repository: Alexey-T/TRegExpr
Catalog: docs/locale/*/LC_MESSAGES/demos.po
Languages: de_de, fr_fr, ru, ru_ru

source: First of all I recommend You to read `article with usage illustrations <http://masterandrey.com/posts/en/text_processing_from_birds_eye_view.html>`__.
de_de: Zunächst einmal empfehle ich Ihnen, Artikel mit Verwendungsabbildungen zu lesen <http://masterandrey.com/posts/en/text_processing_from_birds_eye_view.html> __.
fr_fr: Tout d&#39;abord, je vous recommande de lire `article avec des illustrations d&#39;utilisation <http://masterandrey.com/posts/en/text_processing_from_birds_eye_view.html> `__.
ru_ru: Прежде всего, рекомендую прочитать статью с иллюстрациями использования. <http://masterandrey.com/posts/en/text_processing_from_birds_eye_view.html> `__.

source: Ready to run Windows application `REStudio <https://github.com/masterandrey/TRegExpr/releases/download/0.952b/REStudio.exe>`__ to learn and debug regular expressions.
de_de: Bereit zum Ausführen der Windows-Anwendung `REStudio <https://github.com/masterandrey/TRegExpr/releases/download/0.952b/REStudio.exe> __ um reguläre Ausdrücke zu lernen und zu debuggen.
fr_fr: Prêt à exécuter l&#39;application Windows `REStudio <https://github.com/masterandrey/TRegExpr/releases/download/0.952b/REStudio.exe> `__ pour apprendre et déboguer les expressions régulières.
ru: Готовое к запуску приложение Windows `REStudio <https://github.com/masterandrey/TRegExpr/releases/download/0.952b/REStudio.exe>`__ для изучения и отладки регулярных выражений.
ru_ru: Готовое к запуску приложение Windows `REStudio <https://github.com/masterandrey/TRegExpr/releases/download/0.952b/REStudio.exe> `__ для изучения и отладки регулярных выражений.

source: Please, note that there are localized demos available (with comments in source code on national languages).
de_de: Bitte beachten Sie, dass lokalisierte Demos verfügbar sind (mit Kommentaren im Quellcode der Nationalsprachen).
fr_fr: Veuillez noter que des démos localisées sont disponibles (avec des commentaires en code source dans les langues nationales).
ru: Обратите внимание, что доступны локализованные демонстрационные версии (с комментариями в исходном коде на национальных языках).
ru_ru: Обратите внимание, что доступны локализованные демонстрационные версии (с комментариями в исходном коде на национальных языках).

source: This localized versions distributed in localized full TRegExpr packages, and in separate localized documentation packages (when You unpack this documentation package in TRegExpr directory the localized demos overwrite English ones).
de_de: Diese lokalisierten Versionen werden in lokalisierten vollständigen TRegExpr-Paketen und in separaten lokalisierten Dokumentationspaketen verteilt (wenn Sie dieses Dokumentationspaket im TRegExpr-Verzeichnis entpacken, überschreiben die lokalisierten Demos die englischen).
fr_fr: Ces versions localisées sont distribuées dans des packages TRegExpr complets localisés et dans des packages de documentation localisés distincts (lorsque vous décompressez ce package de documentation dans le répertoire TRegExpr, les démonstrations localisées remplacent celles en anglais).
ru_ru: Эти локализованные версии распространяются в локализованных полных пакетах TRegExpr и в отдельных локализованных пакетах документации (когда вы распаковываете этот пакет документации в каталоге TRegExpr, локализованные демки перезаписывают английские).

source: Demos\TRegExprRoutines
fr_fr: Démos \ TRegExprRoutines

source: very simple examples, see comments inside the unit
de_de: sehr einfache Beispiele, siehe Kommentare im Gerät
fr_fr: exemples très simples, voir les commentaires à l&#39;intérieur de l&#39;unité
ru_ru: очень простые примеры, см. комментарии внутри блока

source: Demos\TRegExprClass
fr_fr: Démos \ TRegExprClass

source: slightly more complex examples, see comments inside the unit
de_de: etwas komplexere Beispiele, siehe Kommentare innerhalb der Einheit
fr_fr: exemples un peu plus complexes, voir les commentaires à l&#39;intérieur de l&#39;unité
ru_ru: чуть более сложные примеры, см. комментарии внутри блока

source: Demos\Text2HTML
fr_fr: Démos \ Text2HTML

source: see `description <#text2html.html>`__
de_de: siehe `description &lt;# text2html.html&gt;` __
fr_fr: voir `description &lt;# text2html.html&gt;` __
ru_ru: смотрите `описание &lt;# text2html.html&gt;` __

source: If You don't familiar with regular expression, please, take a look at the `r.e.syntax <regexp_syntax.html>`__ topic.
de_de: Wenn Sie nicht mit dem regulären Ausdruck vertraut sind, werfen Sie einen Blick auf die Resyntax <regexp_syntax.html> __ Thema.
fr_fr: Si vous n’êtes pas familier avec l’expression régulière, jetez un coup d’œil à la `resyntax <regexp_syntax.html> `__ sujet.
ru_ru: Если вы не знакомы с регулярными выражениями, взгляните на `resyntax <regexp_syntax.html> `__ тема.

source: TRegExpr interface described in `TRegExpr interface <tregexpr_interface.html>`__.
de_de: TRegExpr-Schnittstelle, beschrieben in `TRegExpr-Schnittstelle <tregexpr_interface.html> __.
fr_fr: Interface TRegExpr décrite dans la section `Interface TRegExpr <tregexpr_interface.html> `__.
ru: Интерфейс TRegExpr описан в `TRegExpr <tregexpr_interface.html>`__.
ru_ru: Интерфейс TRegExpr описан в интерфейсе TRegExpr <tregexpr_interface.html> `__.

source: Note
de_de: Hinweis
fr_fr: Remarque
ru_ru: Заметка

source: Some of demo-projects use extended VCL properties which exists only in Delphi 4 or higher. While compiling in Delphi 3 or Delphi 2 you'll receive some error messages about unknown properties. You may ignore it - this properties is needed only for resizing and justification of components then form change it's size.
de_de: Einige der Demo-Projekte verwenden erweiterte VCL-Eigenschaften, die nur in Delphi 4 oder höher vorhanden sind. Beim Kompilieren in Delphi 3 oder Delphi 2 erhalten Sie Fehlermeldungen zu unbekannten Eigenschaften. Sie können es ignorieren - diese Eigenschaften werden nur für die Größenänderung und Ausrichtung von Komponenten benötigt.
fr_fr: Certains projets de démonstration utilisent des propriétés VCL étendues qui n&#39;existent que dans Delphi 4 ou une version ultérieure. Lors de la compilation dans Delphi 3 ou Delphi 2, vous recevrez des messages d&#39;erreur concernant des propriétés inconnues. Vous pouvez l&#39;ignorer - ces propriétés ne sont nécessaires que pour le redimensionnement et la justification des composants, puis la modification de sa taille.
ru: Некоторые из демонстрационных проектов используют расширенные свойства VCL, которые существуют только в Delphi 4 или выше. При компиляции в Delphi 3 или Delphi 2 вы получите несколько сообщений об ошибках о неизвестных свойствах. Вы можете игнорировать его - эти свойства нужны только для изменения размера и выравнивания компонентов, а затем для изменения их размера.
ru_ru: Некоторые из демонстрационных проектов используют расширенные свойства VCL, которые существуют только в Delphi 4 или выше. При компиляции в Delphi 3 или Delphi 2 вы получите несколько сообщений об ошибках о неизвестных свойствах. Вы можете игнорировать его - эти свойства нужны только для изменения размера и выравнивания компонентов, а затем для изменения их размера.

source: Very simple utility, that helps publish plain text as HTML
de_de: Sehr einfaches Dienstprogramm, mit dem einfacher Text als HTML veröffentlicht werden kann
fr_fr: Utilitaire très simple, qui permet de publier du texte brut au format HTML
ru_ru: Очень простая утилита, которая помогает публиковать простой текст в формате HTML

source: Uses unit `HyperLinksDecorator <#hyperlinksdecorator.html>`__ that is based on TRegExpr.
de_de: Verwendet die Einheit `HyperLinksDecorator &lt;# hyperlinksdecorator.html&gt;` __, die auf TRegExpr basiert.
fr_fr: Utilise l&#39;unité `HyperLinksDecorator &lt;# hyperlinksdecorator.html&gt;` __ qui est basée sur TRegExpr.
ru_ru: Использует модуль `HyperLinksDecorator &lt;# hyperlinksdecorator.html&gt;` __, основанный на TRegExpr.

source: Specially written as a demonstration of TRegExpr usage.
de_de: Speziell als Demonstration der Verwendung von TRegExpr geschrieben.
fr_fr: Spécialement écrit comme démonstration de l’utilisation de TRegExpr.
ru_ru: Специально написано как демонстрация использования TRegExpr.

source: Unit HyperLinksDecorator
fr_fr: Unité HyperLinksDecorator
ru_ru: Блок ГиперЛинксДекоратор

source: `DecorateURLs <#hyperlinksdecorator.html#decorateurls>`__ `DecorateEMails <#hyperlinksdecorator.html#decorateemails>`__
de_de: `DecorateURLs &lt;# hyperlinksdecorator.html # decorateurls&gt;` __ `DecorateEMails &lt;# hyperlinksdecorator.html # decorateemails&gt;` __
fr_fr: `DecorateURLs &lt;# hyperlinksdecorator.html # decorateurls&gt;` __ `DecorateEMails &lt;# hyperlinksdecorator.html # decorateemails&gt;` __
ru_ru: `DecorateURLs &lt;# hyperlinksdecorator.html # decorateurls&gt;` __ `DecorateEMails &lt;# hyperlinksdecorator.html # decorateemails&gt;` __

source: This unit contains functions to decorate hyper-links (see `Text2Html <#text2html.html>`__ demo-project for usage example).
de_de: Diese Unit enthält Funktionen zum Verzieren von Hyperlinks (siehe Beispiel für Text2Html &lt;# text2html.html&gt; `__ Demo-Projekt).
fr_fr: Cette unité contient des fonctions permettant de décorer des hyperliens (voir `Text2Html &lt;# text2html.html&gt;` __ -pro demo-project pour un exemple d&#39;utilisation).
ru_ru: Этот модуль содержит функции для оформления гиперссылок (см. Пример демонстрационного проекта `Text2Html &lt;# text2html.html&gt;` __).

source: For example, replaces 'www.RegExpStudio.com' with 'www.RegExpStudio.com' or 'anso@mail.ru' with 'anso@mail.ru'.
de_de: Ersetzt beispielsweise &quot;www.RegExpStudio.com&quot; durch &quot;www.RegExpStudio.com&quot; oder &quot;anso@mail.ru&quot; durch &quot;anso@mail.ru&quot;.
fr_fr: Par exemple, remplace &quot;www.RegExpStudio.com&quot; par &quot;www.RegExpStudio.com&quot; ou &quot;anso@mail.ru&quot; par &quot;anso@mail.ru&quot;.
ru_ru: Например, заменить «www.RegExpStudio.com» на «www.RegExpStudio.com» или «anso@mail.ru» на «anso@mail.ru».

source: function DecorateURLs
de_de: Funktion DecorateURLs
fr_fr: fonction DecorateURLs
ru_ru: функция DecorateURLs

source: Finds and replaces hyper links like 'http://...' or 'ftp://..' as well as links without protocol, but start with 'www.' If You want to decorate emails as well, You have to use function `DecorateEMails <#hyperlinksdecorator.html#decorateemails>`__ instead.
de_de: Findet und ersetzt Hyperlinks wie &#39;http: // ...&#39; oder &#39;ftp: // ..&#39; sowie Links ohne Protokoll. Beginnen Sie jedoch mit &#39;www.&#39; Wenn Sie auch E-Mails dekorieren möchten, müssen Sie stattdessen die Funktion `DecorateEMails &lt;# hyperlinksdecorator.html # decorateemails&gt;` __ verwenden.
fr_fr: Recherche et remplace les hyperliens tels que &quot;http: // ...&quot; ou &quot;ftp: // ..&quot;, ainsi que les liens sans protocole, mais commence par &quot;www.&quot; Si vous souhaitez également décorer des emails, vous devez utiliser la fonction `DecorateEMails &lt;# hyperlinksdecorator.html # decorateemails&gt;` __ à la place.
ru_ru: Находит и заменяет гиперссылки типа «http: // ...» или «ftp: // ..», а также ссылки без протокола, но начинаются с «www.» Если вы хотите также украшать электронные письма, вы должны использовать вместо этого функцию `DecorateEMails &lt;# hyperlinksdecorator.html # decorateemails&gt;` __.

source: Description
de_de: Beschreibung
fr_fr: La description
ru_ru: Описание

source: Returns input text AText with decorated hyper links.
de_de: Gibt den eingegebenen Text AText mit verzierten Hyperlinks zurück.
fr_fr: Renvoie le texte saisi AText avec des hyperliens décorés.
ru_ru: Возвращает введенный текст AText с оформленными гиперссылками.

source: AFlags describes, which parts of hyper-link must be included into VISIBLE part of the link:
de_de: AFlags beschreibt, welche Teile des Hyperlinks im VISIBLE-Teil des Links enthalten sein müssen:
fr_fr: AFlags décrit quelles parties de l&#39;hyperlien doivent être incluses dans la partie visible du lien:
ru_ru: AFlags описывает, какие части гиперссылки должны быть включены в видимую часть ссылки:

source: For example, if [durlAddr] then hyper link 'www.RegExpStudio.com/contacts.htm' will be decorated as 'www.RegExpStudio.com'
de_de: Wenn zum Beispiel [durlAddr], wird der Hyperlink &quot;www.RegExpStudio.com/contacts.htm&quot; als &quot;www.RegExpStudio.com&quot; gekennzeichnet.
fr_fr: Par exemple, si [durlAddr], le lien hypertexte &#39;www.RegExpStudio.com/contacts.htm&#39; sera décoré comme suit: &#39;www.RegExpStudio.com&#39;
ru_ru: Например, если [durlAddr], то гиперссылка «www.RegExpStudio.com/contacts.htm» будет оформлена как «www.RegExpStudio.com».

source: TDecorateURLsFlagSet = set of TDecorateURLsFlags;
de_de: TDecorateURLsFlagSet = Satz von TDecorateURLsFlags;
fr_fr: TDecorateURLsFlagSet = ensemble de TDecorateURLsFlags;
ru_ru: TDecorateURLsFlagSet = набор TDecorateURLsFlags;

source: These are the possible values:
de_de: Dies sind die möglichen Werte:
fr_fr: Ce sont les valeurs possibles:
ru_ru: Вот возможные значения:

source: Value Meaning
de_de: Wert Bedeutung
fr_fr: Valeur Signification
ru_ru: Значение Значение

source: durlProto Protocol (like 'ftp://' or 'http://')
de_de: durlProto-Protokoll (wie &#39;ftp: //&#39; oder &#39;http: //&#39;)
fr_fr: Protocole durlProto (comme &#39;ftp: //&#39; ou &#39;http: //&#39;)
ru_ru: Протокол durlProto (например, «ftp: //» или «http: //»)

source: durlAddr TCP address or domain name (like 'RegExpStudio.com')
de_de: durlAddr TCP-Adresse oder Domänenname (wie &#39;RegExpStudio.com&#39;)
fr_fr: Adresse TCP ou nom de domaine durlAddr (comme &#39;RegExpStudio.com&#39;)
ru_ru: TCP-адрес или имя домена durlAddr (например, «RegExpStudio.com»)

source: durlPort Port number if specified (like ':8080')
de_de: DurlPort Portnummer, falls angegeben (wie &#39;: 8080&#39;)
fr_fr: Numéro de port durlPort si spécifié (comme &#39;: 8080&#39;)
ru_ru: Номер порта durlPort, если указан (например, &#39;: 8080&#39;)

source: durlPath Path to document (like 'index.html')
de_de: durlPath Pfad zum Dokument (wie &#39;index.html&#39;)
fr_fr: durlPath Chemin d&#39;accès au document (comme &#39;index.html&#39;)
ru_ru: durlPath Путь к документу (например, index.html)

source: durlBMark Book mark (like '#mark')
de_de: durlBMark Buchmarke (wie &#39;#mark&#39;)
fr_fr: DurlBMark Marque-page (comme &#39;#mark&#39;)
ru_ru: durlBMark Book mark (например, «#mark»)

source: durlParam URL params (like '?ID=2&User=13')
de_de: DurlParam-URL-Parameter (wie &#39;? ID = 2 &amp; User = 13&#39;)
fr_fr: durlParam paramètres d&#39;URL (comme &#39;? ID = 2 &amp; User = 13&#39;)
ru_ru: URL-параметры durlParam (например, &#39;? ID = 2 &amp; User = 13&#39;)

source: function DecorateEMails
de_de: Funktion DecorateEMails
fr_fr: fonction DécorerEMails
ru_ru: функция DecorateEMails

source: Replaces all syntax correct e-mails with 'ADDR'. For example, replaces 'anso@mail.ru' with 'anso@mail.ru'.
de_de: Ersetzt alle Syntax-korrekten E-Mails durch &#39;ADDR&#39;. Ersetzt beispielsweise &quot;anso@mail.ru&quot; durch &quot;anso@mail.ru&quot;.
fr_fr: Remplace tous les courriels dont la syntaxe est correcte par «ADDR». Par exemple, remplace &#39;anso@mail.ru&#39; par &#39;anso@mail.ru&#39;.
ru_ru: Заменяет все письма с правильным синтаксисом на &#39;ADDR&#39;. Например, заменяет «anso@mail.ru» на «anso@mail.ru».

source: function DecorateEMails (const AText : string) : string;
de_de: Funktion DecorateEMails (const AText: string): string;
fr_fr: fonction DecorateEMails (const AText: chaîne): chaîne;
ru_ru: функция DecorateEMails (const AText: строка): строка;

source: Returns input text AText with decorated e-mails
de_de: Gibt den eingegebenen Text AText mit verzierten E-Mails zurück
fr_fr: Renvoie le texte saisi AText avec les e-mails décorés
ru_ru: Возвращает введенный текст AText с оформленными электронными письмами

source: Usage illustrations
de_de: Verwendungsabbildungen
fr_fr: Illustrations d&#39;utilisation
ru_ru: Иллюстрации использования

source: •\ `Text processing from bird's eye view <#article_bird_eye_view.html>`__
de_de: • \ `Textverarbeitung aus der Vogelperspektive &lt;# article_bird_eye_view.html&gt;` __
fr_fr: • \ `Traitement de texte depuis la vue à vol d&#39;oiseau &lt;# article_bird_eye_view.html&gt;` __
ru_ru: • \ `Обработка текста с высоты птичьего полета &lt;# article_bird_eye_view.html&gt;` __

source: •\ `MrDecorator <#article_mrdecorator.html>`__
de_de: • \ `MrDecorator &lt;# article_mrdecorator.html&gt;&gt; __
fr_fr: • \ `MrDecorator &lt;# article_mrdecorator.html&gt;` __
ru_ru: • \ `MrDecorator &lt;# article_mrdecorator.html&gt;` __

source: function DecorateURLs (const AText : string; AFlags : TDecorateURLsFlagSet = [durlAddr, durlPath]) : string;
de_de: Funktion DecorateURLs (const AText: string; AFlags: TDecorateURLsFlagSet = [durlAddr, durlPath]): string;
ru_ru: функция DecorateURLs (const AText: string; AFlags: TDecorateURLsFlagSet = [durlAddr, durlPath]): string;

source: type
de_de: Art
ru_ru: тип

source: Introduction
ru: Вступление

source: If you don't familiar with regular expression, please, take a look at the `r.e.syntax <regexp_syntax.html>`__.
ru: Если вы не знакомы с регулярными выражениями, посмотрите на `синтаксис регулярных выражений <regexp_syntax.html>`__.

source: Windows compiled
ru: Windows скомпилирована

source: First of all I recommend You to read `Text processing from bird's eye view <https://masterandrey.com/posts/en/text_processing_from_birds_eye_view.html>`__.
ru: Прежде всего, я рекомендую вам прочитать `Обработка текста с высоты птичьего полета <https://masterandrey.com/posts/en/text_processing_from_birds_eye_view.html>`__.

source: This localized versions distributed in localized full TRegExpr packages, and in separate localized documentation packages (when you unpack this documentation package in TRegExpr directory the localized demos overwrite English ones).
ru: Эти локализованные версии распространяются в локализованных полных пакетах TRegExpr и в отдельных локализованных пакетах документации (когда вы распаковываете этот пакет документации в каталоге TRegExpr, локализованные демки перезаписывают английские).

source: `Text2HTML sources <https://github.com/masterandrey/TRegExpr/tree/master/examples/Text2HTML>`_
ru: `Text2HTML исходники <https://github.com/masterandrey/TRegExpr/tree/master/examples/Text2HTML>`_

source: Publish plain text as HTML
ru: Преобразует текст в HTML

source: Uses unit `HyperLinksDecorator <https://github.com/masterandrey/TRegExpr/blob/master/src/HyperLinksDecorator.pas>`__ that is based on TRegExpr.
ru: Использует блок `HyperLinksDecorator <https://github.com/masterandrey/TRegExpr/blob/master/src/HyperLinksDecorator.pas>`__, основанный на TRegExpr.

source: This unit contains functions to decorate hyper-links.
ru: Этот блок содержит функции для оформления гиперссылок.

source: For example, replaces ``www.masterAndrey.com`` with ``<a href="http://www.masterAndrey.com">www.masterAndrey.com</a>`` or ``anso@mail.ru`` with ``<a href="mailto:filbert@yandex.ru">filbert@yandex.ru</a>``.
ru: Например, замените ``www.masterAndrey.com`` на `` <a href="http://www.masterAndrey.com">www.masterAndrey.com</a> `` или `` anso @ mail.ru`` на `` <a href="mailto:filbert@yandex.ru">filbert@yandex.ru</a> ``.

source: Value
ru: Значение

source: Meaning
ru: Имея в виду

source: Protocol (like ``ftp://`` or ``http://``)
ru: Протокол (например, `` ftp: // `` или `` http: // ``)

source: TCP address or domain name (like ``masterAndrey.com``)
ru: TCP-адрес или доменное имя (например, ``masterAndrey.com``)

source: Port number if specified (like ``:8080``)
ru: Номер порта, если указан (например, ``: 8080``)

source: Path to document (like ``index.html``)
ru: Путь к документу (например, ``index.html``)

source: Book mark (like ``#mark``)
ru: Закладка (например, `` # mark``)

source: URL params (like ``?ID=2&User=13``)
ru: Параметры URL (например, ``? ID = 2 &amp; User = 13``)

source: Returns input text ``AText`` with decorated hyper links.
ru: Возвращает введенный текст ``AText`` с оформленными гиперссылками.

source: ``AFlags`` describes, which parts of hyper-link must be included into visible part of the link.
ru: ``AFlags`` описывает, какие части гиперссылки должны быть включены в видимую часть ссылки.

source: For example, if `AFlags` is ``[durlAddr]`` then hyper link ``www.masterAndrey.com/contacts.htm`` will be decorated as ``<a href="www.masterAndrey.com/contacts.htm">www.masterAndrey.com</a>``.
ru: Например, если `AFlags` равно` `[durlAddr]` `, то гиперссылка` `www.masterAndrey.com / contacts.htm`` будет оформлена <a href="www.masterAndrey.com/contacts.htm">как`</a> ` <a href="www.masterAndrey.com/contacts.htm">www.masterAndrey.com`</a> `.

source: Very simple examples, see comments inside the unit
ru: Очень простые примеры, см. Комментарии внутри блока

source: Slightly more complex examples, see comments inside the unit
ru: Чуть более сложные примеры, см. Комментарии внутри блока
