Repository: Alexey-T/TRegExpr
Catalog: docs/locale/*/LC_MESSAGES/faq.po
Languages: bg, bg_bg, de_de, es_es, fr, fr_fr, ru, ru_ru

source: English
ru: `English <https://regex.sorokin.engineer/en/latest/faq.html>`__

source: `Русский <https://regex.sorokin.engineer/ru/latest/faq.html>`__
ru: Русский

source: FAQ
bg: ЧЗВ
ru: Часто задаваемые вопросы

source: I found a terrible bug: TRegExpr raises Access Violation exception!
bg: Намерих ужасна грешка: TRegExpr повдига изключението за нарушение на достъп!
fr: J&#39;ai trouvé un bug terrible: TRegExpr déclenche une exception de violation d&#39;accès!
ru: Я обнаружил ужасную ошибку: TRegExpr вызывает исключение Access Violation!

source: **Answer**
bg: **Отговор**
fr: **Réponse**
ru: **Ответ**

source: You must create the object before usage. So, after you declared something like:
bg: Трябва да създадете обекта преди употреба. Така че, след като сте декларирали нещо като:
fr: Vous devez créer l&#39;objet avant utilisation. Donc, après avoir déclaré quelque chose comme:
ru: Вы должны создать объект перед использованием. Итак, после того, как вы объявили что-то вроде:

source: do not forget to create the object instance:
bg: не забравяйте да създадете екземпляр на обекта:
bg_bg: не забравяйте да създадете екземпляр на обекта:
de_de: Vergessen Sie nicht, die Objektinstanz zu erstellen:
es_es: No te olvides de crear la instancia de objeto:
fr: n&#39;oubliez pas de créer l&#39;instance d&#39;objet:
fr_fr: n&#39;oubliez pas de créer l&#39;instance d&#39;objet:
ru: не забудьте создать экземпляр объекта:
ru_ru: не забудьте создать экземпляр объекта:

source: Regular expressions with (?=...) do not work
bg: Регулярните изрази с (? = ...) не работят
fr: Les expressions régulières avec (? = ...) ne fonctionnent pas
ru: Регулярные выражения с (? = ...) не работают

source: Look ahead is not implemented in the TRegExpr. But in many cases you can easily `replace it with simple subexpressions <regular_expressions.html#lookahead>`_.
bg: Погледнете напред не се прилага в TRegExpr. Но в много случаи лесно можете да го замените с обикновени `субекспресии <regular_expressions.html#lookahead>`_.
fr: Regarder devant n&#39;est pas implémenté dans le TRegExpr. Mais dans de nombreux cas, vous pouvez facilement le remplacer par de simples `sous-expressions. <regular_expressions.html#lookahead>`_.
ru: Look-ahead не реализованы в TRegExpr. Но во многих случаях вы можете легко заменить их простыми `подвыражениями <regular_expressions.html#lookahead>`_.

source: Does it support Unicode?
bg: Поддържа ли Unicode?
fr: Est-ce qu&#39;il prend en charge Unicode?
ru: Поддерживает ли он Юникод?

source: `How to use Unicode <tregexpr.html#unicode>`__
bg: `Как да използваме Unicode <tregexpr.html#unicode>`__
fr: `Comment utiliser Unicode <tregexpr.html#unicode>`__
ru: `Как использовать Юникод <tregexpr.html#unicode>`__

source: Why does TRegExpr return more then one line?
bg: Защо TRegExpr връща повече от един ред?
fr: Pourquoi TRegExpr renvoie-t-il plus d&#39;une ligne?
ru: Почему TRegExpr возвращает более одной строки?

source: For example, r.e. ``<font .\*>`` returns the first ``<font``, then the rest of the file including last ``</html>``.
bg: Например, `` <font .\*>`` връща първото ``</font> <font``, then the rest of the file including last ``</html> <font .\*>``.</font>
bg_bg: Например, `` <font .\*>`` връща първото ``</font> <font``, then the rest of the file including last ``</html> <font .\*>``.</font>
de_de: Zum Beispiel gibt re `` <font .\*>`` das erste `` zurück</font> <font``, then the rest of the file including last ``</html> <font .\*>``.</font>
es_es: Por ejemplo, re `` <font .\*>`` devuelve el primer ``</font> <font``, then the rest of the file including last ``</html> <font .\*>``.</font>
fr: Par exemple, re `` <font .\*>`` renvoie le premier ``</font> <font``, then the rest of the file including last ``</html> <font .\*>``.</font>
fr_fr: Par exemple, re `` <font .\*>`` renvoie le premier ``</font> <font``, then the rest of the file including last ``</html> <font .\*>``.</font>
ru: Например, регулярное выражение ``<font .\*>`` возвращает первый же ``<font``, далее весь последующий текст до финального``</html>``.
ru_ru: Например, re `` <font .\*>`` возвращает первый ``</font> <font``, then the rest of the file including last ``</html> <font .\*>``.</font>

source: For backward compatibility, `modifier /s <regular_expressions.html#modifier_s>`__ is ``On`` by default.
bg: За обратна съвместимост, `модификатор / и <regular_expressions.html#modifier_s>`__ е` `On`` по подразбиране.
fr: Pour la compatibilité ascendante, modificateur / s <regular_expressions.html#modifier_s>`__ est` `On`` par défaut.
ru: Для обратной совместимости `модификатор /s <regular_expressions.html#modifier_s>`_ по умолчанию ``Вкл``.

source: Switch it Off and ``.`` will match any but `Line separators <regular_expressions.html#syntax_line_separators>`__ - exactly as you wish.
bg: Включете го и &quot;.&quot; Ще съвпадне с всички, но `Разделители на линии <regular_expressions.html#syntax_line_separators>`__ - точно както желаете.
fr: Eteignez-le et ``.`` correspondra à tout sauf `séparateurs de lignes <regular_expressions.html#syntax_line_separators>`__ - exactement comme vous le souhaitez.
ru: Выключите его, и ``.`` будет соответствовать любому символу, кроме `Разделителей строк <regular_expressions.html#syntax_line_separators>`_ - именно так, как вы хотите.

source: BTW I suggest ``<font ([^\n>]*)>``, in ``Match[1]`` will be the URL.
bg: BTW Предлагам `` <font ([^\n>] *)&gt; ``, в `` Match [1] `` ще бъде URL адресът.</font>
fr: BTW, je suggère &quot;` <font ([^\n>] *)&gt; &quot;, dans&quot; Match [1] &quot;sera l&#39;URL.</font>
ru: Я лично предлагаю ``<font ([^\n>] *)>``, тогда в ``Match [1]`` будет URL.

source: Why does TRegExpr return more then I expect?
bg: Защо TRegExpr се връща повече, отколкото очаквам?
fr: Pourquoi TRegExpr renvoie-t-il plus que ce à quoi je m&#39;attendais?
ru: Почему TRegExpr возвращает больше, чем я ожидаю?

source: For example r.e. ``<p>(.+)</p>`` applyed to string ``<p>a</p><p>b</p>`` returns ``a</p><p>b`` but not ``a`` as I expected.
bg: Например re `` <p> (. +) </p> `` приложен към низ ``<p>а</p><p>b</p> `` връща ``a</p><p>b`` но не ``a``, както очаквах.
bg_bg: Например re `` <p> (. +) </p> `` приложен към низ `` <p> а </p><p> б </p> `` връща `` a </p><p> b`` но не `` a``, както очаквах.
de_de: Zum Beispiel: `` <p> (. +) </p> `` auf String `` angewendet <p> ein </p><p> b </p> `` gibt `` a zurück </p><p> b`` aber nicht `` a`` wie ich erwartet hatte.
es_es: Por ejemplo re `` <p> (. +) </p> `` aplicado a la cadena `` <p> una </p><p> segundo </p> `` devuelve `` a </p><p> b`` pero no `` a`` como esperaba.
fr: Par exemple re `` <p> (. +) </p> `` appliqué à la chaîne `` <p> une </p><p> b </p> `` renvoie `` a </p><p> b`` mais pas ``a`` comme je m&#39;y attendais.
fr_fr: Par exemple re `` <p> (. +) </p> `` appliqué à la chaîne `` <p> une </p><p> b </p> `` renvoie `` a </p><p> b`` mais pas `` a`` comme je m&#39;y attendais.
ru: Например ``<p> (. +) </p>`` для строки ``<p>a </p><p> b </p>`` возвращает ``a </p><p> b`` но не ``a``, как ожидается.
ru_ru: Например &#39;`` <p> (. +) </p> `` применяется к строке `` <p> </p><p> б </p> `` возвращает `` a </p><p> b`` но не `` a``, как я ожидал.

source: By default all operators works in ``greedy`` mode, so they match as more as it possible.
bg: По подразбиране всички оператори работят в ``greedy`` режим, така че се съчетават колкото се може повече.
bg_bg: По подразбиране всички оператори работят в `` greedy`` режим, така че се съчетават колкото се може повече.
de_de: Standardmäßig arbeiten alle Operatoren im `` gierigen`` Modus, so dass sie so weit wie möglich zusammenpassen.
es_es: Por defecto, todos los operadores trabajan en modo `` codicioso``, para que coincidan tanto como sea posible.
fr: Par défaut, tous les opérateurs fonctionnent en mode ``greedy``, de sorte qu&#39;ils correspondent le plus possible.
fr_fr: Par défaut, tous les opérateurs fonctionnent en mode `` greedy``, de sorte qu&#39;ils correspondent le plus possible.
ru: По умолчанию все операторы работают в ``жадном`` режиме, поэтому они совпадают как можно больше.
ru_ru: По умолчанию все операторы работают в `` жадном`` режиме, поэтому они совпадают как можно больше.

source: If you want ``non-greedy`` mode you can use ``non-greedy`` operators like ``+?`` and so on or switch all operators into ``non-greedy`` mode with help of modifier ``g`` (use appropriate TRegExpr properties or operator ``?(-g)`` in r.e.).
bg: Ако искате ``алчен`` режим, можете да използвате ``алчни`` оператори като ``+?`` И т.н. или да превключите всички оператори в ``неагресивен`` режим с помощта на модификатор ``g`` (използвайте подходящи свойства на TRegExpr или оператор ``?(-g)`` в re).
fr: Si vous voulez le mode ``non-gourmand``, vous pouvez utiliser des opérateurs ``non-gloutons`` comme ``+?`` Et ainsi de suite ou basculer tous les opérateurs en mode ``non-gloutons`` avec l&#39;aide du modificateur ``g`` (utilisez les propriétés TRegExpr appropriées ou l&#39;opérateur ``?(-g)``dans re).
ru: Если вам нужен режим ``не жадный режим``, вы можете использовать ``не жадные`` варианты операторов, такие как ``+?`` и т. д., или переключить все операторы в ``не жадный`` режим с помощью модификатора ``g`` (используйте соответствующие свойства TRegExpr или оператор ``?(-g)`` внутри выражения).

source: How to parse sources like HTML with help of TRegExpr?
bg: Как да анализираме източници като HTML с помощта на TRegExpr?
fr: Comment analyser des sources comme HTML avec l&#39;aide de TRegExpr?
ru: Как анализировать HTML, с помощью TRegExpr?

source: Sorry folks, but it's nearly impossible!
bg: За съжаление, хора, но е почти невъзможно!
fr: Désolé les gars, mais c&#39;est presque impossible!
ru: Извините, ребята, но это почти невозможно!

source: Of course, you can easily use TRegExpr for extracting some information from HTML, as shown in my examples, but if you want accurate parsing you have to use real parser, not r.e.
bg: Разбира се, можете лесно да използвате TRegExpr за извличане на информация от HTML, както е показано в моите примери, но ако искате точен парс, трябва да използвате истински парсер, а не
fr: Bien sûr, vous pouvez facilement utiliser TRegExpr pour extraire certaines informations à partir de HTML, comme indiqué dans mes exemples, mais si vous souhaitez une analyse précise, vous devez utiliser un analyseur syntaxique réel.
ru: Конечно, вы можете легко использовать TRegExpr для извлечения некоторой информации из HTML, как показано в моих примерах, но если вам нужен точный синтаксический анализ, вы должны использовать полноценный парсер, а не регулярные выражения

source: You can read full explanation in Tom Christiansen and Nathan Torkington ``Perl Cookbook``, for example.
bg: Можете да прочетете пълното обяснение в Том Кристиансен и Нейтън Торкингтън &quot;Perl Cookbook&quot;, например.
fr: Vous pouvez lire une explication complète dans Tom Christiansen et Nathan Torkington, `` Perl Cookbook``, par exemple.
ru: Вы можете прочитать полное объяснение в Том Кристиансен и Натан Торкингтон ``Perl Cookbook``, например.

source: In short - there are many structures that can be easy parsed by real parser but cannot at all by r.e., and real parser is much faster to do the parsing, because r.e. doesn't simply scan input stream, it performs optimization search that can take a lot of time.
bg: Накратко - има много структури, които могат лесно да бъдат анализирани от истинския анализатор, но изобщо не могат да бъдат рестартирани, а реалният парсер е много по-бърз, за да направи синтактичен анализ, защото повторно не сканира входящия поток, той извършва оптимизационно търсене, което може да отнеме много време.
fr: En bref - il existe de nombreuses structures qui peuvent facilement être analysées par un analyseur réel mais ne peuvent pas du tout être analysées. Cet analyseur réel est beaucoup plus rapide à analyser, car il ne scanne pas simplement le flux d&#39;entrée, il effectue une recherche d&#39;optimisation pouvant prendre beaucoup de temps.
ru: Вкратце - есть много структур, которые могут быть легко проанализированы реальным парсером, но не могут быть проанализированы регулярными выражениями. Полноценный парсер намного быстрее выполнит синтаксический анализ.

source: Is there a way to get multiple matches of a pattern on TRegExpr?
bg: Има ли начин да получите множество съвпадения на модел в TRegExpr?
fr: Existe-t-il un moyen d&#39;obtenir plusieurs correspondances d&#39;un modèle sur TRegExpr?
ru: Есть ли способ получить несколько совпадений шаблона на TRegExpr?

source: You can iterate matches with ExecNext method.
bg: Можете да повторите съвпадения с метода ExecNext.
fr: Vous pouvez itérer des correspondances avec la méthode ExecNext.
ru: Вы искать последующие совпадения с помощью метода ExecNext.

source: If you want some example, please take a look at ``TRegExpr.Replace`` method implementation or at the examples for `HyperLinksDecorator <demos.html>`_
bg: Ако искате някакъв пример, моля, вижте реализацията на метода &quot;TRegExpr.Replace&quot; или примери за `HyperLinksDecorator <demos.html>`_
fr: Si vous voulez quelques exemples, jetez un œil à l&#39;implémentation de la méthode ``TRegExpr.Replace`` ou aux exemples de `HyperLinksDecorator <demos.html>`_
ru: Если вам нужен какой-то пример, посмотрите на реализацию метода ``TRegExpr.Replace`` или на примеры для `HyperLinksDecorator <demos.html>`_

source: I am checking user input. Why does TRegExpr return ``True`` for wrong input strings?
bg: Проверявам въвеждането от потребителя. Защо TRegExpr връща &quot;True&quot; за погрешни низове?
fr: Je vérifie les entrées de l&#39;utilisateur. Pourquoi TRegExpr renvoie-t-il ``True`` pour les chaînes d&#39;entrée incorrectes?
ru: Я проверяю пользовательский ввод. Почему TRegExpr возвращает ``True`` для неправильных входных строк?

source: In many cases TRegExpr users forget that regular expression is for **search** in input string.
bg: В много случаи потребителите на TRegExpr забравят, че регулярният израз е за ** search ** във входния низ.
fr: Dans de nombreux cas, les utilisateurs de TRegExpr oublient que l&#39;expression régulière est utilisée pour ** rechercher ** dans la chaîne de saisie.
ru: Во многих случаях пользователи TRegExpr забывают, что регулярное выражение предназначено для **поиска** во входной строке.

source: So, for example if you use ``\d{4,4}`` expression, you will get success for wrong user inputs like ``12345`` or ``any letters 1234``.
bg: Така например, ако използвате `` {4,4} `` израз, ще получите успех за неправилни потребителски входове като ``12345`` или `` всякакви букви 1234``.
fr: Ainsi, par exemple, si vous utilisez une expression `` \ d {4,4} ``, vous obtiendrez un succès pour les entrées utilisateur incorrectes telles que ``12345`` ou ``toutes les lettres 1234``.
ru: Так, например, выражение ``\d{4,4}`` совпадет и с ``12345`` и с ``любые буквы 1234``.

source: You have to check from line start to line end to ensure there are no anything else around: ``^\d{4,4}$``.
bg: Трябва да проверите от начало на ред до край на ред, за да сте сигурни, че няма нищо друго около: `` ^ {4,4} $ ``.
fr: Vous devez vérifier du début à la fin de la ligne pour vous assurer qu&#39;il n&#39;y a plus rien d&#39;autre: `` ^ \ d {4,4} $ ``.
ru: Вы должны проверить от начала строки до конца строки, чтобы убедиться, что вокруг ничего больше нет: ``^\d{4,4}$``.

source: Why does non-greedy iterators sometimes work as in greedy mode?
bg: Защо понякога алчните итератори работят както в алчен режим?
bg_bg: Защо понякога алчните итератори работят както в алчен режим?
de_de: Warum funktionieren nichtgierige Iteratoren manchmal wie im gierigen Modus?
es_es: ¿Por qué los iteradores no codiciosos a veces funcionan como en modo codicioso?
fr: Pourquoi les itérateurs non-gourmands fonctionnent-ils parfois comme en mode gourmand?
fr_fr: Pourquoi les itérateurs non-gourmands fonctionnent-ils parfois comme en mode gourmand?
ru: Почему не жадные итераторы иногда работают в жадном режиме?
ru_ru: Почему не жадные итераторы иногда работают как в жадном режиме?

source: For example, the r.e. ``a+?,b+?`` applied to string ``aaa,bbb`` matches ``aaa,b``, but should it not match ``a,b`` because of non-greediness of first iterator?
bg: Например, ре-`a + ?, b +?` `, Приложено към низа` `aaa, bbb``, съвпада с` `aaa, b``, но ако не съвпада с` `a, b`` заради не-алчността на първия итератор?
bg_bg: Например, ре-`a + ?, b +?` `, Приложено към низа` `aaa, bbb``, съвпада с` `aaa, b``, но ако не съвпада с` `a, b`` заради не-алчността на първия итератор?
de_de: Zum Beispiel entspricht das re `` a +?, B +? ``, Das auf den String `` aaa, bbb`` angewendet wird, `` aaa, b``, sollte aber nicht mit `` a, b`` wegen Nichtgierigkeit übereinstimmen des ersten Iterators?
es_es: Por ejemplo, ¿se aplica re `` a +? B +? `` A la cadena `` aaa, bbb`` coincide con `` aaa, b``, pero no debe coincidir con `` a, b`` debido a la falta de codicia de primer iterador?
fr: Par exemple, le r.e. ``a+?,b+?`` Appliqué à la chaîne ``aaa,bbb`` correspond à ``aaa,b``, mais ne devrait-il pas correspondre à ``a,b`` à cause de la non-cupidité du premier itérateur?
fr_fr: Par exemple, le re `` a + ?, b +? `` Appliqué à la chaîne `` aaa, bbb`` correspond à `` aaa, b``, mais ne devrait-il pas correspondre à `` a, b`` à cause de la non-cupidité du premier itérateur?
ru: Например, ``a+?,b+?``, для строки ``aaa,bbb``, найдет ``aaa,b``, но не ``a,b`` хотя первый итератор не жаден?
ru_ru: Например, re `` a + ?, b +? ``, Примененное к строке `` aaa, bbb``, соответствует `` aaa, b``, но не должно совпадать с `` a, b`` из-за жадности первого итератора?

source: This is because of TRegExpr way to work. In fact many others r.e. engines work exactly the same: they performe only ``simple`` search optimization, and do not try to do the best optimization.
bg: Това е така, защото на TRegExpr начинът на работа. В действителност много други двигатели работят по същия начин: те извършват само &quot;проста&quot; оптимизация на търсенето и не се опитват да направят най-добрата оптимизация.
fr: C&#39;est à cause de la manière de TRegExpr de travailler. En fait, beaucoup d&#39;autres moteurs fonctionnent exactement de la même manière: ils ne font que l&#39;optimisation de la recherche ``simple``, et n&#39;essayent pas de faire la meilleure optimisation.
ru: Регулярные выражения только ищут первое же совпадение и не пытаются найти "наилучшее" совпадение.

source: In some cases it's bad, but in common it's rather advantage then limitation, because of performance and predictability reasons.
bg: В някои случаи това е лошо, но като цяло е по-скоро предимство, отколкото ограничение, поради причини за производителност и предсказуемост.
fr: Dans certains cas, c&#39;est mauvais, mais en commun, c&#39;est plutôt un avantage que une limitation, pour des raisons de performance et de prévisibilité.
ru: В некоторых случаях это плохо, но в целом это скорее преимущество, чем ограничение, по причинам производительности и предсказуемости.

source: The main rule - r.e. first of all try to match from current place and only if that's completely impossible move forward by one char and try again from next position in the text.
bg: Главното правило - преди всичко се опитвайте да съвпадат от текущото място и само ако това е напълно невъзможно да се движите напред с един знак и опитайте отново от следващата позиция в текста.
fr: La règle principale - essayez d’abord de faire la correspondance à partir de l’emplacement actuel et seulement si cela est absolument impossible, avancez d’un caractère et essayez à nouveau de la position suivante dans le texte.
ru: Основное правило - сначала пытаемся найти соотвествие, начиная с текущей позиции в строке и, только если это невозможно, продвигаемся на один символ вперед и попробуем снова со следующей позиции в тексте.

source: So, if you use ``a,b+?`` it'll match ``a,b``. In case of ``a+?,b+?`` it's now not recommended (we add non-greedy modifyer) but still possible to match more then one ``a``, so TRegExpr will do it.
bg: Така че, ако използвате ``a,b+?``, Ще съвпадне ``a,b``. В случай на ``a+?,b+?`` Сега не се препоръчва (добавяме алчни модификатори), но все пак е възможно да се съчетава повече от един ``a``, така че TRegExpr ще го направи.
fr: Donc, si vous utilisez «a, b +?», Cela correspond à «a, b». Dans le cas de ``a+?,b+?``, Ce n&#39;est plus recommandé (nous ajoutons un modificateur non-glouton) mais il est toujours possible de faire correspondre plus d&#39;un ``a``, donc TRegExpr le fera.
ru: Если вы используете ``a,b+?`` то это будет соответствовать ``a,b``. В случае ``a+?,b+?``, не смотря на не жадный модификатор, все же возможно захватить более одного ``a``, поэтому TRegExpr сделает это.

source: TRegExpr like Perl's or Unix's r.e. doesn't attempt to move forward and check - would it will be "better" match. Fisrt of all, just because there is no way to say it's more or less good match.
bg: TRegExpr като Perl или Unix не се опитва да се движи напред и чек - дали ще бъде &quot;по-добър&quot; мач. От всички, просто защото няма начин да се каже, че е по-малко или по-малко добро.
fr: TRegExpr comme Perl ou Unix ne tente pas d’avancer et de vérifier - ce serait une &quot;meilleure&quot; correspondance. En premier lieu, juste parce qu’il n’ya aucun moyen de dire que c’est plus ou moins bon.
ru: Регулярные выражения, не пытаются двигаться дальше по тексту и проверять - удастся ли найти "лучшее" совпадение. Хотя бы потому, что нельзя сказать, что такое "лучше".

source: How can I use TRegExpr with Borland C++ Builder?
bg: Как мога да използвам TRegExpr с Borland C ++ Builder?
fr: Comment utiliser TRegExpr avec Borland C ++ Builder?
ru: Как использовать TRegExpr с Borland C ++ Builder?

source: I have a problem since no header file (``.h`` or ``.hpp``) is available.
bg: Имам проблем, тъй като не е наличен заглавен файл (&quot;.h&quot; или &quot;.hpp&quot;).
fr: J&#39;ai un problème car aucun fichier d&#39;en-tête (``.h`` ou ``.hpp``) n&#39;est disponible.
ru: У меня проблема, нет файла заголовка (``.h`` или ``.hpp``).

source: Add ``RegExpr.pas`` to ``bcb`` project.
bg: Добавете ``RegExpr.pas`` към проекта ``bcb``.
fr: Ajoutez ``RegExpr.pas`` au projet ``bcb``.
ru: Добавьте ``RegExpr.pas`` к проекту ``bcb``.

source: Compile project. This generates the header file ``RegExpr.hpp``.
bg: Съставете проект. Това генерира заглавния файл ``RegExpr.hpp``.
fr: Compiler le projet. Cela génère le fichier d’en-tête ``RegExpr.hpp``.
ru: Скомпилировать проект. Это создает заголовочный файл ``RegExpr.hpp``.

source: Now you can write code which uses the ``RegExpr`` unit.
bg: Сега можете да напишете код, който използва модула ``RegExpr``.
fr: Vous pouvez maintenant écrire du code utilisant l’unité ``RegExpr``.
ru: Теперь вы можете писать код, использующий модуль ``RegExpr``.

source: Don't forget to add ``#include “RegExpr.hpp”`` where needed.
bg: Не забравяйте да добавите `` #include &#39;RegExpr.hpp&#39; `` където е необходимо.
fr: N&#39;oubliez pas d&#39;ajouter «#include« RegExpr.hpp »` `si nécessaire.
ru: Не забудьте добавить ``#include “RegExpr.hpp”`` там, где это необходимо.

source: Don't forget to replace all ``\`` in regular expressions with ``\\`` or redefined `EscChar <tregexpr.html#escchar>`__ const.
bg: Не забравяйте да замените всички `` в регулярни изрази с `` `или предефинира` `EscChar \ t <tregexpr.html#escchar>`__ const.
fr: N&#39;oubliez pas de remplacer tous les ``\`` dans les expressions régulières par ``\\`` ou redéfinis `EscChar <tregexpr.html#escchar>`__ const.
ru: Не забудьте заменить все ``\`` в регулярных выражениях на ``\`` или переопределить `EscChar <tregexpr.html#escchar>`_ const.
