Repository: Alexey-T/TRegExpr
Catalog: docs/locale/*/LC_MESSAGES/faq.po
Languages: bg, bg_bg, de_de, es_es, fr, fr_fr, ru, ru_ru

source: Why many r.e. (including r.e. from TRegExpr help and demo) work wrong in Borland C++ Builder?
bg: Защо много от тях (включително re от TRegExpr помощ и демо) работят погрешно в Borland C ++ Builder?
fr: Pourquoi beaucoup de solutions (y compris de l&#39;aide et de la démonstration TRegExpr) fonctionnent-elles mal dans Borland C ++ Builder?
ru: Почему многие примеры (включая примеры из документации) работают неправильно в Borland C ++ Builder?

source: The hint is in the previous question ;) Symbol ``\`` has special meaning in ``C++``, so you have to ``escape`` it (as described in previous answer). But if you don't like r.e. like ``\\w+\\\\w+\\.\\w+`` you can redefine the constant ``EscChar`` (in ``RegExpr.pas``). For example ``EscChar = "/"``. Then you can write ``/w+/w+/./w+``, looks unusual but more readable.
bg: Намекът е в предишния въпрос;) Символ `` има специално значение в `` C ++ ``, така че трябва да го ``избягаш`` (както е описано в предишния отговор). Но ако не ви харесва отново като `` + + &#39;&#39; w + `` можете да предефинирате константата ``EscChar`` (в ``RegExpr.pas``). Например ``EscChar = &quot;/&quot;``. Тогава можете да напишете ``/w+/w+/./w+``, изглежда необичайно, но по-разбираемо.
fr: Le conseil se trouve dans la question précédente;) Le symbole `` `` a une signification particulière dans ``C++``, il faut donc ``y échapper`` (comme décrit dans la réponse précédente). Mais si vous n&#39;aimez pas les choses comme ``\\w + \\\\ w + \\. \\ w + ``, vous pouvez redéfinir la constante ``EscChar`` (dans ``RegExpr.pas``). Par exemple ``EscChar = &quot;/&quot;``. Ensuite, vous pouvez écrire ``/w+/w+/./w+``, semble inhabituel mais plus lisible.
ru: Подсказка есть в предыдущем вопросе;) Символ ``\`` имеет особое значение в ``C ++``, поэтому вы должны ``эскейпить`` его (как описано в предыдущем ответе). Но если вам не нравится, как выглядит ``\w+\\w+\.\w+``, вы можете переопределить константу ``EscChar`` (в ``RegExpr.pas``). Скажем, ``EscChar = "/"``. Затем вы можете написать ``/w+/w+/. /W+`` - выглядит необычно, но более читабельно.

source: Why TRegExpr does not work with regex with #0 inside?
ru: Почему TRegExpr не работает со строками с #0 внутри?

source: The TRegExpr parser does support input strings with #0 chars. The support was added by [Alexey-T](https://github.com/Alexey-T).
ru: Поддержка строк с нулевыми символами была добавлена в TRegExpr в 2019 году [Alexey-T](https://github.com/Alexey-T).

source: But at the moment #0 chars insire regex are not supported.
ru: Но нулевые символы внутри самого регулярного выражения так и не поддерживаются.

source: So you can parse text with `#0`-chars inside it but you cannot use regex with `#0`-chars or `\x00` expression inside.
ru: Таким образом вы можете обрабатывать текст с нулевыми символами но не можете вставлять нулевые символы или выражения `\x00` в регулярное выражение.

source: r := TRegExpr.Create.
bg: r: = TRegExpr.Създайте.

source: Q. I found a terrible bug: TRegExpr raises Access Violation exception!
bg_bg: Открих ужасна грешка: TRegExpr повдига изключението за нарушение на достъп!
de_de: F. Ich habe einen schrecklichen Fehler gefunden: TRegExpr löst Zugriffsverletzungsausnahme aus!
es_es: P. Encontré un error terrible: ¡TRegExpr genera una excepción de violación de acceso!
fr_fr: Q. J&#39;ai trouvé un bug terrible: TRegExpr déclenche une exception de violation d&#39;accès!
ru_ru: В. Я обнаружил ужасную ошибку: TRegExpr вызывает исключение Access Violation!

source: A.
bg_bg: А.
de_de: EIN.
fr_fr: UNE.

source: You must create the object before usage. So, after You declared something like:
bg_bg: Трябва да създадете обекта преди употреба. Така че, след като ти обяви нещо като:
de_de: Sie müssen das Objekt vor der Verwendung erstellen. Nachdem Sie so etwas erklärt haben:
es_es: Debe crear el objeto antes de su uso. Entonces, después de que declaraste algo como:
fr_fr: Vous devez créer l&#39;objet avant utilisation. Donc, après avoir déclaré quelque chose comme:
ru_ru: Вы должны создать объект перед использованием. Итак, после того, как Вы заявили что-то вроде:

source: Q. How can I use TRegExpr with Borland C++ Builder?
bg_bg: В. Как мога да използвам TRegExpr с Borland C ++ Builder?
de_de: F: Wie kann ich TRegExpr mit Borland C ++ Builder verwenden?
es_es: P. ¿Cómo puedo usar TRegExpr con Borland C ++ Builder?
fr_fr: Q. Comment utiliser TRegExpr avec Borland C ++ Builder?
ru_ru: В. Как я могу использовать TRegExpr с Borland C ++ Builder?

source: I have a problem since no header file (.h or .hpp) is available.
bg_bg: Имам проблем, тъй като не е наличен заглавен файл (.h или .hpp).
de_de: Ich habe ein Problem, da keine Header-Datei (.h oder .hpp) verfügbar ist.
es_es: Tengo un problema ya que no hay ningún archivo de encabezado (.h o .hpp) disponible.
fr_fr: J&#39;ai un problème car aucun fichier d&#39;en-tête (.h ou .hpp) n&#39;est disponible.
ru_ru: У меня проблема, так как нет файла заголовка (.h или .hpp).

source: Add RegExpr.pas to bcb project.
bg_bg: Добавете RegExpr.pas към проекта bcb.
de_de: Fügen Sie dem bcb-Projekt RegExpr.pas hinzu.
es_es: Añadir RegExpr.pas al proyecto bcb.
fr_fr: Ajoutez RegExpr.pas au projet bcb.
ru_ru: Добавьте RegExpr.pas в проект bcb.

source: Compile project. This generates the header file RegExpr.hpp.
bg_bg: Съставете проект. Това генерира заглавния файл RegExpr.hpp.
de_de: Projekt kompilieren Dadurch wird die Headerdatei RegExpr.hpp generiert.
es_es: Compilar proyecto. Esto genera el archivo de cabecera RegExpr.hpp.
fr_fr: Compiler le projet. Cela génère le fichier d&#39;en-tête RegExpr.hpp.
ru_ru: Скомпилировать проект. Это создает заголовочный файл RegExpr.hpp.

source: Now one can write code which uses the RegExpr unit.
bg_bg: Сега човек може да пише код, който използва RegExpr единица.
de_de: Jetzt kann man Code schreiben, der die RegExpr-Einheit verwendet.
es_es: Ahora se puede escribir el código que utiliza la unidad RegExpr.
fr_fr: Maintenant, on peut écrire du code qui utilise l&#39;unité RegExpr.
ru_ru: Теперь можно написать код, который использует блок RegExpr.

source: Don`t forget to add #include “RegExpr.hpp” where needed.
bg_bg: Не забравяйте да добавите #include “RegExpr.hpp” където е необходимо.
de_de: Vergessen Sie nicht, #include &quot;RegExpr.hpp&quot; hinzuzufügen, wenn dies erforderlich ist.
es_es: No olvide agregar #include &quot;RegExpr.hpp&quot; donde sea necesario.
fr_fr: N&#39;oubliez pas d&#39;ajouter #include “RegExpr.hpp” si nécessaire.
ru_ru: Не забудьте добавить #include «RegExpr.hpp», где это необходимо.

source: Don\ ``t forget to replace all``\\\ ``in regular expressions with``\\\\` or redefined `EscChar <tregexpr_interface.html#escchar>`__ const.
bg_bg: Не забравяйте да замените всички редовни изрази с `` или &#39;&#39; предефинира &#39;`EscChar \ t <tregexpr_interface.html#escchar> `__ const.
de_de: Vergessen Sie nicht, alle `` \\\ `` in regulären Ausdrücken durch `` \\\\ `zu ersetzen oder` EscChar neu zu definieren <tregexpr_interface.html#escchar> __ const.
es_es: No olvides reemplazar todos los `` \\\ `` en expresiones regulares con `` \\\\ `o redefinido` EscChar <tregexpr_interface.html#escchar> `__ const.
fr_fr: Ne pas oublier de remplacer all`` \\\ `` dans les expressions rationnelles par`` \\\\ `ou redéfini` EscChar <tregexpr_interface.html#escchar> `__ const.
ru_ru: Не забывайте заменять все `` \\\ `` в регулярных выражениях на `` \\\\ `или переопределять` EscChar <tregexpr_interface.html#escchar> `__ const.

source: Q. Why many r.e. (including r.e. from TRegExpr help and demo) work wrong in Borland C++ Builder?
bg_bg: Въпрос: Защо много от тях (включително от TRegExpr помощ и демо) работят неправилно в Borland C ++ Builder?
de_de: F: Warum arbeiten viele (einschließlich TRegExpr-Hilfe und -Demo) im Borland C ++ Builder falsch?
es_es: P. ¿Por qué muchos de los re (incluido el de TRegExpr help y demo) funcionan mal en Borland C ++ Builder?
fr_fr: Q. Pourquoi beaucoup de solutions (y compris de l&#39;aide et de la démonstration TRegExpr) fonctionnent-elles mal dans Borland C ++ Builder?
ru_ru: В. Почему многие из них (в том числе из справки и демонстрации TRegExpr) работают неправильно в Borland C ++ Builder?

source: Please, reread answer to previous question ;) Symbol ``\\`` has special treting in C++, so You have to ``escape`` it (as described in prev.answer). But if You don\ ``t like r.e. like``\\\w+\\\\\\w+\\.\\w+\ ``You can redefine constant EscChar (RegExpr.pas), for example EscChar=``/``- then r.e. will be``/w+\/w+/./w+`, sligtly unusual but more readable..
bg_bg: Моля, прочетете отговора на предишен въпрос;) Символ `` има специална обработка в C ++, така че трябва да го `` избягате`` (както е описано в prev.answer). Но ако не харесваш подобно на това, то w + \ _ w + \ _ w + `` Можеш да предефинираш константата EscChar (RegExpr.pas), например EscChar = `` / `` - след това отново ще бъде`` / w + / w + /. / w + `, леко необичайно, но по-разбираемо ..
de_de: Bitte lesen Sie die Antwort auf die vorige Frage noch einmal;) Das Symbol `` \\ `` hat ein spezielles Treting in C ++, daher müssen Sie es `` entkommen`` (wie in prev.answer beschrieben). Wenn Sie jedoch keine Lust haben, können Sie das konstante EscChar (RegExpr.pas) neu definieren, z. B. EscChar = `` / `` - dann werden wir`` / w + \ / w + /. / w + `, etwas ungewöhnlich, aber lesbarer.
es_es: Por favor, vuelva a leer la respuesta a la pregunta anterior;) El símbolo `` \\ `` tiene una especificación especial en C ++, así que tiene que `` escapar`` (como se describe en prev.answer). Pero si no te gusta re like`` \\\ w + \\\\\\ w + \\. \\ w + \ `` puedes redefinir la constante EscChar (RegExpr.pas), por ejemplo, EscChar = `` / `` - entonces re será`` / w + \ / w + /. / w + `, ligeramente inusual pero más legible ..
fr_fr: Veuillez relire la réponse à la question précédente;) Le symbole `` \\ `` a une lecture spéciale en C ++, vous devez donc `` y échapper`` (comme décrit dans la section précédente.). Mais si vous n&#39;aimez pas ressembler à `` \\\ w + \\\\\\ w + \\. \\ w + \ `` Vous pouvez redéfinir la constante EscChar (RegExpr.pas), par exemple EscChar = `` / `` - puis nous serons`` / w + \ / w + /. / w + `, légèrement inhabituel mais plus lisible ..
ru_ru: Пожалуйста, перечитайте ответ на предыдущий вопрос;) Символ `` \\ `` имеет специальный трейтинг в C ++, поэтому вы должны его `` экранировать`` (как описано в prev.answer). Но если вам не нравится &#39;like&#39; `\\\ w + \\\\\\ w + \\. \\ w + \` `Вы можете переопределить константу EscChar (RegExpr.pas), например EscChar =` ` / `` - тогда re будет `` / w + \ / w + /. / w + `, немного необычно, но более читабельно ..

source: Q. Why does TRegExpr return more then one line?
bg_bg: Въпрос: Защо TRegExpr връща повече от един ред?
de_de: Q. Warum gibt TRegExpr mehr als eine Zeile zurück?
es_es: P. ¿Por qué TRegExpr devuelve más de una línea?
fr_fr: Q. Pourquoi TRegExpr renvoie-t-il plus d&#39;une ligne?
ru_ru: В. Почему TRegExpr возвращает более одной строки?

source: For backward compatibility, `modifier /s <regexp_syntax.html#modifier_s>`__ is ``On`` by default.
bg_bg: За обратна съвместимост, `модификатор / и <regexp_syntax.html#modifier_s> `__ е` `On`` по подразбиране.
de_de: Für Rückwärtskompatibilität `Modifier / s <regexp_syntax.html#modifier_s> `__ ist standardmäßig` `Ein``.
es_es: Para compatibilidad con versiones anteriores, `modificador / s <regexp_syntax.html#modifier_s> `__ es` `On`` por defecto.
fr_fr: Pour la compatibilité ascendante, modificateur / s <regexp_syntax.html#modifier_s> `__ est` `On`` par défaut.
ru_ru: Для обратной совместимости `модификатор / с <regexp_syntax.html#modifier_s> `__ по умолчанию` `Вкл``.

source: Switch it Off and ``.`` will match any but `Line separators <regexp_syntax.html#syntax_line_separators>`__ - as you wish.
bg_bg: Включете го и &quot;.&quot; Ще съвпадне с всички, но `Разделители на линии <regexp_syntax.html#syntax_line_separators> `__ - както желаете.
de_de: Schalten Sie es aus und `` .`` passt zu allen anderen als &#39;Trennzeichen&#39; <regexp_syntax.html#syntax_line_separators> __ - wie Sie möchten.
es_es: Apáguelo y `` .`` coincidirá con cualquiera, excepto con `Separadores de línea <regexp_syntax.html#syntax_line_separators> `__ - como quieras.
fr_fr: Eteignez-le et `` .`` correspondra à tout sauf `séparateurs de lignes <regexp_syntax.html#syntax_line_separators> `__ - comme vous voulez.
ru_ru: Выключите его, и `` .`` будет соответствовать любому, кроме `Разделителей строк <regexp_syntax.html#syntax_line_separators> `__ - как пожелаешь.

source: BTW I suggest you ``<font (\[^\\n>\]\*)>``, in Match[1] will be URL.
bg_bg: BTW Предлагам ви `` <font (\[^\\n>]&gt; ``, в Match [1] ще бъде URL.</font>
de_de: Übrigens schlage ich vor, dass Sie `` <font (\[^\\n>\] \ *)&gt; `` `in URL [1] sind.</font>
es_es: Por cierto, te sugiero que `` <font (\[^\\n>\] \ *)&gt; ``, en Match [1] sea la URL.</font>
fr_fr: BTW, je vous suggère &quot;` <font (\[^\\n>\] \ *)&gt; ``, dans Match [1] sera URL.</font>
ru_ru: Кстати, я предлагаю вам `` <font (\[^\\n>\] \ *)&gt; ``, в Match [1] будет URL.</font>

source: Q. Why does TRegExpr return more then I expect?
bg_bg: Въпрос: Защо TRegExpr се връща повече, отколкото очаквам?
de_de: Q. Warum gibt TRegExpr mehr als ich erwarte?
es_es: P. ¿Por qué TRegExpr devuelve más de lo que espero?
fr_fr: Q. Pourquoi TRegExpr renvoie-t-il plus que ce à quoi je m&#39;attendais?
ru_ru: В. Почему TRegExpr возвращает больше, чем я ожидаю?

source: If You want ``non-greedy`` mode You can use ``non-greedy`` operators like ``+?`` and so on (new in v. 0.940) or switch all operators into ``non-greedy`` mode with help of modifier ``g`` (use appropriate TRegExpr properties or constractions like ``?(-g)`` in r.e.).
bg_bg: Ако искате `` не жаден &#39;&#39; режим Можете да използвате `` не жадните`` оператори като `` +? `` И т.н. `mode с помощта на модификатор` `g`` (използвайте подходящи свойства на TRegExpr или конструкции като` `? (- g)` `в re).
de_de: Wenn Sie den `` non-greedy``-Modus möchten, können Sie `` non-greedy&#39;&#39;-Operatoren wie `` +? `` Usw. verwenden (neu in Version 0.940) oder alle Operatoren in `` non-greedy &#39;umschalten `Modus mit Hilfe des Modifizierers` `g`` (verwenden Sie die entsprechenden TRegExpr-Eigenschaften oder -Einschränkungen wie` `? (- g)` `in re).
es_es: Si desea el modo `` no codicioso``, puede usar operadores `` no codiciosos`` como `` +? `` Y así sucesivamente (nuevo en v. 0.940) o cambiar todos los operadores a `` no codiciosos` `mode con la ayuda del modificador` `g`` (use las propiedades TRegExpr apropiadas o interpretaciones como` `? (- g)` `en re).
fr_fr: Si vous voulez le mode `` non-greedy`` Vous pouvez utiliser des opérateurs `` non-greedy`` comme `` +? `` Et ainsi de suite (nouveauté dans la version 0.940) ou basculer tous les opérateurs en `` non-greedy` `mode avec l&#39;aide du modificateur` `g`` (utilisez les propriétés TRegExpr appropriées ou des constructions telles que`?? (- g) `` dans re).
ru_ru: Если вы хотите режим `` non-greedy``, вы можете использовать операторы `` non-greedy``, такие как `` +? `` И т. Д. (Новое в v. 0.940), или переключить все операторы в `` non-greedy` `режим с помощью модификатора` `g`` (используйте соответствующие свойства или ограничения TRegExpr, такие как` `? (- g)` `в re).

source: Q. How to parse sources like HTML with help of TRegExpr
bg_bg: Въпрос: Как да разберем източници като HTML с помощта на TRegExpr
de_de: Q. Wie analysiert man Quellen wie HTML mit Hilfe von TRegExpr?
es_es: P. ¿Cómo analizar fuentes como HTML con la ayuda de TRegExpr?
fr_fr: Q. Comment analyser des sources telles que HTML à l&#39;aide de TRegExpr
ru_ru: В. Как анализировать источники, такие как HTML, с помощью TRegExpr

source: Sorry folks, but it`s nearly impossible!
bg_bg: За съжаление, хора, но е почти невъзможно!
de_de: Sorry Leute, aber es ist fast unmöglich!
es_es: Lo siento gente, pero es casi imposible!
fr_fr: Désolé les gars, mais c&#39;est presque impossible!
ru_ru: Извините, ребята, но это почти невозможно!

source: Of course, You can easily use TRegExpr for extracting some information from HTML, as shown in my examples, but if You want accurate parsing You have to use real parser, not r.e.!
bg_bg: Разбира се, можете лесно да използвате TRegExpr за извличане на някаква информация от HTML, както е показано в моите примери, но ако искате точен парсинг, трябва да използвате истински парсер, а не!
de_de: Natürlich können Sie TRegExpr problemlos verwenden, um einige Informationen aus HTML zu extrahieren, wie in meinen Beispielen gezeigt.
es_es: Por supuesto, puede usar TRegExpr fácilmente para extraer cierta información de HTML, como se muestra en mis ejemplos, pero si desea un análisis preciso, debe usar el analizador real, ¡no re!
fr_fr: Bien sûr, vous pouvez facilement utiliser TRegExpr pour extraire certaines informations à partir de HTML, comme indiqué dans mes exemples, mais si vous souhaitez une analyse précise, vous devez utiliser un véritable analyseur, pas re!
ru_ru: Конечно, вы можете легко использовать TRegExpr для извлечения некоторой информации из HTML, как показано в моих примерах, но если вы хотите точного разбора, вы должны использовать настоящий парсер, а не re!

source: You can read full explanation in Tom Christiansen and Nathan Torkington ``Perl Cookbook``, for example. In short - there are many constractions that can be easy parsed by real parser but cannot at all by r.e., and real parser is MUCH faster do the parsing, because r.e. doesn`t simply scan input stream, it performes optimization search that can take a lot of time.
bg_bg: Можете да прочетете пълното обяснение в Том Кристиансен и Нейтън Торкингтън &quot;Perl Cookbook&quot;, например. Накратко - има много конструкции, които могат лесно да бъдат анализирани от истинския анализатор, но въобще не могат да бъдат рестартирани, а реалният анализатор е много по-бърз, тъй като повторно не сканира входния поток, той извършва оптимизационно търсене, което може да отнеме много време.
de_de: Die vollständige Erklärung finden Sie beispielsweise in Tom Christiansen und Nathan Torkington, `` Perl Cookbook``. Kurz gesagt, es gibt viele Einschränkungen, die von einem echten Parser leicht analysiert werden können, aber re-Parser ist VIEL schneller, da re nicht nur den Eingabestrom scannt, sondern eine Optimierungssuche ausführt, die eine viel Zeit.
es_es: Puede leer la explicación completa en Tom Christiansen y Nathan Torkington `` Perl Cookbook``, por ejemplo. En resumen, existen muchas interpretaciones que pueden analizarse fácilmente con un analizador real, pero no con el análisis real, y el analizador real es MUCHO más rápido que el análisis, ya que no simplemente escanea el flujo de entrada, realiza una búsqueda de optimización que puede realizar una búsqueda mucho tiempo.
fr_fr: Vous pouvez lire une explication complète dans Tom Christiansen et Nathan Torkington, `` Perl Cookbook``, par exemple. En bref - il existe de nombreuses constructions qui peuvent être facilement analysées par un analyseur réel mais ne peuvent pas du tout être analysées, et cet analyseur réel est BEAUCOUP plus rapide, car l&#39;analyse ne permet pas simplement d&#39;analyser le flux d&#39;entrée, il effectue une recherche d&#39;optimisation pouvant prendre un certain temps. beaucoup de temps.
ru_ru: Вы можете прочитать полное объяснение в Том Кристиансен и Натан Торкингтон `` Perl Cookbook``, например. Вкратце - есть много ограничений, которые могут быть легко проанализированы реальным парсером, но не могут быть проанализированы ре, и реальный парсер НАМНОГО быстрее выполняет синтаксический анализ, потому что он не просто сканирует входной поток, он выполняет оптимизационный поиск, который может занять много времени.

source: Q. Is there a way to get multiple matchs of a pattern on TRegExpr?
bg_bg: Въпрос: Има ли начин да се получат множество съвпадения на модел в TRegExpr?
de_de: F. Gibt es eine Möglichkeit, mehrere Übereinstimmungen eines Musters in TRegExpr abzurufen?
es_es: P. ¿Hay una manera de obtener múltiples coincidencias de un patrón en TRegExpr?
fr_fr: Q. Existe-t-il un moyen d&#39;obtenir plusieurs correspondances d&#39;un modèle sur TRegExpr?
ru_ru: В. Есть ли способ получить несколько совпадений шаблона на TRegExpr?

source: You can make loop and iterate match by match with ExecNext method.
bg_bg: Можете да създадете цикъл и да повторите съвпадение по съвпадение с метода ExecNext.
de_de: Sie können eine Schleife und eine Wiederholung der Übereinstimmung mit der ExecNext-Methode erstellen.
es_es: Puede hacer un bucle e iterar coincidencia por coincidencia con el método ExecNext.
fr_fr: Vous pouvez faire correspondre boucle et iter par match avec la méthode ExecNext.
ru_ru: Вы можете сделать цикл и повторить совпадение с помощью метода ExecNext.

source: It cannot be done more easily becase of Dalphi isn\ ``t interpretator as Perl (and it``\ s benefit - interpretators work very slow!).
bg_bg: Тя не може да бъде направена по-лесно, ако Далфи не е тълкувател като Перл (а ползата - тълкувателите работят много бавно!).
de_de: Dies ist nicht einfacher zu bewerkstelligen, da Dalphi nicht als Interpret von Perl fungiert (und sein Vorteil - Interpretatoren arbeiten sehr langsam!).
es_es: No se puede hacer más fácilmente, ya que Dalphi no es un interpretador como Perl (¡y su beneficio es que los interpretadores funcionan muy despacio!).
fr_fr: Cela ne peut pas être fait plus facilement parce que Dalphi n´est pas un interpréteur comme Perl (et c´est un avantage - les interprètes travaillent très lentement!).
ru_ru: Это не может быть сделано проще, потому что Дальфи не интерпретирует как Perl (и это выгодно - интерпретаторы работают очень медленно!).

source: If You want some example, please take a look at TRegExpr.Replace method implementation. or at the examples in `HyperLinksDecorator.pas <#hyperlinksdecorator.html>`__
bg_bg: Ако искате някакъв пример, моля вижте прилагането на метода TRegExpr.Replace. или в примерите в `HyperLinksDecorator.pas &lt;# hyperlinksdecorator.html&gt;` __
de_de: Wenn Sie ein Beispiel möchten, werfen Sie einen Blick auf die Implementierung der TRegExpr.Replace-Methode. oder bei den Beispielen in `HyperLinksDecorator.pas &lt;# hyperlinksdecorator.html&gt;` __
es_es: Si desea algún ejemplo, eche un vistazo a la implementación del método TRegExpr.Replace. o en los ejemplos en `HyperLinksDecorator.pas &lt;# hyperlinksdecorator.html&gt;` __
fr_fr: Si vous voulez des exemples, jetez un coup d’œil à l’implémentation de la méthode TRegExpr.Replace. ou aux exemples dans `HyperLinksDecorator.pas &lt;# hyperlinksdecorator.html&gt;` __
ru_ru: Если вам нужен пример, посмотрите на реализацию метода TRegExpr.Replace. или в примерах в `HyperLinksDecorator.pas &lt;# hyperlinksdecorator.html&gt;` __

source: Q. I am checking user input. Why does TRegExpr return ``True`` for wrong input strings?
bg_bg: Въпрос: Проверявам потребителските данни. Защо TRegExpr връща &quot;True&quot; за погрешни низове?
de_de: F. Ich überprüfe die Benutzereingaben. Warum gibt TRegExpr für falsche Eingabezeichenfolgen &quot;True&quot; zurück?
es_es: P. Estoy comprobando la entrada del usuario. ¿Por qué TRegExpr devuelve `` True`` para las cadenas de entrada incorrectas?
fr_fr: Q. Je vérifie les entrées de l&#39;utilisateur. Pourquoi TRegExpr renvoie-t-il `` True`` pour les chaînes d&#39;entrée incorrectes?
ru_ru: В. Я проверяю пользовательский ввод. Почему TRegExpr возвращает `` True`` для неверных строк ввода?
