Repository: Alexey-T/TRegExpr
Catalog: docs/locale/*/LC_MESSAGES/faq.po
Languages: bg, bg_bg, de_de, es_es, fr, fr_fr, ru, ru_ru

source: In many cases TRegExpr users forget that regular expression is for SEARCH in input string. So, if You want to make user to enter only 4 digits and using for it ``\\d{4,4}`` expression, You can skip wrong user input like ``12345`` or ``any letters 1234 and anything else``. You have to add checking for line start and line end to ensure there are not anything else around: ``^\\d{4,4}$``.
bg_bg: В много случаи потребителите на TRegExpr забравят, че регулярният израз е за SEARCH във входния низ. Така че, ако искате да накарате потребителя да въведе само 4 цифри и да използвате за него `` {4,4} `` израз, можете да пропуснете грешен потребителски вход като `` 12345`` или `` всякакви букви 1234 и нещо друго &quot;. Трябва да добавите проверка за стартиране на линия и край на ред, за да сте сигурни, че няма нищо друго около: `` ^ {4,4} $ ``.
de_de: In vielen Fällen vergessen TRegExpr-Benutzer, dass reguläre Ausdrücke für die Suche in der Eingabezeichenfolge verwendet werden. Wenn Sie also den Benutzer dazu veranlassen möchten, nur 4 Ziffern einzugeben und dazu `` \\ d {4,4} `` Ausdruck verwenden, können Sie falsche Benutzereingaben wie `` 12345`` oder `` beliebige Buchstaben 1234 und alles andere &quot;. Sie müssen die Prüfung auf Zeilenanfang und Zeilenende hinzufügen, um sicherzustellen, dass nichts anderes vorhanden ist: `` ^ \\ d {4,4} $ ``.
es_es: En muchos casos, los usuarios de TRegExpr olvidan que la expresión regular es para BUSCAR en la cadena de entrada. Por lo tanto, si desea que el usuario ingrese solo 4 dígitos y use para ella la expresión `` \\ d {4,4} ``, puede omitir entradas de usuario incorrectas como `` 12345`` o `` cualquier letra 1234 y cualquier otra cosa``. Debe agregar la verificación de inicio de línea y final de línea para asegurarse de que no haya nada más alrededor: `` ^ \\ d {4,4} $ ``.
fr_fr: Dans de nombreux cas, les utilisateurs de TRegExpr oublient que l&#39;expression régulière est destinée à SEARCH dans une chaîne d&#39;entrée. Donc, si vous voulez que l’utilisateur n’entre que 4 chiffres et qu’il utilise pour cela l&#39;expression `` \\ d {4,4} ``, vous pouvez ignorer la saisie utilisateur erronée comme `` 12345`` ou `` toutes les lettres 1234 et quelque chose d&#39;autre``. Vous devez ajouter une vérification pour le début et la fin de ligne pour vous assurer qu&#39;il n&#39;y a rien d&#39;autre autour: `` ^ \\ d {4,4} $ ``.
ru_ru: Во многих случаях пользователи TRegExpr забывают, что регулярное выражение для ПОИСКА во входной строке. Итак, если вы хотите, чтобы пользователь вводил только 4 цифры и использовал для него `` \\ d {4,4} `` выражение, вы можете пропустить неправильный ввод пользователя, например `` 12345`` или `` любые буквы 1234 и что-нибудь еще``. Вы должны добавить проверку начала и конца строки, чтобы убедиться, что вокруг ничего нет: `` ^ \\ d {4,4} $ ``.

source: This is the limitation of used by TRegExpr (and Perl\ ``s and many Unix``\ s regular expressions) mathematics - r.e. performe only ``simple`` search optimization, and do not try to do the best optimization. In some cases it\ ``s bad, but in common it``\ s rather advantage then limitation - because of perfomance and predictability reasons.
bg_bg: Това е ограничението на използваните от TRegExpr (и регулярните изрази на Perl и много от Unix) математика - изпълнява само &quot;проста&quot; оптимизация на търсенето и не се опитва да направи най-добрата оптимизация. В някои случаи това е &quot;лошо, но в общия случай&quot; е по-скоро предимство, отколкото ограничение - поради съображения за производителност и предсказуемост.
de_de: Dies ist die Einschränkung der von TRegExpr (und von Perl&#39;s `s und vielen Unix&#39;schen regulären Ausdrücken) verwendeten Mathematik - sie führt nur` `` `` einfache Suchoptimierung durch und versucht nicht, die beste Optimierung durchzuführen. In manchen Fällen ist es schlecht, aber im Allgemeinen ist es eher ein Vorteil als eine Einschränkung - aus Gründen der Leistungsfähigkeit und Vorhersagbarkeit.
es_es: Esta es la limitación de las matemáticas TRegExpr (y Perl \ `` sy muchas expresiones regulares de Unix``): solo se realiza la optimización de búsqueda `` simple``, y no se intenta hacer la mejor optimización. En algunos casos, es malo, pero en común es más bien una ventaja que una limitación, debido a razones de rendimiento y previsibilidad.
fr_fr: C’est la limitation des expressions mathématiques utilisées par TRegExpr (et Perl \ `s et de nombreuses expressions régulières Unix), mais ne permet pas d’optimiser la recherche` `simple`` et ne cherche pas à optimiser les résultats. Dans certains cas, c \ &#39;est mauvais, mais en commun, c \&#39; est plutôt un avantage que une limitation - pour des raisons de performance et de prévisibilité.
ru_ru: Это ограничение используемой математической математики TRegExpr (и регулярных выражений Perl и многих Unix) - они выполняют только `` простую`` поисковую оптимизацию и не пытаются выполнять лучшую оптимизацию. В некоторых случаях это плохо, но в целом это скорее преимущество, чем ограничение - по причинам производительности и предсказуемости.

source: The main rule - r.e. first of all try to match from current place and only if it\ ``s completely impossible move forward by one char and try again from that place. So, if You use``\ a,b+?\ ``it match``\ a,b\ ``, but in case of``\ a+?,b+?\ ``it``\ s ``not recommended`` (due to non-greediness) but possible to match more then one ``a``, so TRegExpr do it and at last obtaines correct (but non optimum) match. TRegExpr like Perl\ ``s or Unix``\ s r.e. doesn\ ``t attempt to move forward and check - would it be``\ better\ ``match. Moreover, it cannot be compared in terms``\ more or less good match\` at all..
bg_bg: Главното правило - преди всичко се опитвате да се съчетаете от текущото място и само ако е напълно невъзможно да се движите напред с един символ и опитайте отново от това място. Така че, ако използвате &#39;&#39; a, b +? &#39;&#39; То съвпада&#39;`, a, b ``, но в случай на`` a + ?, b +? \ T препоръчва се &quot;(поради нежелателност), но е възможно да съвпадне повече от едно&quot; а &quot;, така че TRegExpr го прави и най-накрая получава правилно (но не оптимално) съвпадение. TRegExpr като Perl `s или Unix`` не се опитва да се придвижи напред и да провери - дали ще бъде` `по-добро съвпадение. Нещо повече, тя не може да бъде сравнена по отношение на повече или по-малко добър мач.
de_de: Die Hauptregel - versuchen Sie zuerst, vom aktuellen Ort aus zu passen, und nur dann, wenn es völlig unmöglich ist, sich um einen Buchstaben vorwärts zu bewegen, und versuchen Sie es erneut von diesem Ort aus. Wenn Sie also `` \ a, b +? \ `` `It``` \ a, b \` `verwenden, aber im Fall von` `\ a + ?, b +? \` `It``` `` nicht empfohlen`` (aufgrund von Nicht-Gier), aber es ist möglich, mehr als ein `` a`` zu finden, also TRegExpr und erhält schließlich eine korrekte (aber nicht optimale) Übereinstimmung. TRegExpr wie Perl oder Unix ist nicht versucht, vorwärts zu gehen und zu prüfen, ob es `` \ \ besser \ `` passen würde. Darüber hinaus kann es in Bezug auf `` \ mehr oder weniger gute Übereinstimmung \ `überhaupt nicht verglichen werden.
es_es: La regla principal es, en primer lugar, tratar de hacer coincidir desde el lugar actual y solo si es completamente imposible avanzar una vez y volver a intentarlo desde ese lugar. Por lo tanto, si usa `` \ a, b +? \ `` Coincide con`` \ a, b \ ``, pero en el caso de`` \ a + ?, b +? \ `` It`` \ s `` no recomendado`` (debido a la no codicia), pero es posible que coincida con más de un `` a``, así que TRegExpr lo hace y, por último, obtiene una coincidencia correcta (pero no óptima). TRegExpr como Perl \ `` s o Unix`` \ s re no intenta avanzar y verificar - sería&#39;` \ better \ `` match. Además, no se puede comparar en términos `` \ más o menos buena coincidencia \ `en absoluto ..
fr_fr: La règle principale - essayez tout d’abord de faire la correspondance à partir de l’endroit actuel et seulement s’il est impossible de passer à un caractère et d’essayer à nouveau depuis cet endroit. Donc, si vous utilisez`` \ a, b +? \ `` It match`` \ a, b \ ``, mais dans le cas de`` \ a + ?, b +? \ &#39;`It`` \ s` `pas Recommended`` (en raison de la non-gourmandise), mais il est possible de faire correspondre plus d&#39;un `` a``, donc TRegExpr le fait et obtient enfin une correspondance correcte (mais non optimale). TRegExpr comme Perl ou &quot;Unix&quot; ne fait pas une tentative pour avancer et vérifier - est-ce que cela correspondrait mieux? De plus, il ne peut pas être comparé en termes `` plus ou moins bon match \ `du tout.
ru_ru: Основное правило - сначала пытайтесь сопоставить с текущего места и только в том случае, если совершенно невозможно продвинуться вперед на один символ и повторить попытку с этого места. Итак, если Вы используете `` \ a, b +? \ `` Оно совпадает`` \ a, b \ ``, но в случае `` \ a + ?, b +? \ `` It`` \ s `` not рекомендуется `` (из-за не жадности), но возможно сопоставить более одного `` a``, поэтому TRegExpr сделает это и, наконец, получит правильное (но не оптимальное) совпадение. TRegExpr, такой как Perl, `` s или Unix``, не пытается продвинуться вперед и проверить - будет ли `` \ лучше \ &quot;` соответствовать. Более того, его нельзя сравнивать с точки зрения `` \ более-менее хорошего соответствия \ `&quot; вообще ..

source: Please, read `Syntax <regexp_syntax.html>`__ for more explanation.
bg_bg: Моля, прочетете `Синтаксис <regexp_syntax.html> `__ за повече обяснения.
de_de: Bitte lesen Sie `Syntax <regexp_syntax.html> __ für weitere Erklärung.
es_es: Por favor, lea `Sintaxis <regexp_syntax.html> `__ para más explicación.
fr_fr: S&#39;il vous plaît, lisez `Syntax <regexp_syntax.html> `__ pour plus d&#39;explications.
ru_ru: Пожалуйста, прочитайте `Синтаксис <regexp_syntax.html> `__ для большего объяснения.
