Repository: Alexey-T/TRegExpr
Catalog: docs/locale/*/LC_MESSAGES/index.po
Languages: de_de, es_es, ru, ru_ru

source: English
ru: `English <https://regex.masterandrey.com/en/latest/index.html>`__

source: `Русский <https://regex.masterandrey.com/ru/latest/index.html>`__
ru: Русский

source: Introduction
ru: Вступление

source: TRegExpr library implements `regular expressions <regular_expressions.html>`_.
ru: Библиотека TRegExpr реализует `регулярные выражения <regular_expressions.html>`_.

source: Regular expressions are easy to use and powerful tool for sophisticated search and substitution and for template based text check.
ru: Регулярные выражения - простой в использовании и мощный инструмент для сложного поиска и замены, а также для проверки текста на основе шаблонов.

source: It is especially useful for user input validation in input forms - to validate e-mail addresses and so on.
ru: Это особенно полезно для проверки пользовательского ввода в формах ввода - для проверки адресов электронной почты и так далее.

source: Also you can extract phone numbers, ZIP-codes etc from web-pages or documents, search for complex patterns in log files and all you can imagine. Rules (templates) can be changed without your program recompilation.
ru: Также вы можете извлекать номера телефонов, почтовые индексы и т.д. из веб-страниц или документов, искать сложные шаблоны в файлах журналов и все, что вы можете себе представить. Правила (шаблоны) могут быть изменены без перекомпиляции вашей программы.

source: TRegExpr is implemented in pure Pascal. It's included into `Lazarus (Free Pascal) <http://wiki.freepascal.org/Regexpr>`_ project. But also it exists as separate library and can be compiled by Delphi 2-7, Borland C++ Builder 3-6.
ru: TRegExpr реализован на чистом Паскале. Является частью `Lazarus (Free Pascal) <http://wiki.freepascal.org/Regexpr>`_ проекта. Но также существует как отдельная библиотека, которая может быть скомпилирована Delphi 2-7, Borland C ++ Builder 3-6.

source: Reviews
ru: Отзывы

source: `How good the library was met <https://masterandrey.com/posts/en/regexpstudio_site_is_lunched.html>`_.
ru: `Как библиотека была встречена <https://masterandrey.com/posts/ru/regexpstudio_site_is_lunched.html>`_.

source: Quick start
ru: Быстрый старт

source: To use the library just add `the sources <https://github.com/masterandrey/TRegExpr/blob/master/src/RegExpr.pas>`_ to you project and use the class `TRegExpr <tregexpr.html>`_.
ru: Чтобы использовать библиотеку, просто добавьте `исходники <https://github.com/masterandrey/TRegExpr/blob/master/src/RegExpr.pas>`_ в ваш проект и далее используйте класс `TRegExpr <tregexpr.html>`_.

source: In the `FAQ <faq.html>`_ you can learn from others users problems.
ru: Благодаря `FAQ <faq.html>`_ вы можете учиться на чужих ошибках.

source: Ready to run Windows application `REStudio <https://github.com/masterandrey/TRegExpr/releases/download/0.952b/restudio.zip>`__ will help you learn and debug regular expressions.
ru: Готовое к запуску приложение Windows `REStudio <https://github.com/masterandrey/TRegExpr/releases/download/0.952b/restudio.zip>`__ поможет вам выучить и отладить регулярные выражения.

source: Feedback
ru: Обратная связь

source: If you see any problems, please `create the bug <https://github.com/masterandrey/TRegExpr/issues>`_.
ru: Если вы видите какие-либо проблемы, пожалуйста, `создайте баг <https://github.com/masterandrey/TRegExpr/issues>`_.

source: Source code
ru: Исходный код

source: Pure Object Pascal.
ru: Чистый Object Pascal.

source: `Original version <https://github.com/masterandrey/TRegExpr>`_
ru: `Оригинальная версия <https://github.com/masterandrey/TRegExpr>`_

source: `FreePascal fork (GitHub mirror of the SubVersion) <https://github.com/graemeg/freepascal/blob/master/packages/regexpr/src/regexpr.pas>`_
ru: `FreePascal fork (GitHub зеркало SubVersion) <https://github.com/graemeg/freepascal/blob/master/packages/regexpr/src/regexpr.pas>`_

source: Documentation
de_de: Dokumentation
es_es: Documentación
ru: Документация
ru_ru: Документация

source: Translations
ru: Переводы

source: The documentation is available in English and `Russian <https://regexpr.masterandrey.com/ru/latest/>`_.
ru: Документация доступна на `английском <https://regexpr.masterandrey.com/en/latest/>`_ и русском языках.

source: There are also old translations to German, Bulgarian, French and Spanish. If you want to help to update this old translations please `contact me <https://github.com/masterandrey>`_.
ru: Есть также старые переводы на немецкий, болгарский, французский и испанский языки. Если вы хотите помочь обновить эти старые переводы, пожалуйста, `свяжитесь со мной <https://github.com/masterandrey>`_.

source: New translations are based on `GetText <https://en.wikipedia.org/wiki/Gettext>`_ and can be edited with `transifex.com <https://www.transifex.com/masterAndrey/tregexpr/dashboard/>`_.
ru: Новые переводы основаны на `GetText <https://en.wikipedia.org/wiki/Gettext>`_ и могут быть отредактированы с помощью `transifex.com <https://www.transifex.com/masterAndrey/tregexpr/dashboard/>`_.

source: They are already machine-translated and need only proof-reading and may be some copy-pasting from old translations.
ru: Они уже переведены автоматически и нуждаются только в корректуре, и, возможно, копировании каких-то частей из старых переводов.

source: Gratitude
ru: Благодарности

source: Many features suggested and a lot of bugs founded (and even fixed) by TRegExpr’s contributors.
de_de: Viele Funktionen wurden vorgeschlagen und viele Fehler wurden von TRegExpr-Mitarbeitern begründet (und sogar behoben).
es_es: Muchas funciones sugeridas y muchos errores encontrados (e incluso solucionados) por los colaboradores de TRegExpr.
ru: Сообществом предложено и реализовано множество функций TRegExpr.
ru_ru: Предложено множество функций и множество ошибок, основанных (и даже исправленных) авторами TRegExpr.

source: I cannot list here all of them, but I do appreciate all bug-reports, features suggestions and questions that I am receiving from you.
ru: Я не могу перечислить здесь всех, но я ценю все сообщения об ошибках, предложения функций и вопросы, которые я получаю от вас.

source: Guido Muehlwitz - found and fixed ugly bug in big string processing
de_de: Guido Muehlwitz - hässlicher Fehler in der Verarbeitung großer Saiten gefunden und behoben
es_es: Guido Muehlwitz: error encontrado y arreglado en el procesamiento de cadenas grandes
ru: Guido Muehlwitz - обнаружена и исправлена ошибка в обработке больших строк
ru_ru: Guido Muehlwitz - обнаружена и исправлена ошибка в обработке больших строк

source: Stephan Klimek - testing in CPPB and suggesting/implementing many features
de_de: Stephan Klimek - Testen in CPPB und Vorschlagen / Implementieren vieler Funktionen
es_es: Stephan Klimek: prueba en CPPB y sugiere / implementa muchas características
ru: Stephan Klimek - тестирование в CPPB и предложение / реализация многих функций
ru_ru: Стефан Климек - тестирование в CPPB и предложение / реализация многих функций

source: Steve Mudford - implemented Offset parameter
de_de: Steve Mudford - Offset-Parameter implementiert
es_es: Steve Mudford - implementó el parámetro Offset
ru: Steve Mudford - реализован параметр Offset
ru_ru: Стив Мадфорд - реализован параметр Offset

source: Martin Baur (`www.mindpower.com <http://www.mindpower.com>`__) - German translation, usefull suggestions
ru: Martin Baur (`www.mindpower.com <http://www.mindpower.com>`__) - немецкий перевод, полезные предложения

source: Yury Finkel - implemented UniCode support, found and fixed some bugs
de_de: Yury Finkel - Unterstützung für UniCode implementiert, einige Fehler gefunden und behoben
es_es: Yury Finkel: implementó el soporte UniCode, encontró y corrigió algunos errores
ru: Yury Finkel - реализовал поддержку UniCode, нашел и исправил некоторые ошибки
ru_ru: Юрий Финкель - реализовал поддержку UniCode, нашел и исправил некоторые ошибки

source: Ralf Junker - Implemented some features, many optimization suggestions
de_de: Ralf Junker - Einige Funktionen implementiert, viele Optimierungsvorschläge
es_es: Ralf Junker - Implementó algunas características, muchas sugerencias de optimización
ru: Ralf Junker - Реализованы некоторые функции, много предложений по оптимизации
ru_ru: Ральф Юнкер - Реализованы некоторые функции, много предложений по оптимизации

source: Simeon Lilov - Bulgarian translation
ru: Симеон Лилов - болгарский перевод

source: Filip Jirsбk and Matthew Winter - help in Implementation non-greedy mode
de_de: Filip Jirsбk und Matthew Winter - Hilfe bei der Implementierung des nichtgierigen Modus
es_es: Filip Jirsk y Matthew Winter: ayuda en el modo de implementación no codicioso
ru: Филип Джирсбк и Мэтью Винтер - помогли в реализации не жадного режима
ru_ru: Филип Джирсбк и Мэтью Винтер - помогите в реализации не жадного режима

source: Kit Eason many examples for introduction help section
de_de: Kit Eason viele Beispiele für die Einführung
es_es: Kit Eason muchos ejemplos para la sección de ayuda de introducción
ru: Kit Eason много примеров для документации
ru_ru: Kit Eason много примеров для введения раздела справки

source: Juergen Schroth - bug hunting and useful suggestions
ru: Juergen Schroth - поиск ошибок и полезные советы

source: Martin Ledoux - French translation
ru: Martin Ledoux - французский перевод

source: Diego Calp, Argentina - Spanish translation
ru: Diego Calp, Аргентина - испанский перевод

source: TRegExpr library implements regular expressions in pure Delphi.
de_de: Die TRegExpr-Bibliothek implementiert reguläre Ausdrücke in reinem Delphi.
es_es: La biblioteca TRegExpr implementa expresiones regulares en Delphi puro.
ru_ru: Библиотека TRegExpr реализует регулярные выражения на чистом Delphi.

source: Github repo
es_es: Repositorio de github
ru_ru: Github репо

source: Now it’s included into `Lazarus (Free Pascal) <http://wiki.freepascal.org/Regexpr>`__.
de_de: Jetzt ist es in `Lazarus (Free Pascal) enthalten. <http://wiki.freepascal.org/Regexpr> __.
es_es: Ahora está incluido en `Lázaro (Pascal Libre) <http://wiki.freepascal.org/Regexpr> `__.
ru_ru: Теперь он входит в Lazarus (Free Pascal) <http://wiki.freepascal.org/Regexpr> `__.

source: TRegExpr is easy to use and powerfull tool for sophisticated search and substitutioning and for template-based text checking (especially usefull for user input validation in DBMS and web projects).
de_de: TRegExpr ist ein benutzerfreundliches und leistungsfähiges Werkzeug für anspruchsvolle Such- und Substitutionsverfahren sowie für vorlagenbasierte Textprüfung (besonders nützlich für die Validierung von Benutzereingaben in DBMS und Webprojekten).
es_es: TRegExpr es una herramienta potente y fácil de usar para la búsqueda y sustitución sofisticadas y para la verificación de texto basada en plantillas (especialmente útil para la validación de entradas de usuarios en DBMS y proyectos web).
ru_ru: TRegExpr - это простой в использовании и мощный инструмент для сложного поиска и подстановки, а также для проверки текста на основе шаблонов (особенно полезен для проверки пользовательского ввода в СУБД и веб-проектах).

source: You can validate e-mail adresses, extract phone numbers or ZIP-codes from web-pages or documents, search for complex patterns in log files and all You can imagine! Rules (templates) can be changed without Your program recompilation!
de_de: Sie können E-Mail-Adressen validieren, Telefonnummern oder Postleitzahlen aus Webseiten oder Dokumenten extrahieren, nach komplexen Mustern in Protokolldateien suchen und alles, was Sie sich vorstellen können! Regeln (Vorlagen) können ohne Neuprogrammierung Ihres Programms geändert werden!
es_es: Puede validar direcciones de correo electrónico, extraer números de teléfono o códigos postales de páginas web o documentos, buscar patrones complejos en los archivos de registro y todo lo que pueda imaginar. Las reglas (plantillas) se pueden cambiar sin la recompilación de su programa.
ru_ru: Вы можете проверять адреса электронной почты, извлекать номера телефонов или почтовые индексы с веб-страниц или документов, искать сложные шаблоны в файлах журналов и все, что можете себе представить! Правила (шаблоны) могут быть изменены без перекомпиляции Вашей программы!

source: As a language for rules used subset of Perl’s `regular expressions </regexp_syntax>`__ (regexp).
de_de: Als Sprache für Regeln verwendete Teilmenge der regulären Ausdrücke von Perl </regexp_syntax> __ (Regexp).
es_es: Como lenguaje para reglas, se utiliza un subconjunto de las expresiones regulares de Perl. </regexp_syntax> `__ (expresión regular).
ru_ru: В качестве языка для правил используется подмножество регулярных выражений Perl </regexp_syntax> `__ (регулярное выражение).

source: Full source code included, pure Object Pascal. Thus, You need no DLL! The library source code is compatible with Delphi 2-7, Borland C++ Builder 3-6, Kylix, FreePascal (if You see any incompatibility problems, please. drop the bug-report to `author </about>`__).
de_de: Vollständiger Quellcode enthalten, reines Object Pascal. Du brauchst also keine DLL! Der Quellcode der Bibliothek ist kompatibel mit Delphi 2-7, Borland C ++ Builder 3-6, Kylix, FreePascal (falls Sie Inkompatibilitätsprobleme sehen, löschen Sie bitte den Fehlerbericht an `author.) </about> __).
es_es: Código fuente completo incluido, puro objeto Pascal. Por lo tanto, no necesita DLL! El código fuente de la biblioteca es compatible con Delphi 2-7, Borland C ++ Builder 3-6, Kylix, FreePascal (si ve algún problema de incompatibilidad, envíe el informe de errores al `autor </about> `__).
ru_ru: Полный исходный код включен, чистый Object Pascal. Таким образом, вам не нужно DLL! Исходный код библиотеки совместим с Delphi 2-7, Borland C ++ Builder 3-6, Kylix, FreePascal (если вы видите какие-либо проблемы несовместимости, пожалуйста, отправьте отчет об ошибке автору </about> `__).

source: Documentation in English, Russian, German, Bulgarian, French and Spanish available at TRegExpr home page
de_de: Dokumentation in Englisch, Russisch, Deutsch, Bulgarisch, Französisch und Spanisch auf der TRegExpr-Homepage
es_es: Documentación en inglés, ruso, alemán, búlgaro, francés y español disponible en la página de inicio de TRegExpr
ru_ru: Документация на английском, русском, немецком, болгарском, французском и испанском языках доступна на домашней странице TRegExpr

source: Installation is very simple, the implementation encapsulated completely into class `TRegExpr </tregexpr_interface/>`__.
de_de: Die Installation ist sehr einfach, die Implementierung ist vollständig in die Klasse `TRegExpr &#39;gekapselt </tregexpr_interface/> __.
es_es: La instalación es muy simple, la implementación se encapsula completamente en la clase `TRegExpr </tregexpr_interface/> `__.
ru_ru: Установка очень проста, реализация полностью заключена в класс `TRegExpr </tregexpr_interface/> `__.

source: `Demos projects <https://github.com/masterandrey/TRegExpr/tree/master/examples>`__ and `usage articles <http://masterandrey.com/posts/en/text_processing_from_birds_eye_view.html>`__ illustrate simplicity and power of text processing with the library.
de_de: `Demos-Projekte <https://github.com/masterandrey/TRegExpr/tree/master/examples> __ und `Verwendungsartikel <http://masterandrey.com/posts/en/text_processing_from_birds_eye_view.html> illustriert die Einfachheit und Leistungsfähigkeit der Textverarbeitung mit der Bibliothek.
es_es: `Proyectos de demos <https://github.com/masterandrey/TRegExpr/tree/master/examples> `__ y` artículos de uso <http://masterandrey.com/posts/en/text_processing_from_birds_eye_view.html> `__ ilustra la simplicidad y el poder del procesamiento de texto con la biblioteca.
ru_ru: `Демос проекты <https://github.com/masterandrey/TRegExpr/tree/master/examples> `__ и` статьи об использовании <http://masterandrey.com/posts/en/text_processing_from_birds_eye_view.html> `__ иллюстрирует простоту и мощь обработки текста с помощью библиотеки.

source: If You need Unicode (so called ‘WideString’ in Delphi) - see `How to use unicode <tregexpr_interface#unicode>`__.
de_de: Wenn Sie Unicode benötigen (in Delphi als &#39;WideString&#39; bezeichnet) - siehe `So verwenden Sie Unicode <tregexpr_interface#unicode> __.
es_es: Si necesita Unicode (llamado &#39;WideString&#39; en Delphi) - vea `Cómo usar Unicode <tregexpr_interface#unicode> `__.
ru_ru: Если вам нужен Unicode (так называемый &#39;WideString&#39; в Delphi) - смотрите `Как использовать Unicode <tregexpr_interface#unicode> `__.

source: Gratitudes
de_de: Dankbarkeit
ru_ru: Вы помогли

source: I cannot list here all of them (actually I kept listing only on very early stage of development), but I do appreciate all
de_de: Ich kann hier nicht alle auflisten (eigentlich habe ich mich nur in einem sehr frühen Stadium der Entwicklung aufgeschrieben), aber ich schätze alle
es_es: No puedo enumerarlos todos (en realidad, seguí enumerándolos solo en una etapa muy temprana de desarrollo), pero aprecio todos
ru_ru: Я не могу перечислить здесь все из них (на самом деле я продолжал перечислять только на очень ранней стадии разработки), но я ценю все

source: bug-reports, features suggestions and questions that I am receiving from You.
de_de: Fehlerberichte, Funktionsvorschläge und Fragen, die ich von Ihnen erhalte.
es_es: Informes de errores, sugerencias de características y preguntas que estoy recibiendo de usted.
ru_ru: отчеты об ошибках, предложения функций и вопросы, которые я получаю от Вас.

source: Martin Baur (`www.mindpower.com <http://www.mindpower.com>`__) - German help, usefull suggetions
de_de: Martin Baur (www.mindpower.com) <http://www.mindpower.com> `__) - Deutsche Hilfe, nützliche Vorschläge
es_es: Martin Baur (`www.mindpower.com <http://www.mindpower.com> `__) - Ayuda alemana, sugerencias útiles
ru_ru: Мартин Баур (`www.mindpower.com <http://www.mindpower.com> `__) - немецкая помощь, полезные предложения

source: Simeon Lilov - Bulgarian help
de_de: Simeon Lilov - bulgarische Hilfe
es_es: Simeon Lilov - Ayuda búlgara
ru_ru: Симеон Лилов - болгарская помощь

source: Juergen Schroth - bug hunting and usefull suggestions
de_de: Jürgen Schroth - Käferjagd und nützliche Vorschläge
es_es: Juergen Schroth - caza de errores y sugerencias útiles
ru_ru: Юрген Шрот - поиск ошибок и полезные предложения

source: Martin Ledoux - French help
de_de: Martin Ledoux - französische Hilfe
es_es: Martin Ledoux - ayuda francesa
ru_ru: Мартин Леду - французская помощь

source: Diego Calp, Argentina -Spanish help
de_de: Diego Calp, Argentinien - spanische Hilfe
es_es: Diego Calp, Argentina -Ayuda Española
ru_ru: Диего Кальп, Аргентина - Испанская помощь

source: And many others - for big work in bug hunting!
de_de: Und viele andere - für die große Arbeit bei der Insektenjagd!
es_es: Y muchos otros, ¡por su gran trabajo en la caza de insectos!
ru_ru: И многие другие - за большую работу по поиску жуков!
