Repository: Alexey-T/TRegExpr
Catalog: docs/locale/*/LC_MESSAGES/regexp_syntax.po
Languages: bg_bg, de, de_de, es_es, fr_fr, ru, ru_ru

source: Regular expressions
de: Reguläre Ausdrücke
ru: Регулярные выражения

source: Introduction
bg_bg: Въведение
de: Einführung
de_de: Einführung
es_es: Introducción
ru: Вступление
ru_ru: Вступление

source: Regular expressions are a handy way to specify patterns of text.
de: Reguläre Ausdrücke sind eine praktische Möglichkeit, Textmuster anzugeben.
ru: Регулярные выражения - удобный способ описывать шаблоны текстов.

source: So you can validate user input, search for some patterns like emails of phone numbers on web pages or in some documents and so on.
de: So können Sie Benutzereingaben überprüfen und nach Mustern wie E-Mails von Telefonnummern auf Webseiten oder Dokumenten suchen.
ru: Вы можете проверять вводимые пользователем данные, выполнить поиск по шаблону, например email или телефонные номера на веб-страницах или в документах и так далее.

source: Below is complete regular expressions cheat sheet just on one page. This is regular expressions that are implemented for example in `TRegExpr <tregexpr_interface.html>`_.
de: Nachfolgend finden Sie eine Übersicht über die regulären Ausdrücke auf einer Seite. Dies sind reguläre Ausdrücke, die zum Beispiel in `TRegExpr implementiert werden <tregexpr_interface.html>`_.
ru: Ниже приведена исчерпывающая шпаргалка по регулярных выраженим, всего на одной странице. Это регулярные выражения, которые реализованы, например, в `TRegExpr <tregexpr_interface.html>`_.

source: Simple matches
bg_bg: Обикновено съвпадение
de: Einfache Übereinstimmungen
de_de: Einfache Übereinstimmungen
es_es: Partidos simples
fr_fr: Matchs simples
ru: Простые совпадения
ru_ru: Простые совпадения

source: Any single character matches itself.
de: Jedes einzelne Zeichen passt zu sich selbst.
ru: Любой отдельный символ соответствует самому себе.

source: A series of characters matches that series of characters in the target string, so the pattern ``bluh`` would match ``bluh`` in the target string.
de: Eine Reihe von Zeichen entspricht dieser Reihe von Zeichen in der Zielzeichenfolge, sodass das Muster ``bluh`` in der Zielzeichenfolge mit `` bluh`` übereinstimmen würde.
ru: Серия символов соответствует этой серии символов в целевой строке, поэтому шаблон ``bluh`` будет соответствовать ``bluh`` в целевой строке.

source: If you want to use some symbol with special meaning (see below) as plain symbol you have to "escape" it with backslash ``\``:
de: Wenn Sie ein Symbol mit besonderer Bedeutung (siehe unten) als einfaches Symbol verwenden möchten, müssen Sie es mit dem umgekehrten Schrägstrich `` \ `` &quot;entkommen&quot;:
ru: Если вы хотите использовать какой-либо символ со специальным значением (см. ниже) в качестве простого символа, вы должны «эскейпить» его обратной косой чертой ``\``:

source: Non-Printable Characters
de: Nicht druckbare Zeichen
ru: Непечатные символы

source: matches character with hex code ``nn``
de: stimmt mit dem Zeichen mit dem Hex-Code ``nn`` überein
ru: сопоставляет символ с шестнадцатеричным кодом ``nn``

source: matches character with hex code ``nnnn`` (one byte for plain text and two bytes for Unicode)
de: entspricht dem Zeichen mit dem Hex-Code ``nnnn`` (ein Byte für Klartext und zwei Byte für Unicode)
ru: сопоставляет символ с шестнадцатеричным кодом ``nnnn`` (один байт для простого текста и два байта для Unicode)

source: There are a number of predefined non-printable character classes just like in ``C`` language:
de: Es gibt eine Reihe von vordefinierten, nicht druckbaren Zeichenklassen, genau wie in der ``C``-Sprache:
ru: Существует ряд предопределенных символьных классов, как в языке ``C``:

source: tab (HT/TAB), same as ``\x09``
de: Registerkarte (HT / TAB), identisch mit `` \ x09``
ru: tab (HT/TAB), тоже что ``\x09``

source: newline (NL), same as ``\x0a``
de: Newline (NL), wie `` \ x0a``
ru: символ новой строки (NL), то же что ``\x0a``

source: car.return (CR), same as ``\x0d``
de: car.return (CR), das gleiche wie `` \ x0d``
ru: car.return (CR), тоже что ``\x0d``

source: form feed (FF), same as ``\x0c``
de: Formularvorschub (FF), wie `` \ x0c``
ru: form feed (FF), то же что ``\x0c``

source: alarm (BEL), same as ``\x07``
de: Alarm (BEL), wie `` \ x07``
ru: звонок (BEL), тоже что ``\x07``

source: escape (ESC), same as ``\x1b``
de: Escape (ESC), genauso wie `` \ x1b``
ru: escape (ESC), то же что ``\x1b``

source: User Character Classes
de: Benutzerzeichenklassen
ru: Пользовательские классы

source: You can specify character class, by enclosing a list of characters in ``[]``. This class will match any **one** character listed inside ``[]``.
de: Sie können die Zeichenklasse angeben, indem Sie eine Liste mit Zeichen in `` [] `` einschließen. Diese Klasse stimmt mit jedem ** Zeichen überein, das in `` [] `` aufgelistet ist.
ru: Вы можете указать класс символов, заключив список символов в ``[]``. Этот класс будет соответствовать любому **одному** символу, указанному внутри ``[]``.

source: If the first character after the ``[`` is ``^``, the class matches any character **but** characters listed in the class.
de: Wenn das erste Zeichen nach dem ``[`` `` ^ `` ist, entspricht die Klasse einem beliebigen Zeichen **, aber ** Zeichen, die in der Klasse aufgeführt sind.
ru: Если первый символ после ``[`` будет ``^``, класс соответствует любому символу **кроме** символов, перечисленных в классе.

source: Within a list, the ``-`` character is used to specify a range, so that ``a-z`` represents all characters between ``a`` and ``z``, inclusive.
de: Innerhalb einer Liste wird das Zeichen ``--`` verwendet, um einen Bereich anzugeben, so dass ``az`` alle Zeichen zwischen ``a`` und ``z`` einschließlich darstellt.
ru: Внутри списка символ ``-`` используется для указания диапазона, так что ``a-z`` представляет все символы между ``a`` и ``z`` включительно.

source: If you want ``-`` itself to be a member of a class, put it at the start or end of the list, or escape it with a backslash. If you want ``]`` you may place it at the start of list or escape it with a backslash.
de: Wenn Sie möchten, dass ``-`` selbst Mitglied einer Klasse ist, setzen Sie diese an den Anfang oder das Ende der Liste oder fliehen Sie mit einem Backslash ab. Wenn Sie ``] `` möchten, können Sie es an den Anfang der Liste setzen oder es mit einem Backslash entziehen.
ru: Если вы хотите, чтобы ``-`` сам был членом класса, поместите его в начало или конец списка или эскейпите его обратной косой чертой. Если вы хотите добавить ``]``, вы можете поместить его в начало списка или эскейпить его обратной косой чертой.

source: Predefined Character classes
de: Vordefinierte Zeichenklassen
ru: Предопределенные классы

source: an alphanumeric character (including "_")
de: ein alphanumerisches Zeichen (einschließlich &quot;_&quot;)
ru: буквенно-цифровой символ (включая ``_``)

source: a nonalphanumeric
de: eine nichtalphanumerische
ru: не буквенно-цифровой

source: a numeric character
de: ein numerisches Zeichen
ru: числовой символ

source: a non-numeric
de: eine nicht numerische
ru: нечисловой

source: any space (same as [ \t\n\r\f])
de: beliebiges Leerzeichen (wie [\ t \ n \ r \ f])
ru: любой пробел (то же что ``[\t\n\r\f]``)

source: a non space
de: ein Nichtraum
ru: не пробел

source: TRegExpr uses properties `SpaceChars <tregexpr_interface.html#spacechars>`_ and `WordChars <tregexpr_interface.html#wordchars>`_ to define character classes ``\w``, ``\W``, ``\s``, ``\S``, so you can easely redefine it.
de: TRegExpr verwendet die Eigenschaften `SpaceChars <tregexpr_interface.html#spacechars>`_ und` WordChars <tregexpr_interface.html#wordchars> Mit _ definieren Sie die Zeichenklassen `` \ w``, `` \ W``, ``\s``, `` S&#39;`, damit Sie sie ganz einfach neu definieren können.
ru: TRegExpr использует свойства `SpaceChars <tregexpr_interface.html#spacechars>`_ и `WordChars <tregexpr_interface.html#wordchars>`_ для определения классов символов``\w``, ``\W``, ``\s``, ``\S``, так что вы можете легко переопределить его.

source: Metacharacters
bg_bg: метасимволи
de: Metazeichen
de_de: Metazeichen
es_es: Metacaracteres
fr_fr: Métacaractères
ru: Метасимволы
ru_ru: метасимволов

source: Metacharacters are special characters which are the essence of Regular Expressions. There are different types of metacharacters, described below.
bg_bg: Метасимволите са специални символи, които са същността на регулярните изрази. Има различни типове метасимволи, описани по-долу.
de: Metazeichen sind Sonderzeichen, die die Essenz regulärer Ausdrücke ausmachen. Es gibt verschiedene Arten von Metazeichen, die unten beschrieben werden.
de_de: Metazeichen sind Sonderzeichen, die die Essenz regulärer Ausdrücke ausmachen. Es gibt verschiedene Arten von Metazeichen, die unten beschrieben werden.
es_es: Los metacaracteres son caracteres especiales que son la esencia de las expresiones regulares. Hay diferentes tipos de metacaracteres, que se describen a continuación.
fr_fr: Les métacaractères sont des caractères spéciaux qui constituent l&#39;essence des expressions régulières. Il existe différents types de métacaractères, décrits ci-dessous.
ru: Метасимволы - это специальные символы, очень важные в регулярных выражениях. Существуют различные типы метасимволов, описанных ниже.
ru_ru: Метасимволы - это специальные символы, которые являются сущностью регулярных выражений. Существуют различные типы метасимволов, описанных ниже.

source: Line separators
de: Trennlinien
ru: Разделители строк

source: start of line
de: Zeilenanfang
ru: начало строки

source: end of line
de: Ende der Linie
ru: конец строки

source: start of text
de: Beginn des Textes
ru: начало текста

source: end of text
de: Ende des Textes
ru: конец текста

source: any character in line
de: ein beliebiges Zeichen in einer Reihe
ru: любой символ в строке

source: The ``^`` metacharacter by default is matchthe beginning of the input string, the ``$`` at the end.
de: Das `` ^ `` Metazeichen entspricht standardmäßig dem Anfang der Eingabezeichenfolge, das `` `` `am Ende.
ru: Метасимвол ``^`` по умолчанию соответствует началу входной строки, ``$`` концу.

source: You may, however, wish to treat a string as a multi-line text, so ``^`` will match after any line separator within the string, and ``$`` will match before any line separator. You can do this by switching ``On`` the `modifier /m <#m>`_.
de: Möglicherweise möchten Sie jedoch eine Zeichenfolge als mehrzeiligen Text behandeln, so dass `` ^ `` nach einem beliebigen Trennzeichen innerhalb der Zeichenfolge und &#39;`` `` vor jedem Zeilentrennzeichen übereinstimmt. Sie können dies tun, indem Sie ``On`` den `Modifier / m <#m>`_ einschalten.
ru: Однако вы можете захотеть рассматривать строку как многострочный текст, так что ``^`` и ``$`` будут соответствовать местам сразу после и сразу до разделителя строки. Вы можете сделать это, включив модификатор `/m <#m>`_.

source: The ``\A`` and ``\Z`` are just like ``^`` and ``$``, except that they won’t match multiple times when the `modifier /m <#m>`_ is used.
de: `` A&#39;` und `` \ Z`` sind genau wie `` ^ `` und `` `` `, außer dass sie nicht mehrmals übereinstimmen, wenn der` Modifier / m <#m>`_ wird eingesetzt.
ru: ``\A`` и ``\Z`` похожи на ``^`` и ``$``, за исключением того, что они не будут совпадать несколько раз, когда `modifier / m <#m>`_ используется.

source: The ``.`` metacharacter by default matches any character, but if you switch ``Off`` the `modifier /s <#s>`_, then ``.`` won’t match embedded line separators.
de: Das ``.``-Metazeichen entspricht standardmäßig jedem beliebigen Zeichen, aber wenn Sie ``Off`` mit dem `Modifier / s <#s>`_ ausschalten, stimmt ``.`` nicht mit eingebetteten Trennzeichen überein.
ru: Метасимвол ``.`` по умолчанию соответствует любому символу, но если вы переключите в ``Выкл`` `модификатор /s <#s>`_, то ``.`` не будет соответствовать встроенным разделителям строк.

source: Tech details
de: Technische Details
ru: Технические детали

source: TRegExpr works with line separators as recommended at `www.unicode.org <http://www.unicode.org/unicode/reports/tr18/>`__:
bg_bg: TRegExpr работи с линейни разделители, както се препоръчва на адрес www.unicode.org <http://www.unicode.org/unicode/reports/tr18/> `__:
de: TRegExpr arbeitet mit Linientrennern, wie unter www.unicode.org empfohlen <http://www.unicode.org/unicode/reports/tr18/>`__:
de_de: TRegExpr arbeitet mit Linientrennern, wie unter www.unicode.org empfohlen <http://www.unicode.org/unicode/reports/tr18/> __:
es_es: TRegExpr trabaja con separadores de línea como se recomienda en `www.unicode.org <http://www.unicode.org/unicode/reports/tr18/> `__:
fr_fr: TRegExpr fonctionne avec des séparateurs de lignes comme recommandé sur le site `www.unicode.org <http://www.unicode.org/unicode/reports/tr18/> `__:
ru: TRegExpr работает с разделителями строк, как рекомендовано на сайте `www.unicode.org <http://www.unicode.org/unicode/reports/tr18/>`_:
ru_ru: TRegExpr работает с разделителями строк, как рекомендовано на сайте www.unicode.org. <http://www.unicode.org/unicode/reports/tr18/> `__:

source: ``^`` is at the beginning of a input string, and, if `modifier /m <#m>`_ is On, also immediately following any occurrence of ``\x0D\x0A`` or ``\x0A`` or ``\x0D`` (if you are using `Unicode version <tregexpr_interface.html#unicode>`__ of TRegExpr, then also ``\x2028`` or ``\x2029`` or ``\x0B`` or ``\x0C`` or ``\x85``). Note that there is no empty line within the sequence ``\x0D\x0A``.
de: `` ^ `` steht am Anfang eines Eingabe-Strings und, wenn `modifier / m <#m>`_ aktiviert ist, auch unmittelbar nach jedem Auftreten von `` \ x0D \ x0A`` oder `` \ x0A` `oder` `\ x0D`` (wenn Sie die Unicode-Version verwenden) <tregexpr_interface.html#unicode>`__ von TRegExpr, dann auch` `\ x2028`` oder` `\ x2029`` oder` \ x0B`` oder `` \ x0C`` oder `` \ x85``). Beachten Sie, dass sich in der Sequenz `` \ x0D \ x0A`` keine leere Zeile befindet.
ru: ``^`` означает начало строки и, если `модификатор /m <#m>`_ включен, также сразу после любого появления ``\x0D\x0A`` или ``\x0A`` или ``\x0D`` (если вы используете `Unicode <tregexpr_interface.html#unicode>`_, то также ``\x2028`` или ``\x2029`` или ``\x0B`` или ``\x0C`` или ``\x85``). Обратите внимание, что в последовательности ``\x0D\x0A`` нет пустой строки.

source: ``$`` is at the end of a input string, and, if `modifier /m <#m>`_ is On, also immediately preceding any occurrence of ``\x0D\x0A`` or ``\x0A`` or ``\x0D`` (if you are using `Unicode version <tregexpr_interface.html#unicode>`__ of TRegExpr, then also ``\x2028`` or ``\x2029`` or ``\x0B`` or ``\x0C`` or ``\x85``). Note that there is no empty line within the sequence ``\x0D\x0A``.
de: `` $ `` steht am Ende einer Eingabezeichenfolge und, wenn `modifier / m <#m>`_ eingeschaltet ist, auch unmittelbar vor jedem Auftreten von `` x0D \ x0A`` oder `` \ x0A` `oder` `\ x0D`` (wenn Sie die Unicode-Version verwenden) <tregexpr_interface.html#unicode>`__ von TRegExpr, dann auch` `\ x2028`` oder` `\ x2029`` oder` \ x0B`` oder `` \ x0C`` oder `` \ x85``). Beachten Sie, dass sich in der Sequenz `` \ x0D \ x0A`` keine leere Zeile befindet.
ru: ``$`` это конец строки, но с `модификатор /m <#m>`_ также совпадет с ``\x0D\x0A`` или ``\ x0A`` или ``\x0D`` (если вы используете `Unicode <tregexpr_interface.html#unicode>`_, также ``\ x2028`` или ``\x2029`` или ``\x0B`` или ``\x0C`` или ``\x85``). Обратите внимание, что в последовательности ``\x0D\x0A`` нет пустой строки.

source: ``.`` matchs any character, but if you switch Off `modifier /s <#s>`_ then ``.`` doesn’t match ``\x0D\x0A`` and ``\x0A`` and ``\x0D`` (if you are using `Unicode version <tregexpr_interface.html#unicode>`__ of TRegExpr, then also ``\x2028`` and ``\x2029`` and ``\x0B`` and ``\x0C`` and ``\x85``).
de: ``.`` passt zu jedem beliebigen Zeichen, aber wenn Sie `modifier / s <#s>`_ ausschalten, stimmt ``.`` nicht mit `` \ x0D \ x0A`` und `` \ x0A`` und `` \ x0D`` (wenn Sie die Unicode-Version verwenden) <tregexpr_interface.html#unicode>`__ von TRegExpr, dann auch` `\ x2028`` und` `\ x2029`` und` `\ x0B`` und` `\ x0C`` und` `\ x85``).
ru: ``.`` соответствует любому символу, но если вы выключите `modifier /s <#s>`_, то ``.`` не будет соответствовать ``\x0D\x0A`` и ``\x0A`` ``\x0D`` (если вы используете `версию Unicode <tregexpr_interface.html#unicode>`__ TRegExpr, затем также ``\x2028`` и ``\x2029`` и ``\x0B`` и `\x0C`` и ``\x85``).

source: Note that ``^.*$`` (an empty line pattern) does not match the empty string within the sequence ``\x0D\x0A``, but matchs the empty string within the sequence ``\x0A\x0D``.
de: Beachten Sie, dass `` ^. * $ `` (Ein leeres Linienmuster) nicht mit der leeren Zeichenfolge in der Sequenz `` \ x0D \ x0A`` übereinstimmt, sondern mit der leeren Zeichenfolge in der Sequenz `` \ x0A \ x0D`` .
ru: Обратите внимание, что ``^.*$`` (шаблон пустой строки) не соответствует пустой строке в последовательности ``\x0D\x0A``, но соответствует пустой строке в последовательности ``\x0A\x0D``.

source: Multiline processing can be easely tuned for your own purpose with help of TRegExpr properties `LineSeparators <tregexpr_interface.html#lineseparators>`_ and `LinePairedSeparator <tregexpr_interface.html#linepairedseparator>`_, you can use only Unix style separators ``\n`` or only DOS/Windows style ``\r\n`` or mix them together (as described above and used by default) or define your own line separators!
de: Mit Hilfe der TRegExpr-Eigenschaften &#39;LineSeparators&#39; lässt sich die Multiline-Verarbeitung ganz einfach für Ihren eigenen Zweck anpassen <tregexpr_interface.html#lineseparators>`_ und` LinePairedSeparator <tregexpr_interface.html#linepairedseparator>`_, Sie können nur Unix-Trennzeichen` `\ n`` oder nur DOS / Windows-` `\ r \ n`` verwenden oder sie zusammen mischen (wie oben beschrieben und standardmäßig verwendet) oder eigene Trennzeichen definieren!
ru: Многострочная обработка может быть легко настроена для ваших собственных целей с помощью свойств TRegExpr `LineSeparators <tregexpr_interface.html#lineseparators>`_ и `LinePairedSeparator <tregexpr_interface.html#linepairedseparator>`_, вы можете использовать только разделители стиля Unix ``\n`` или только Windows ``\r\n`` или смешивать их вместе (как описано выше и используется по умолчанию) или определять свои собственные разделители строк.

source: Word boundaries
de: Wortgrenzen
ru: Границы слова

source: A word boundary ``\b`` is a spot between two characters that has a ``\w`` on one side of it and a ``\W`` on the other side of it (in either order), counting the imaginary characters off the beginning and end of the string as matching a ``\W``.
de: Eine Wortgrenze &quot;\ b&quot; ist ein Punkt zwischen zwei Zeichen, auf dessen einer Seite ein &quot;\ w&quot; und auf der anderen Seite ein &quot;\ W&quot; steht (in beliebiger Reihenfolge) die imaginären Zeichen am Anfang und am Ende der Zeichenfolge als übereinstimmendes `` \ W``.
ru: Граница слова ``\b`` - это точка между двумя символами, которая имеет ``\w`` на одной стороне от него и ``\W`` на другой стороне (в любом порядке), считая воображаемые символы в начале и конце строки совпадают с ``\W``.

source: Iterators
de: Iteratoren
ru: Итераторы

source: Any item of a regular expression may be followed by iterator. Iterator specify number of repetition of the item.
de: Jedem Element eines regulären Ausdrucks kann ein Iterator folgen. Iterator gibt die Anzahl der Wiederholungen des Elements an.
ru: За любым элементом регулярного выражения может следовать итератор. Итератор указывает номер повторения элемента.

source: So, digits in curly brackets ``{n,m}``, specify the minimum number of times to match ``n`` and the maximum ``m``.
de: Geben Sie also in geschweiften Klammern `` {n, m} `` die Mindestanzahl an Übereinstimmungen mit ``n`` und die maximale Anzahl von `m`` an.
ru: Итак, цифры в фигурных скобках ``{n,m}``, задают минимальное количество совпадений ``n`` и максимальное ``m``.

source: The ``{n}`` is equivalent to ``{n,n}`` and matches exactly ``n`` times.
de: Das `` {n} `` entspricht `` {n, n} `` und stimmt genau mit ``n``-Zeiten überein.
ru: ``{n}`` эквивалентно ``{n,n}`` и означает ``Точно n раз``.

source: The ``{n,}`` matches ``n`` or more times.
de: Das `` {n,} `` entspricht mehr als ``n``.
ru: ``{n,}`` соответствует ``n`` или более раз.

source: There is no limit to the size of ``n`` or ``m``, but large numbers will chew up more memory and slow down r.e. execution.
de: Es gibt keine Begrenzung für die Größe von ``n`` oder ``m``, aber große Zahlen beanspruchen mehr Speicher und verlangsamen die Wiederausführung.
ru: Не существует ограничений на величину ``n`` или ``m``, но большие числа будут затрачивать больше памяти и замедлять повторное выполнение.

source: If a curly bracket occurs in any other context, it is treated as a regular character.
bg_bg: Ако фигурна скоба се появява във всеки друг контекст, тя се третира като редовен символ.
de: Wenn eine geschweifte Klammer in einem anderen Kontext auftritt, wird sie als normales Zeichen behandelt.
de_de: Wenn eine geschweifte Klammer in einem anderen Kontext auftritt, wird sie als normales Zeichen behandelt.
es_es: Si aparece un corchete en cualquier otro contexto, se trata como un carácter regular.
fr_fr: Si une accolade apparaît dans un autre contexte, elle est traitée comme un caractère normal.
ru: Если фигурная скобка встречается в любом другом контексте, она рассматривается как обычный символ.
ru_ru: Если фигурная скобка встречается в любом другом контексте, она рассматривается как обычный символ.

source: Greediness
de: Gier
ru: Жадность

source: “Greedy” (default) mode takes as many as possible, “non-greedy” takes as few as possible.
de: Der Modus &quot;gierig&quot; (Standardeinstellung) benötigt so viele wie möglich, &quot;nicht gierig&quot; so wenig wie möglich.
ru: Режим «Жадный» (по умолчанию) захватывает как можно больше символов, «не жадный» - как можно меньше.

source: For example, ``b+`` applied to string ``abbbbc`` returns ``bbbb``.
de: Beispiel: `` b + `` für String ``abbbbc`` gibt ``bbbb`` zurück.
ru: Например, ``b+`` применительно к строке ``abbbbc`` возвращает ``bbbb``.

source: ``b+?`` returns ``b``, ``b*?`` returns empty string.
de: `` b +? `` gibt ``b`` zurück, `` b *? `` `liefert leere Zeichenfolge.
ru: ``b+?`` возвращает ``b``, ``b*?`` возвращает пустую строку.

source: ``b{2,3}?`` returns ``bb``, ``b{2,3}`` returns ``bbb``.
de: `` b {2,3}? `` liefert ``bb``, `` b {2,3} `` ``bbb`` zurück.
ru: ``b{2,3}?`` возвращает ``bb``, ``b{2,3}`` возвращает ``bbb``.

source: You can switch all iterators into “non-greedy” mode (`modifier /g <#g>`_).
de: Sie können alle Iteratoren in den &quot;nicht gierigen&quot; Modus setzen (`modifier / g <#g>`_).
ru: Вы можете переключить все итераторы в «не жадный» режим (`modifier /g <#g>`_).

source: Alternatives
de: Alternativen
ru: Альтернативы

source: Series of alternatives are separated by ``|``.
de: Eine Reihe von Alternativen wird durch `` | `` getrennt.
ru: Список альтернатив разделяется ``|``.

source: So ``fee|fie|foe`` will match any of ``fee``, ``fie``, or ``foe`` in the target string (as would ``f(e|i|o)e``).
de: `` Fee | fie | foe`` passt also zu einem beliebigen von ``fee``, ``fie`` oder ``foe`` in der Zielzeichenfolge (ebenso wie `` f (e | i | o) e ``).
ru: Таким образом, ``fee|fie|foe`` будет соответствовать любому из ``fee``, ``fie`` или ``foe`` (также как и ``f(e|i|o)e``).
