Repository: Alexey-T/TRegExpr
Catalog: docs/locale/*/LC_MESSAGES/regexp_syntax.po
Languages: bg_bg, de, de_de, es_es, fr_fr, ru, ru_ru

source: Non standard modifier. Switching it Off You’ll switch all following operators into non-greedy mode (by default this modifier is On). So, if modifier ``/g`` is Off then ``+`` works as ``+?``, ``\*`` as ``\*?`` and so on
bg_bg: Нестандартен модификатор. Изключване Можете да превключите всички следващи оператори в не-алчен режим (по подразбиране този модификатор е Вкл.). Така че, ако модификаторът `` / g`` е изключен, то `` + `` работи като `` +? ``, `` `` `` `` `` И т.н.
de_de: Kein Standardmodifikator. Ausschalten Sie schalten alle folgenden Operatoren in den nicht-gierigen Modus (standardmäßig ist diese Einstellung aktiviert). Wenn also der Modifikator `` / g`` deaktiviert ist, funktioniert `` + `als` `+?` `,` `\ *` `Als` `\ *?` `Usw.
es_es: Modificador no estándar. Si lo desactiva, cambiará todos los siguientes operadores al modo no codicioso (de forma predeterminada, este modificador está activado). Entonces, si el modificador `` / g`` está desactivado, entonces `` + `` funciona como `` +? ``, `` \ * `` Como `` \ *? `` Y así sucesivamente
fr_fr: Modificateur non standard. Désactivation de la fonction Vous commuterez tous les opérateurs suivants en mode non-gourmand (par défaut, ce modificateur est activé). Donc, si le modificateur `` / g`` est désactivé alors `` + + `fonctionne comme` `+?` `,` `\ *` `Comme` `\ &#39;? \` `Et ainsi de suite
ru_ru: Нестандартный модификатор. Выключение. Вы переведете все следующие операторы в не жадный режим (по умолчанию этот модификатор включен). Итак, если модификатор `` / g`` выключен, то `` + `` работает как `` +? ``, `` \ * `` Как `` \ *? `` И т. Д.

source: ### x
bg_bg: ### х
ru_ru: ### Икс

source: Extend your pattern’s legibility by permitting whitespace and comments (see explanation below).
bg_bg: Разширете четливостта на вашия модел, като позволите празно пространство и коментари (вж. Обяснението по-долу).
de_de: Erweitern Sie die Lesbarkeit Ihres Musters, indem Sie Leerzeichen und Kommentare zulassen (siehe Erklärung unten).
es_es: Amplíe la legibilidad de su patrón permitiendo espacios en blanco y comentarios (vea la explicación a continuación).
fr_fr: Augmentez la lisibilité de votre modèle en permettant des espaces et des commentaires (voir l&#39;explication ci-dessous).
ru_ru: Увеличьте удобочитаемость вашего шаблона, разрешая пробелы и комментарии (см. Пояснение ниже).

source: ### r
ru_ru: ### р

source: Non-standard modifier. If is set then range а-я additional include russian letter ``ё``, ``А-Я`` additional include ``Ё``, and ``а-Я`` include all russian symbols.
bg_bg: Нестандартно модификатор. Ако е зададен тогава диапазон а-я допълнително включва руската буква `` ё``, `` А-Я`` допълнително включва `` Ё``, а `` а-Я`` включва всички руски символи.
de_de: Nicht-Standard-Modifikator Wenn gesetzt wird, dann sind ein weiterer Bereich mit dem russischen Buchstaben `` ё``, der weitere Zusatz `` Ё`` und `` a-Я`` alle russischen Symbole.
es_es: Modificador no estándar. Si se establece, el rango а-я adicional incluye la letra rusa `` ё``, `` А-Я`` adicional incluye `` Ё``, y `` а-Я`` incluye todos los símbolos rusos.
fr_fr: Modificateur non standard. Si est défini, la plage a-я comprend également la lettre russe `` ё``, `` А-Я``, inclut également `` Ё``, et `` а-Я`` inclut tous les symboles russes.
ru_ru: Нестандартный модификатор. Если установлено, то диапазон а-я дополнительно включает русскую букву `` ё``, `` А-Я`` дополнительно включает `` Ё``, а `` а-Я`` включает все русские символы.

source: Sorry for foreign users, but it’s set by default. If you want switch if off by default - set false to global variable `RegExprModifierR <#modifier_defs>`__.
bg_bg: Съжаляваме за чуждестранни потребители, но е зададен по подразбиране. Ако искате да превключите ако е изключено по подразбиране - задайте false към глобалната променлива `RegExprModifierR &lt;#modifier_defs&gt;` __.
de_de: Tut mir leid für ausländische Benutzer, aber es ist standardmäßig eingestellt. Wenn die Option standardmäßig deaktiviert sein soll, setzen Sie false auf globale Variable `RegExprModifierR &lt;#modifier_defs&gt;` __.
es_es: Lo siento por los usuarios extranjeros, pero está configurado de forma predeterminada. Si desea apagar si está desactivado de forma predeterminada, establezca falso en la variable global `RegExprModifierR &lt;#modifier_defs&gt;` __.
fr_fr: Désolé pour les utilisateurs étrangers, mais c&#39;est défini par défaut. Si vous voulez désactiver si désactivé par défaut, affectez la valeur false à la variable globale `RegExprModifierR &lt;#modifier_defs&gt;` __.
ru_ru: Извините за иностранных пользователей, но это установлено по умолчанию. Если вы хотите выключить по умолчанию - установите false в глобальную переменную `RegExprModifierR &lt;#modifier_defs&gt;` __.

source: The `modifier /x <regexp_syntax.html#modifier_x>`__ itself needs a little more explanation. It tells the TRegExpr to ignore whitespace that is neither backslashed nor within a character class. You can use this to break up your regular expression into (slightly) more readable parts. The ``#`` character is also treated as a metacharacter introducing a comment, for example:
bg_bg: Модификаторът `x <regexp_syntax.html#modifier_x> `__ се нуждае от малко повече обяснения. Той казва на TRegExpr да игнорира празно пространство, което не е нито обратно, нито в клас знаци. Можете да използвате това, за да разделите регулярния си израз в (леко) по-четливи части. Символът `` # `&#39;също се третира като метасимвол, въвеждащ коментар, например:
de_de: Der Modifikator / x <regexp_syntax.html#modifier_x> __ selbst braucht etwas mehr Erklärung. Es teilt dem TRegExpr mit, dass Leerzeichen ignoriert werden sollen, die weder rückwärts noch innerhalb einer Zeichenklasse sind. Sie können dies verwenden, um Ihren regulären Ausdruck in (etwas) besser lesbare Teile aufzuteilen. Das Zeichen `` # `` wird auch als ein Metazeichen behandelt, das einen Kommentar einleitet, zum Beispiel:
es_es: El modificador / x <regexp_syntax.html#modifier_x> `__ necesita un poco más de explicación. Le dice a TRegExpr que ignore los espacios en blanco que no están recortados ni dentro de una clase de caracteres. Puede usar esto para dividir su expresión regular en partes (un poco) más legibles. El carácter `` # `` también se trata como un metacarácter que introduce un comentario, por ejemplo:
fr_fr: Le modificateur / x <regexp_syntax.html#modifier_x> `__ lui-même a besoin d&#39;un peu plus d&#39;explications. Il demande à TRegExpr d&#39;ignorer les espaces qui ne sont ni antislash ni dans une classe de caractères. Vous pouvez l&#39;utiliser pour diviser votre expression régulière en parties (légèrement) plus lisibles. Le caractère `` # `` est également traité comme un métacaractère introduisant un commentaire, par exemple:
ru_ru: Модификатор / x <regexp_syntax.html#modifier_x> `___ сама нуждается в немного большем объяснении. Он говорит TRegExpr игнорировать пробелы, которые не имеют обратной косой черты и не находятся внутри класса символов. Вы можете использовать это, чтобы разбить ваше регулярное выражение на (немного) более читаемые части. Символ `` # `` также рассматривается как метасимвол, представляющий комментарий, например:

source: This also means that if you want real whitespace or ``#`` characters in the pattern (outside a character class, where they are unaffected by ``/x``), that you’ll either have to escape them or encode them using octal or hex escapes. Taken together, these features go a long way towards making regular expressions text more readable.
bg_bg: Това също така означава, че ако искате реални пробели или `` # `` символи в шаблона (извън клас знаци, където те не са засегнати от `` / x``), или ще трябва да ги избягвате или да ги кодирате използвайки осмична или шестнадесетична бягства. Взети заедно, тези характеристики правят дълъг път към правилния текст на регулярните изрази.
de_de: Dies bedeutet auch, dass Sie, wenn Sie echte Whitespace- oder `` # `` Zeichen in dem Muster (außerhalb einer Zeichenklasse, wo sie nicht von `` / x`` betroffen sind) möchten, diese entweder entziehen oder kodieren müssen mit Oktal- oder Hex-Fluchten. Zusammengenommen bewirken diese Funktionen einen großen Beitrag, um den Text für reguläre Ausdrücke lesbarer zu machen.
es_es: Esto también significa que si quieres que haya espacios en blanco reales o caracteres `` # `` en el patrón (fuera de una clase de caracteres, donde no estén afectados por `` / x``), tendrás que escapar de ellos o codificarlos Utilizando escapes octales o hexagonales. En conjunto, estas características contribuyen en gran medida a hacer que el texto de las expresiones regulares sea más legible.
fr_fr: Cela signifie également que si vous voulez de vrais espaces ou des caractères `#` `dans le motif (en dehors d&#39;une classe de caractères, où ils ne sont pas affectés par` `/ x``), vous devrez soit les échapper soit les encoder. en utilisant des échappements octaux ou hexagonaux. Prises ensemble, ces fonctionnalités permettent de rendre le texte des expressions régulières plus lisible.
ru_ru: Это также означает, что если вам нужны реальные пробелы или символы `` # `` в шаблоне (вне класса символов, где они не затрагиваются `` / x``), вам придется либо экранировать их, либо кодировать их. используя восьмеричные или шестнадцатеричные побеги. Взятые вместе, эти функции имеют большое значение для того, чтобы сделать текст регулярных выражений более читабельным.

source: Just now don’t forget to read the `FAQ <faq.html>`__ (expecially ‘non-greediness’ optimization `question <faq.html#nongreedyoptimization>`__).
bg_bg: Точно сега не забравяйте да прочетете `FAQ <faq.html> `__ (въпросът за оптимизацията не е алчност) <faq.html#nongreedyoptimization> `__).
de_de: Vergessen Sie jetzt nicht, die `FAQ &#39;zu lesen <faq.html> (__ (insbesondere &quot;Nicht-Gier&quot; -Optimierung) Frage <faq.html#nongreedyoptimization> __).
es_es: Ahora mismo no te olvides de leer las `Preguntas frecuentes <faq.html> `__ (especialmente la pregunta de la optimización &#39;no avaricia&#39; <faq.html#nongreedyoptimization> `__).
fr_fr: En ce moment, n&#39;oubliez pas de lire la `FAQ <faq.html> `__ (spécialement &#39;question d&#39;optimisation&#39; non-gourmandise &#39; <faq.html#nongreedyoptimization> `__).
ru_ru: Только сейчас не забудьте прочитать FAQ <faq.html> `__ (особенно вопрос оптимизации без жадности) <faq.html#nongreedyoptimization> `__).
