Repository: Alexey-T/TRegExpr
Catalog: docs/locale/*/LC_MESSAGES/regexp_syntax.po
Languages: bg_bg, de, de_de, es_es, fr_fr, ru, ru_ru

source: I recommend You to play with regular expressions using Windows `REStudio <https://github.com/masterandrey/TRegExpr/releases/download/0.952b/REStudio.exe>`__ - it’ll help You to uderstand main conceptions. Moreover, there are many predefined examples with comments included into repository of R.e. visual debugger.
bg_bg: Препоръчвам Ви да играете с регулярни изрази с помощта на &quot;REStudio&quot; на Windows <https://github.com/masterandrey/TRegExpr/releases/download/0.952b/REStudio.exe> `__ - ще ви помогне да разберете основните концепции. Освен това има много предварително дефинирани примери с коментари, включени в хранилището на Re Visual debugger.
de_de: Ich empfehle Ihnen, mit regulären Ausdrücken unter Windows `REStudio zu spielen <https://github.com/masterandrey/TRegExpr/releases/download/0.952b/REStudio.exe> `__ - es wird Ihnen helfen, die Hauptvorstellungen zu verstehen. Darüber hinaus gibt es viele vordefinierte Beispiele mit Kommentaren, die im Repository von Re Visual Debugger enthalten sind.
es_es: Te recomiendo jugar con expresiones regulares usando Windows `REStudio <https://github.com/masterandrey/TRegExpr/releases/download/0.952b/REStudio.exe> `__ - Te ayudará a entender las principales concepciones. Además, hay muchos ejemplos predefinidos con comentarios incluidos en el repositorio de Re visual debugger.
fr_fr: Je vous recommande de jouer avec des expressions régulières en utilisant Windows `REStudio <https://github.com/masterandrey/TRegExpr/releases/download/0.952b/REStudio.exe> `__ - Cela vous aidera à comprendre les principales conceptions. De plus, il existe de nombreux exemples prédéfinis avec des commentaires inclus dans le référentiel du débogueur visuel Re.
ru_ru: Я рекомендую вам играть с регулярными выражениями с помощью Windows `REStudio <https://github.com/masterandrey/TRegExpr/releases/download/0.952b/REStudio.exe> `__ - это поможет вам понять основные концепции. Более того, существует множество предопределенных примеров с комментариями, включенными в репозиторий визуального отладчика Re.

source: Let’s start our learning trip!
bg_bg: Нека да започнем нашето пътуване!
de_de: Beginnen wir mit unserer Lernreise!
es_es: ¡Empecemos nuestro viaje de aprendizaje!
fr_fr: Commençons notre voyage d&#39;apprentissage!
ru_ru: Давайте начнем нашу учебную поездку!

source: Any single character matches itself, unless it is a metacharacter with a special meaning described below.
bg_bg: Всеки един символ съвпада сам, освен ако не е метасимвол със специално значение, описано по-долу.
de_de: Jedes einzelne Zeichen stimmt mit sich selbst überein, es sei denn, es handelt sich um ein Metazeichen mit einer unten beschriebenen besonderen Bedeutung.
es_es: Cualquier carácter individual coincide solo, a menos que sea un metacarácter con un significado especial que se describe a continuación.
fr_fr: Tout caractère unique correspond à lui-même, sauf s’il s’agit d’un métacaractère ayant une signification particulière décrite ci-dessous.
ru_ru: Любой отдельный символ соответствует самому себе, если только он не является метасимволом со специальным значением, описанным ниже.

source: A series of characters matches that series of characters in the target string, so the pattern ``bluh`` would match ``bluh`` in the target string. Quite simple, eh ?
bg_bg: Поредица от символи съвпада с тази серия от знаци в целевия низ, така че шаблонът `` bluh`` ще съответства на `` bluh`` в целевия низ. Съвсем просто, нали?
de_de: Eine Reihe von Zeichen entspricht dieser Reihe von Zeichen in der Zielzeichenfolge, sodass das Muster `` bluh`` in der Zielzeichenfolge mit `` bluh`` übereinstimmen würde. Ganz einfach, wie?
es_es: Una serie de caracteres coincide con esa serie de caracteres en la cadena de destino, por lo que el patrón `` bluh`` coincidiría con `` bluh`` en la cadena de destino. Bastante simple, ¿eh?
fr_fr: Une série de caractères correspond à cette série de caractères dans la chaîne cible. Le modèle `` bluh`` correspond donc à `` bluh`` dans la chaîne cible. Assez simple, hein?
ru_ru: Серия символов соответствует этой серии символов в целевой строке, поэтому шаблон `` bluh`` будет соответствовать `` bluh`` в целевой строке. Довольно просто, а?

source: You can cause characters that normally function as metacharacters or escape sequences to be interpreted literally by ‘escaping’ them by preceding them with a backslash ``\``, for instance: metacharacter ``^`` match beginning of string, but ``\^`` match character ``^``, ``\\`` match ``\`` and so on.
bg_bg: Можете да накарате символи, които нормално функционират като метасимволи или изходни последователности, да бъдат интерпретирани буквално чрез &quot;избягването им&quot;, като ги предхождат с обратна наклонена черта `` ``, например: metacharacter `` ^ `` съвпадат с началото на низ, но `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` ``, `` `` `` ``, `` `` `` `` ``, `` `` ``.
de_de: Sie können Zeichen, die normalerweise als Metazeichen oder Escape-Sequenzen fungieren, wörtlich interpretieren, indem Sie sie mit einem umgekehrten Schrägstrich `` \ `` voranstellen, z. B .: Metazeichen &#39;`^` `stimmen mit dem String-Anfang, aber` `überein \ ^ `` stimmen Sie mit Zeichen `` ^ ``, `` \\ `` mit `` \ `` und so weiter überein.
es_es: Puede hacer que los caracteres que normalmente funcionan como metacaracteres o secuencias de escape se interpreten literalmente &#39;escapándolos&#39; precediéndolos con una barra invertida `` \ ``, por ejemplo: metacharacter `` ^ `` coincide con el principio de la cadena, pero `` \ ^ `` coincide con el carácter `` ^ ``, `` \\ `` coincide con `` \ `` y así sucesivamente.
fr_fr: Vous pouvez faire en sorte que les caractères qui fonctionnent normalement comme métacaractères ou séquences d&#39;échappement soient littéralement interprétés en les &quot;échappant&quot; en les précédant d&#39;une barre oblique inversée `` \ ``, par exemple: métacaractère `` ^ `` correspond au début de chaîne, mais `` \ ^ `` match match `` ^ ``, `` \\ `` match `` \ `` et ainsi de suite.
ru_ru: Вы можете заставить символы, которые обычно функционируют как метасимволы или escape-последовательности, интерпретировать буквально, «экранируя» их, поставив перед ними обратную косую черту `` \ ``, например: метасимвол `` ^ `` соответствует началу строки, но `` \ ^ `` соответствует символу `` ^ ``, `` \\ `` соответствует `` \ `` и так далее.

source: Examples:
bg_bg: Примери:
de_de: Beispiele:
es_es: Ejemplos:
fr_fr: Exemples:
ru_ru: Примеры:

source: Note for C++ Builder users
bg_bg: Забележка за потребителите на C ++ Builder
de_de: Hinweis für C ++ Builder-Benutzer
es_es: Nota para los usuarios de C ++ Builder.
fr_fr: Note pour les utilisateurs de C ++ Builder
ru_ru: Примечание для пользователей C ++ Builder

source: Please, read in FAQ answer on question `Why many r.e. work wrong in Borland C++ Builder? <faq.html#cppbescchar>`__
bg_bg: Моля, прочетете в отговора на въпросите Често задавани въпроси &quot;Защо много от тях работят погрешно в Borland C ++ Builder? <faq.html#cppbescchar> `__
de_de: Bitte lesen Sie die FAQ-Antwort auf Frage &#39;Warum arbeiten viele in Borland C ++ Builder falsch? <faq.html#cppbescchar> __
es_es: Por favor, lea la sección de preguntas frecuentes y responda a la pregunta `¿Por qué muchos trabajan mal en Borland C ++ Builder? <faq.html#cppbescchar> `__
fr_fr: Veuillez lire la FAQ dans la réponse à la question `Pourquoi beaucoup de problèmes fonctionnent-ils mal dans Borland C ++ Builder? <faq.html#cppbescchar> `__
ru_ru: Пожалуйста, прочитайте в FAQ ответ на вопрос «Почему многие не работают в Borland C ++ Builder? <faq.html#cppbescchar> `__

source: Escape sequences
bg_bg: Ескейп последователности
de_de: Escape-Sequenzen
es_es: Secuencias de escape
fr_fr: Séquences d&#39;échappement
ru_ru: Escape-последовательности

source: Characters may be specified using a escape sequences syntax much like that used in C and Perl: ``\n`` matches a newline, ``\t`` a tab, etc. More generally, ``\xnn``, where nn is a string of hexadecimal digits, matches the character whose ASCII value is nn. If You need wide (Unicode) character code, You can use ``\x{nnnn}``, where ``nnnn`` - one or more hexadecimal digits.
bg_bg: Символи могат да бъдат зададени с помощта на синтаксис за бягство на последователности, много подобен на този, използван в C и Perl: `` n`` съвпада с нов ред, `` `раздела и т.н. nn е низ от шестнадесетични цифри, съвпадащ със символа, чиято ASCII стойност е nn. Ако имате нужда от широк (Unicode) код на знака, можете да използвате `` {nnnn} ``, където `` nnnn`` - една или повече шестнадесетични цифри.
de_de: Zeichen können mit einer Escape-Sequence-Syntax festgelegt werden, die der in C und Perl verwendeten Syntax ähnelt: `` \ n`` entspricht einer Newline, `` \ t``, ein Tabulator usw. Allgemein gilt `` \ xnn`` wo nn ist eine Zeichenfolge aus Hexadezimalzahlen, die mit dem Zeichen übereinstimmt, dessen ASCII-Wert nn ist. Wenn Sie einen breiten (Unicode) Zeichencode benötigen, können Sie `` \ x {nnnn} `` verwenden, wobei `` nnnn`` eine oder mehrere hexadezimale Ziffern enthält.
es_es: Los caracteres pueden especificarse usando una sintaxis de secuencias de escape muy parecida a la utilizada en C y Perl: `` \ n`` coincide con una nueva línea, `` \ t`` una pestaña, etc. Más generalmente, `` \ xnn``, donde nn es una cadena de dígitos hexadecimales, coincide con el carácter cuyo valor ASCII es nn. Si necesita un código de caracteres anchos (Unicode), puede usar `` \ x {nnnn} ``, donde `` nnnn`` - uno o más dígitos hexadecimales.
fr_fr: Les caractères peuvent être spécifiés en utilisant une syntaxe de séquence d&#39;échappement similaire à celle utilisée dans C et Perl: `` \ n`` correspond à une nouvelle ligne, `` \ t`` un onglet, etc. Plus généralement, `` \ xnn``, où nn est une chaîne de chiffres hexadécimaux, correspondant au caractère dont la valeur ASCII est nn. Si vous avez besoin d&#39;un code de caractère large (Unicode), vous pouvez utiliser `` \ x {nnnn}} ``, où `` nnnn`` - un ou plusieurs chiffres hexadécimaux.
ru_ru: Символы могут быть указаны с использованием синтаксиса escape-последовательностей, очень похожего на тот, который используется в C и Perl: `` \ n`` соответствует переводу строки, `` \ t`` табуляции и т. Д. В более общем смысле, `` \ xnn``, где nn - это строка шестнадцатеричных цифр, соответствует символу, значение ASCII которого равно nn. Если вам нужен широкий (Unicode) код символа, вы можете использовать `` \ x {nnnn} ``, где `` nnnn`` - одну или несколько шестнадцатеричных цифр.

source: Character classes
bg_bg: Класове на знаците
de_de: Charakterklassen
es_es: Clases de personajes
fr_fr: Cours de caractère
ru_ru: Классы персонажей

source: You can specify a character class, by enclosing a list of characters in ``[]``, which will match any one character from the list.
bg_bg: Можете да укажете клас на символи, като включите списък от символи в `` [] ``, който ще съответства на всеки един символ от списъка.
de_de: Sie können eine Zeichenklasse angeben, indem Sie eine Liste von Zeichen in `` [] `einschließen, die einem beliebigen Zeichen aus der Liste entspricht.
es_es: Puede especificar una clase de caracteres, al incluir una lista de caracteres en `` [] ``, que coincidirá con cualquier carácter de la lista.
fr_fr: Vous pouvez spécifier une classe de caractères en incluant une liste de caractères dans `` [] ``, qui correspondra à n&#39;importe quel caractère de la liste.
ru_ru: Вы можете указать класс символов, заключив список символов в `` [] ``, который будет соответствовать любому одному символу из списка.

source: If the first character after the ``[`` is ``^``, the class matches any character not in the list.
bg_bg: Ако първият символ след `` [`` е `` ``, класа съответства на всеки знак, който не е в списъка.
de_de: Wenn das erste Zeichen nach dem `` [`` `` ^ `` ist, entspricht die Klasse einem beliebigen Zeichen, das nicht in der Liste enthalten ist.
es_es: Si el primer carácter después del `` [`` es `` ^ ``, la clase coincide con cualquier carácter que no esté en la lista.
fr_fr: Si le premier caractère après le `` [`` est `` ^ ``, la classe correspond à tout caractère ne figurant pas dans la liste.
ru_ru: Если первый символ после `` [`` является `` ^ ``, класс соответствует любому символу, отсутствующему в списке.

source: Within a list, the ``-`` character is used to specify a range, so that a-z represents all characters between ``a`` and ``z``, inclusive.
bg_bg: В рамките на списъка символът `` -`` се използва за задаване на диапазон, така че az да представя всички символи между `` а`` и `` ``, включително.
de_de: Innerhalb einer Liste wird mit dem Zeichen `` --`` ein Bereich angegeben, so dass az alle Zeichen zwischen `` a`` und `` z`` (einschließlich) darstellt.
es_es: Dentro de una lista, el carácter `` -`` se usa para especificar un rango, de modo que az representa todos los caracteres entre `` a`` y `` z``, inclusive.
fr_fr: Dans une liste, le caractère `` -`` est utilisé pour spécifier une plage, de sorte que z représente tous les caractères compris entre `` a`` et `` z``, inclus.
ru_ru: Внутри списка символ `` -`` используется для указания диапазона, так что az представляет все символы между `` a`` и `` z`` включительно.

source: If You want ``-`` itself to be a member of a class, put it at the start or end of the list, or escape it with a backslash. If You want ``]`` you may place it at the start of list or escape it with a backslash.
bg_bg: Ако искате ```` сам да бъде член на класа, поставете го в началото или в края на списъка, или го избягвайте с обратна наклонена черта. Ако искате ``] `` можете да го поставите в началото на списъка или да го избягате с обратна наклонена черта.
de_de: Wenn Sie möchten, dass `` -`` selbst Mitglied einer Klasse ist, setzen Sie diese an den Anfang oder das Ende der Liste oder fliehen Sie mit einem Backslash ab. Wenn Sie ``] `` möchten, können Sie es an den Anfang der Liste setzen oder es mit einem Backslash entziehen.
es_es: Si quiere que `` -`` sea un miembro de una clase, póngalo al principio o al final de la lista, o escúchelo con una barra invertida. Si desea ``] `` puede colocarlo al comienzo de la lista o escapar con una barra invertida.
fr_fr: Si vous voulez que `` -`` soit lui-même membre d&#39;une classe, mettez-la au début ou à la fin de la liste ou échappez-la avec une barre oblique inverse. Si vous voulez ``] `` vous pouvez le placer en début de liste ou l&#39;échapper avec une barre oblique inverse.
ru_ru: Если вы хотите, чтобы `` -`` сам был членом класса, поместите его в начало или конец списка или экранируйте его обратной косой чертой. Если вы хотите ``] ``, вы можете поместить его в начало списка или экранировать его обратной косой чертой.

source: The ``^`` metacharacter by default is only guaranteed to match at the beginning of the input string/text, the ``$`` metacharacter only at the end. Embedded line separators will not be matched by ``^`` or ``$``.
bg_bg: Метасимволът `` ^ `` по подразбиране е гарантиран само в началото на входния низ / текст, `` $ `` метакарта само в края. Вградените разделители на редове няма да бъдат съвпадащи с `` ^ `` или `` $ ``.
de_de: Das `` ^ `` Metazeichen stimmt standardmäßig nur mit dem Anfang der Eingabezeichenfolge / -text überein, das `` `` `Metazeichen nur am Ende. Eingebettete Trennzeichen werden nicht mit `` ^ `` oder `` $ `` übereinstimmen.
es_es: El metacarácter `` ^ `` por defecto solo se garantiza que coincida al comienzo de la cadena / texto de entrada, el metacarácter `` $ `` solo al final. Los separadores de línea incrustados no coincidirán con `` ^ `` o `` $ ``.
fr_fr: Le métacaractère `` ^ `` par défaut est uniquement garanti au début de la chaîne / du texte en entrée, le métacaractère `` $ `` seulement à la fin. Les séparateurs de lignes incorporés ne seront pas mis en correspondance avec `` ^ `` ou `` $ ``.
ru_ru: Метасимвол `` ^ `` по умолчанию гарантированно совпадает только в начале входной строки / текста, метасимвол `` $ `` только в конце. Встроенные разделители строк не будут соответствовать `` ^ `` или `` $ ``.

source: You may, however, wish to treat a string as a multi-line buffer, such that the ``^`` will match after any line separator within the string, and ``$`` will match before any line separator. You can do this by switching On the `modifier /m <regexp_syntax.html#modifier_m>`__.
bg_bg: Може обаче да пожелаете да третирате низ като многоредов буфер, така че `` `` ще съвпадне след всеки разделител в низ, и `` $ `` ще съвпадне преди всеки разделител. Можете да направите това чрез включване на модификатора `m <regexp_syntax.html#modifier_m> `__.
de_de: Möglicherweise möchten Sie jedoch einen String als mehrzeiligen Puffer behandeln, so dass `` ^ `` nach einem beliebigen Zeilentrennzeichen innerhalb des Strings und `` `` `vor jedem Linientrenner passt. Sie können dies tun, indem Sie den Modifier / m einschalten <regexp_syntax.html#modifier_m> __.
es_es: Sin embargo, puede querer tratar una cadena como un búfer multilínea, de manera que el `` ^ `` coincidirá después de cualquier separador de línea dentro de la cadena, y `` $ `` coincidirá antes de cualquier separador de línea. Puede hacer esto activando el modificador `/ m <regexp_syntax.html#modifier_m> `__.
fr_fr: Cependant, vous pouvez souhaiter traiter une chaîne comme un tampon multi-ligne, de telle sorte que `` ^ `` corresponde après tout séparateur de ligne dans la chaîne, et `` $ `` corresponde avant tout séparateur de ligne. Vous pouvez le faire en activant le modificateur `/ m <regexp_syntax.html#modifier_m> `__.
ru_ru: Однако вы можете захотеть рассматривать строку как многострочный буфер, так что `` ^ `` будет соответствовать после любого разделителя строк в строке, а `` $ `` будет совпадать перед любым разделителем строк. Вы можете сделать это, включив модификатор `/ m <regexp_syntax.html#modifier_m> `__.

source: The ``\A`` and ``\Z`` are just like ``^`` and ``$``, except that they won’t match multiple times when the `modifier /m <regexp_syntax.html#modifier_m>`__ is used, while ``^`` and ``$`` will match at every internal line separator.
bg_bg: `` `` И `` `` са точно като `` `` и `` $ ``, с изключение на това, че няма да отговарят на няколко пъти, когато `модификаторът / м <regexp_syntax.html#modifier_m> `__ се използва, докато` `` `и` `$` `ще съответстват на всеки вътрешен разделител.
de_de: `` A&#39;` und `` \ Z`` sind genau wie `` ^ `` und `` `` `, außer dass sie nicht mehrmals übereinstimmen, wenn der` Modifier / m <regexp_syntax.html#modifier_m> __ wird verwendet, während `` ^ `` und `` `` `bei jedem internen Zeilentrenner übereinstimmen.
es_es: `` \ A`` y `` \ Z`` son como `` ^ `` y `` $ ``, excepto que no coincidirán varias veces cuando el `modificador / m <regexp_syntax.html#modifier_m> Se usa `__, mientras que` `^` `y` `$` `coincidirán en cada separador de línea interno.
fr_fr: Le `` \ A`` et le `` \ Z`` sont juste comme `` ^ `` et `` $ ``, sauf qu&#39;ils ne correspondront pas plusieurs fois quand le modificateur `/ m <regexp_syntax.html#modifier_m> `__ est utilisé, alors que` `^` `et` `$` `correspondront à chaque séparateur de ligne interne.
ru_ru: `` \ A`` и `` \ Z`` похожи на `` ^ `` и `` $ ``, за исключением того, что они не будут совпадать несколько раз, когда `modifier / m <regexp_syntax.html#modifier_m> `__ используется, в то время как` `^` `и` `$` `будут совпадать в каждом внутреннем разделителе строк.

source: The ``.`` metacharacter by default matches any character, but if You switch Off the `modifier /s <regexp_syntax.html#modifier_s>`__, then ``.`` won’t match embedded line separators.
bg_bg: Метасимволът &quot;.` `По подразбиране съвпада с всеки символ, но ако изключите модификатора` s <regexp_syntax.html#modifier_s> `__, то` `` `няма да съответства на вградените разделители на линии.
de_de: Das `` .``-Metazeichen entspricht standardmäßig jedem Zeichen, wenn Sie jedoch den `Modifikator &#39;ausschalten <regexp_syntax.html#modifier_s> `__, dann passt` `.`` nicht zu eingebetteten Trennzeichen.
es_es: El metacarácter `` .`` por defecto coincide con cualquier carácter, pero si usted desactiva el modificador / s <regexp_syntax.html#modifier_s> `__, entonces` `.`` no coincidirá con los separadores de línea incrustados.
fr_fr: Le métacaractère `` .`` correspond par défaut à n&#39;importe quel caractère, mais si vous désactivez le modificateur `/ s <regexp_syntax.html#modifier_s> `__, alors` `.`` ne correspondra pas aux séparateurs de lignes incorporés.
ru_ru: Метасимвол `` .`` по умолчанию соответствует любому символу, но если Вы выключите модификатор `s <regexp_syntax.html#modifier_s> `__, тогда` `.`` не будет соответствовать встроенным разделителям строк.

source: ``^`` is at the beginning of a input string, and, if `modifier /m <regexp_syntax.html#modifier_m>`__ is On, also immediately following any occurrence of ``\x0D\x0A`` or ``\x0A`` or ``\x0D`` (if You are using `Unicode version <tregexpr_interface.html#unicode>`__ of TRegExpr, then also ``\x2028`` or ``\x2029`` or ``\x0B`` or ``\x0C`` or ``\x85``). Note that there is no empty line within the sequence ``\x0D\x0A``.
bg_bg: `` `` е в началото на входния низ и, ако е модификатор / m <regexp_syntax.html#modifier_m> `__ е Включено, също непосредствено след всяка поява на&quot; x0D0A &quot;или` `0A`` или` `0D`` (ако използвате` Unicode версията <tregexpr_interface.html#unicode> `__ на TRegExpr, след това също` `2028`` или` `2029`` или` `0B`` или` `0C`` или` `85``). Забележете, че няма празна линия в последователността &quot;x0D0A&quot;.
de_de: `` ^ `` steht am Anfang einer Eingabezeichenfolge, und wenn `modifier / m <regexp_syntax.html#modifier_m> `__ ist an, auch unmittelbar im Anschluss an das Auftreten von` `\ x0D \ x0A`` oder` `\ x0A`` oder` `\ x0D`` (wenn Sie die Unicode-Version verwenden) <tregexpr_interface.html#unicode> `__ von TRegExpr, dann auch` `\ x2028`` oder` `\ x2029`` oder` \ x0B`` oder `` \ x0C`` oder `` \ x85``). Beachten Sie, dass sich in der Sequenz `` \ x0D \ x0A`` keine leere Zeile befindet.
es_es: `` ^ `` está al principio de una cadena de entrada, y, si `modifier / m <regexp_syntax.html#modifier_m> `__ está activado, también inmediatamente después de cualquier aparición de` `\ x0D \ x0A`` o` `\ x0A`` o` `\ x0D`` (si está utilizando la versión` Unicode <tregexpr_interface.html#unicode> `__ de TRegExpr, entonces también` `\ x2028`` o` `\ x2029`` o` `\ x0B`` o` `\ x0C`` o` `\ x85``). Tenga en cuenta que no hay una línea vacía dentro de la secuencia `` \ x0D \ x0A``.
fr_fr: `` ^ `` est au début d&#39;une chaîne d&#39;entrée, et, si `modificateur / m <regexp_syntax.html#modifier_m> `__ est activé, immédiatement après toute occurrence de` `\ x0D \ x0A`` ou` `\ x0A`` ou` `\ x0D`` (si vous utilisez` la version Unicode <tregexpr_interface.html#unicode> `__ de TRegExpr, puis aussi` `\ x2028`` ou` `\ x2029`` ou` `\ x0B`` ou` `\ x0C`` ou` `\ x85``). Notez qu&#39;il n&#39;y a pas de ligne vide dans la séquence `` \ \ x0D \ x0A``.
ru_ru: `` ^ `` находится в начале входной строки, и, если `модификатор / m <regexp_syntax.html#modifier_m> `__ включен, также сразу же после любого появления` `\ x0D \ x0A`` или` `\ x0A`` или` `\ x0D`` (если вы используете` версию Unicode <tregexpr_interface.html#unicode> `__ TRegExpr, затем также` `\ x2028`` или` `\ x2029`` или` `\ x0B`` или` `\ x0C`` или` `\ x85``). Обратите внимание, что в последовательности `` \ x0D \ x0A`` нет пустой строки.
