Repository: Alexey-T/TRegExpr
Catalog: docs/locale/*/LC_MESSAGES/regexp_syntax.po
Languages: bg_bg, de, de_de, es_es, fr_fr, ru, ru_ru

source: You can specify a series of alternatives for a pattern using ``|`` to separate them, so that fee|fie|foe will match any of ``fee``, ``fie``, or ``foe`` in the target string (as would ``f(e|i|o)e``). The first alternative includes everything from the last pattern delimiter (``(``, ``[``, or the beginning of the pattern) up to the first ``|``, and the last alternative contains everything from the last ``|`` to the next pattern delimiter. For this reason, it’s common practice to include alternatives in parentheses, to minimize confusion about where they start and end.
bg_bg: Можете да зададете серия от алтернативи за модел, използвайки `` | ``, за да ги разделите, така че таксата | fie | foe ще съответства на `` такса &#39;&#39;, `` fie``, или `` foe`` в целевия низ (както би бил `` f (e | i | o) e``)). Първата алтернатива включва всичко - от последния разделител на шаблона (`` (``, `` [``, или началото на шаблона] до първия `` | ``, а последната алтернатива съдържа всичко от последното ``; &quot;|` `към следващия разделител на шаблона. Поради тази причина е обичайна практика да се включват алтернативи в скоби, за да се сведе до минимум объркването за това къде те започват и завършват.
de_de: Sie können eine Reihe von Alternativen für ein Muster angeben, indem Sie `|` `verwenden, um sie voneinander zu trennen, so dass der Fee | fie | foe mit` `fee``,` `fie`` oder` `foe`` übereinstimmt die Zielzeichenfolge (wie `` f (e | i | o) e``). Die erste Alternative umfasst alles vom letzten Musterbegrenzer (`` (`` `` `` ``) oder vom Anfang des Musters) bis zum ersten `` | `, und die letzte Alternative enthält alles vom letzten` `|` `zum nächsten Musterbegrenzer. Aus diesem Grund ist es üblich, Alternativen in Klammern einzufügen, um die Verwirrung über den Beginn und das Ende zu minimieren.
es_es: Puedes especificar una serie de alternativas para un patrón usando `` | `` para separarlos, de modo que fee | fie | foe coincidirá con cualquiera de `` fee``, `` fie``, o `` foe`` en la cadena de destino (como lo haría `` f (e | i | o) e``). La primera alternativa incluye todo, desde el último delimitador de patrón (`` (``, `` [``, o el comienzo del patrón) hasta el primer `` | ``, y la última alternativa contiene todo desde el último ` `|` `hasta el siguiente delimitador de patrón. Por esta razón, es una práctica común incluir alternativas entre paréntesis, para minimizar la confusión sobre dónde comienzan y terminan.
fr_fr: Vous pouvez spécifier une série d&#39;alternatives pour un motif en utilisant `` | `` pour les séparer, de sorte que fee | fie | foe corresponde à l&#39;un des `` fee``, `` fie`` ou `` foe`` dans la chaîne cible (comme le ferait `` f (e | i | o) e``). La première alternative comprend tout, du dernier délimiteur de motif (`` (``, `` `` ``, ou le début du motif) jusqu&#39;au premier `` | ``, et la dernière alternative contient tout du dernier ` `|` `vers le prochain délimiteur de motifs. Pour cette raison, il est courant d&#39;inclure des alternatives entre parenthèses, afin de réduire les risques de confusion quant à leur point de départ et leur fin.
ru_ru: Вы можете указать ряд альтернатив для шаблона, используя `` | `` для их разделения, так что fee | fie | foe будет соответствовать любому из `` fee``, `` fie`` или `` foe`` в целевая строка (как бы `` f (e | i | o) e``). Первая альтернатива включает в себя все от последнего разделителя шаблона (`` (``, `` [`` или начало шаблона) до первого `` | ``, а последняя альтернатива содержит все от последнего ` `|` `к следующему разделителю шаблонов. По этой причине обычной практикой является включение альтернатив в скобках, чтобы минимизировать путаницу относительно того, где они начинаются и заканчиваются.

source: Alternatives are tried from left to right, so the first alternative found for which the entire expression matches, is the one that is chosen. This means that alternatives are not necessarily greedy. For example: when matching foo|foot against ``barefoot``, only the ``foo`` part will match, as that is the first alternative tried, and it successfully matches the target string. (This might not seem important, but it is important when you are capturing matched text using parentheses.)
bg_bg: Алтернативите се изпробват отляво надясно, така че първата намерена алтернатива, за която съвпада целия израз, е избраната. Това означава, че алтернативите не са непременно алчни. Например: при съвпадение на foo | foot с `` бос &#39;&#39;, само `` foo`` частта ще съвпадне, тъй като това е първата изпробвана алтернатива и успешно съвпада с целевия низ. (Това може да не изглежда важно, но е важно, когато записвате съответстващ текст с помощта на скоби.)
de_de: Es werden Alternativen von links nach rechts ausprobiert. Die erste gefundene Alternative, für die der gesamte Ausdruck passt, wird ausgewählt. Das bedeutet, dass Alternativen nicht unbedingt gierig sind. Zum Beispiel: Wenn foo | foot gegen `` barefoot`` abgeglichen wird, stimmt nur der `` foo``-Part überein, da dies die erste ausprobierte Alternative ist und die Zielzeichenfolge erfolgreich ist. (Dies scheint nicht wichtig zu sein, aber es ist wichtig, wenn Sie übereinstimmenden Text mithilfe von Klammern erfassen.)
es_es: Las alternativas se prueban de izquierda a derecha, por lo que la primera alternativa encontrada para la cual concuerda la expresión completa es la elegida. Esto significa que las alternativas no son necesariamente codiciosas. Por ejemplo: al hacer coincidir foo | foot con `` barefoot``, solo la parte `` foo`` coincidirá, ya que es la primera alternativa que se intentó y coincide con la cadena objetivo. (Puede que esto no parezca importante, pero es importante cuando está capturando texto coincidente usando paréntesis).
fr_fr: Les alternatives sont essayées de gauche à droite. La première alternative à laquelle correspond toute l&#39;expression est donc celle qui est choisie. Cela signifie que les alternatives ne sont pas nécessairement gourmandes. Par exemple: lors de la comparaison de foo | foot avec `` barefoot``, seule la partie `` foo`` correspond, car il s&#39;agit de la première alternative essayée et correspond avec succès à la chaîne cible. (Cela peut ne pas sembler important, mais cela est important lorsque vous capturez du texte correspondant à l&#39;aide de parenthèses.)
ru_ru: Альтернативы пробуются слева направо, поэтому первая найденная альтернатива, которой соответствует все выражение, - это та, которая выбрана. Это означает, что альтернативы не обязательно являются жадными. Например: при сопоставлении foo | foot с `` barefoot`` будет совпадать только часть `` foo``, так как это первая альтернативная попытка, и она успешно соответствует целевой строке. (Это может показаться не важным, но важно, когда вы захватываете сопоставленный текст с помощью скобок.)

source: Also remember that ``|`` is interpreted as a literal within square brackets, so if You write ``[fee|fie|foe]`` You’re really only matching ``[feio|]``.
bg_bg: Също така не забравяйте, че `` | `` се интерпретира като буквален в квадратни скоби, така че ако напишете `` [такса | fie | foe] `` Вие наистина съвпадате само с `` [feio |] ``.
de_de: Denken Sie auch daran, dass `` | `` in eckigen Klammern als Literal interpretiert wird. Wenn Sie also `` [fee | fie | foe] `` schreiben, passen Sie wirklich nur `` [feio |] ``
es_es: También recuerda que `` | `` se interpreta como un literal entre corchetes, así que si escribes `` [fee | fie | foe] `` Realmente solo estás haciendo coincidir `` [feio |] ``.
fr_fr: Rappelez-vous également que `` | `` est interprété comme un littéral entre crochets, donc si vous écrivez `[[fee | fie | foe]` `vous ne faites en réalité que correspondre à` `[feio |]` `.
ru_ru: Также помните, что `` | `` интерпретируется как литерал в квадратных скобках, поэтому, если вы напишите `` [fee | fie | foe] `` Вы действительно соответствуете `` [feio |] ``.

source: foo(bar|foo) matchs strings ‘foobar’ or ‘foofoo’.
bg_bg: foo (bar | foo) съвпада с &#39;foobar&#39; или &#39;foofoo&#39;.
de_de: foo (bar | foo) passt zu den Zeichenfolgen &#39;foobar&#39; oder &#39;foofoo&#39;.
es_es: foo (bar | foo) hace coincidir las cadenas &#39;foobar&#39; o &#39;foofoo&#39;.
fr_fr: foo (bar | foo) correspond aux cordes &#39;foobar&#39; ou &#39;foofoo&#39;.
ru_ru: foo (bar | foo) соответствует строкам &#39;foobar&#39; или &#39;foofoo&#39;.

source: Metacharacters - subexpressions
bg_bg: Метасимволи - подекспресии
de_de: Metazeichen - Unterausdrücke
es_es: Metacaracteres - subexpresiones
fr_fr: Métacaractères - sous-expressions
ru_ru: Метасимволы - подвыражения

source: The bracketing construct ``( ... )`` may also be used for define r.e. subexpressions (after parsing You can find subexpression positions, lengths and actual values in MatchPos, MatchLen and `Match <tregexpr_interface.html#tregexpr.match>`__ properties of TRegExpr, and substitute it in template strings by `TRegExpr.Substitute <tregexpr_interface.html#tregexpr.substitute>`__).
bg_bg: Конструкцията за bracketing `` (...) `` може също да се използва за дефиниране на повторни изповядвания (след парсиране Можете да намерите позициите, дължините и действителните стойности на субекспресия в MatchPos, MatchLen и `Match <tregexpr_interface.html#tregexpr.match> `__ свойства на TRegExpr, и да го замени в низове на шаблони от` TRegExpr.Substitute <tregexpr_interface.html#tregexpr.substitute> `__).
de_de: Das Bracketing-Konstrukt `` (...) `kann auch zum Definieren von erneuten Unterausdrücken verwendet werden <tregexpr_interface.html#tregexpr.match> `__ Eigenschaften von TRegExpr, und ersetzen Sie es in Vorlagenzeichenfolgen durch` TRegExpr.Substitute <tregexpr_interface.html#tregexpr.substitute> __).
es_es: La construcción de corchetes `` (...) `` también se puede usar para definir reexpresiones (después de analizar Puede encontrar posiciones de subexpresión, longitudes y valores reales en MatchPos, MatchLen y `Match <tregexpr_interface.html#tregexpr.match> `__ propiedades de TRegExpr, y sustitúyalo en cadenas de plantillas por` TRegExpr.Substitute <tregexpr_interface.html#tregexpr.substitute> `__).
fr_fr: La construction de bracketing `` (...) `` peut également être utilisée pour définir des sous-expressions (après l&#39;analyse, vous pouvez trouver des positions, des longueurs et des valeurs réelles de sous-expression dans MatchPos, MatchLen et `Match <tregexpr_interface.html#tregexpr.match> `__ propriétés de TRegExpr et les substituer dans les chaînes de modèle par` TRegExpr.Substitute <tregexpr_interface.html#tregexpr.substitute> `__).
ru_ru: Брекетная конструкция `` (...) `` также может использоваться для определения подвыражений re (после анализа Вы можете найти позиции, длины и фактические значения подвыражений в MatchPos, MatchLen и `Match <tregexpr_interface.html#tregexpr.match> `__ свойства TRegExpr и заменить его в строках шаблона на` TRegExpr.Substitute <tregexpr_interface.html#tregexpr.substitute> `__).

source: Subexpressions are numbered based on the left to right order of their opening parenthesis.
bg_bg: Подекспресиите се номерират въз основа на реда от ляво на дясно в тяхната отваряща се скоба.
de_de: Unterausdrücke werden in der Reihenfolge von links nach rechts ihrer öffnenden Klammer nummeriert.
es_es: Las subexpresiones se numeran según el orden de izquierda a derecha de su paréntesis de apertura.
fr_fr: Les sous-expressions sont numérotées en fonction de l&#39;ordre de gauche à droite de leur parenthèse d&#39;ouverture.
ru_ru: Субэкспрессии нумеруются в порядке слева направо их открывающей скобки.

source: First subexpression has number ``1`` (whole r.e. match has number ``0`` - You can substitute it in `TRegExpr.Substitute <tregexpr_interface.html#tregexpr.substitute>`__ as ``$0`` or ``$&``).
bg_bg: Първата субекспресия има номер &quot;1&quot; (цялото повторно съвпадение има номер &quot;0&quot; - можете да го замените в `TRegExpr.Substitute <tregexpr_interface.html#tregexpr.substitute> `__ като` `$ 0`` или` `$ &amp;` `).
de_de: Der erste Unterausdruck hat die Nummer &quot;1&quot; (das gesamte erneute Match hat die Nummer &quot;0&quot;) - Sie können es in &quot;TRegExpr.Substitute&quot; einsetzen <tregexpr_interface.html#tregexpr.substitute> `__ als` `$ 0`` oder` `$ &amp;` `).
es_es: La primera subexpresión tiene el número `` 1`` (toda la concordancia tiene el número `` 0`` - Puede sustituirlo en `TRegExpr.Substitute <tregexpr_interface.html#tregexpr.substitute> `__ como` `$ 0`` o` `$ &amp;` `).
fr_fr: La première sous-expression a le numéro `` 1`` (toute la correspondance a le numéro `` 0`` - vous pouvez la remplacer par `TRegExpr.Substitute <tregexpr_interface.html#tregexpr.substitute> `__ comme` `$ 0`` ou` `$ &amp;` `).
ru_ru: Первое подвыражение имеет номер `` 1`` (все повторное совпадение имеет номер `` 0`` - вы можете заменить его в `TRegExpr.Substitute <tregexpr_interface.html#tregexpr.substitute> `__ as` `$ 0`` или` `$ &amp;` `).

source: Metacharacters - backreferences
bg_bg: Метасимволи - backreferences
de_de: Metazeichen - Rückreferenzen
es_es: Metacaracteres - referencias inversas
fr_fr: Métacaractères - références arrière
ru_ru: Метасимволы - обратные ссылки

source: Metacharacters ``\1`` through ``\9`` are interpreted as backreferences. ``\<n>`` matches previously matched subexpression ``#<n>``.
bg_bg: Метасимволите `` 1`` до `` `` се тълкуват като обратни връзки. `` \ <n> `` съответства на предварително съвпадаща подекспресия `` # <n> ``.
de_de: Die Metazeichen &quot;` \ 1 &quot;bis&quot; \ 9 &quot;werden als Rückreferenzen interpretiert. `` \ <n> `` stimmt mit dem zuvor übereinstimmenden Unterausdruck überein `` # <n> ``.
es_es: Los metacaracteres `` \ 1`` a través de `` \ 9`` se interpretan como referencias inversas. `` \ <n> `` coincide con subexpresiones previamente coincidentes `` # <n> ``.
fr_fr: Les métacaractères `` \ 1`` à `` \ 9`` sont interprétés comme des références arrières. `` \ <n> `` correspond à la sous-expression précédemment appariée `` # <n> ``.
ru_ru: Метасимволы от `` \ 1`` до `` \ 9`` интерпретируются как обратные ссылки. `` \ <n> `` соответствует ранее найденному подвыражению `` # <n> ``.

source: Modifiers are for changing behaviour of TRegExpr.
bg_bg: Модификаторите са за промяна на поведението на TRegExpr.
de_de: Modifikatoren dienen zum Ändern des Verhaltens von TRegExpr.
es_es: Los modificadores son para cambiar el comportamiento de TRegExpr.
fr_fr: Les modificateurs servent à changer le comportement de TRegExpr.
ru_ru: Модификаторы предназначены для изменения поведения TRegExpr.

source: There are many ways to set up modifiers.
bg_bg: Има много начини да настроите модификатори.
de_de: Es gibt viele Möglichkeiten, Modifikatoren einzurichten.
es_es: Hay muchas formas de configurar modificadores.
fr_fr: Il y a plusieurs façons de configurer des modificateurs.
ru_ru: Есть много способов настроить модификаторы.

source: Any of these modifiers may be embedded within the regular expression itself using the `(?…) <regexp_syntax.html#inline_modifiers>`__ construct.
bg_bg: Всеки от тези модификатори може да бъде вграден в самия регулярен израз, използвайки `(?…) <regexp_syntax.html#inline_modifiers> `__ construct.
de_de: Jeder dieser Modifikatoren kann mit dem `(?…) In den regulären Ausdruck eingebettet werden. <regexp_syntax.html#inline_modifiers> `__ Konstrukt.
es_es: Cualquiera de estos modificadores se puede incrustar dentro de la expresión regular usando el `(? ...) <regexp_syntax.html#inline_modifiers> `__ construir.
fr_fr: Chacun de ces modificateurs peut être intégré à l’expression régulière elle-même à l’aide de la commande `(?…) <regexp_syntax.html#inline_modifiers> `__ construire.
ru_ru: Любой из этих модификаторов может быть встроен в само регулярное выражение с помощью `(? ...) <regexp_syntax.html#inline_modifiers> `__ построить.

source: Also, You can assign to appropriate TRegExpr properties (`ModifierX <tregexpr_interface.html#tregexpr.modifier_x>`__ for example to change /x, or ModifierStr to change all modifiers together). The default values for new instances of TRegExpr object defined in `global variables <#modifier_defs>`__, for example global variable RegExprModifierX defines value of new TRegExpr instance ModifierX property.
bg_bg: Също така, можете да присвоите на подходящи свойства на TRegExpr (`ModifierX <tregexpr_interface.html#tregexpr.modifier_x> `__ например за промяна / x, или ModifierStr за смяна на всички модификатори заедно). Стойностите по подразбиране за нови инстанции на TRegExpr обект, дефинирани в &quot;глобални променливи &lt;#modifier_defs&gt;` __, например глобална променлива RegExprModifierX, определя стойността на новото свойство.
de_de: Sie können auch entsprechende TRegExpr-Eigenschaften zuweisen (`ModifierX) <tregexpr_interface.html#tregexpr.modifier_x> (__, um beispielsweise / x zu ändern, oder ModifierStr, um alle Modifikatoren zusammen zu ändern). Die Standardwerte für neue Instanzen des TRegExpr-Objekts, die in `globale Variablen &lt;#modifier_defs&gt;` __ definiert sind, zum Beispiel die globale Variable RegExprModifierX definiert den Wert der neuen ModifierX-Eigenschaft der TRegExpr-Instanz.
es_es: Además, puede asignar propiedades TRegExpr apropiadas (`ModifierX <tregexpr_interface.html#tregexpr.modifier_x> `__ por ejemplo para cambiar / x, o ModifierStr para cambiar todos los modificadores juntos). Los valores predeterminados para las nuevas instancias del objeto TRegExpr definidos en `variables globales &lt;#modifier_defs&gt;` __, por ejemplo, la variable global RegExprModifierX define el valor de la nueva propiedad ModifierX de la instancia de TRegExpr.
fr_fr: Vous pouvez également affecter aux propriétés TRegExpr appropriées (`ModifierX <tregexpr_interface.html#tregexpr.modifier_x> `__ par exemple pour changer / x, ou ModifierStr pour changer tous les modificateurs ensemble). Les valeurs par défaut pour les nouvelles instances d&#39;objet TRegExpr définies dans `variables globales &lt;#modifier_defs&gt;` __, par exemple, la variable globale RegExprModifierX définit la valeur de la nouvelle propriété ModifierX d&#39;instance TRegExpr.
ru_ru: Кроме того, вы можете назначить соответствующие свойства TRegExpr (`ModifierX <tregexpr_interface.html#tregexpr.modifier_x> `__ например, чтобы изменить / х, или ModifierStr, чтобы изменить все модификаторы вместе). Значения по умолчанию для новых экземпляров объекта TRegExpr, определенных в `глобальных переменных &lt;#modifier_defs&gt;` __, например, глобальная переменная RegExprModifierX определяет значение нового свойства ModifierX экземпляра TRegExpr.

source: ### i
de_de: ### ich
es_es: ### yo
fr_fr: ### je
ru_ru: ### я

source: Do case-insensitive pattern matching (using installed in you system locale settings), see also `InvertCase <tregexpr_interface.html#invertcase>`__.
bg_bg: Отбележете съвпадение на нечувствителни към регистъра модели (използвайки инсталирани във вашите системни локални настройки), вижте също `InvertCase <tregexpr_interface.html#invertcase> `__.
de_de: Führen Sie die Groß- und Kleinschreibung nicht aus (unter Verwendung der in Ihrem Systemgebietsschema festgelegten Einstellungen), siehe auch InvertCase <tregexpr_interface.html#invertcase> __.
es_es: Haga una comparación de patrones que no distinga mayúsculas de minúsculas (utilizando la configuración regional de su sistema instalada), vea también `InvertCase <tregexpr_interface.html#invertcase> `__.
fr_fr: Faites une correspondance de modèle sans tenir compte de la casse (en utilisant installé dans les paramètres régionaux de votre système), voir aussi `InvertCase <tregexpr_interface.html#invertcase> `__.
ru_ru: Выполните сопоставление с образцом без учета регистра (используя установленные в вашей системе языковые настройки), см. Также `InvertCase <tregexpr_interface.html#invertcase> `__.

source: ### m
ru_ru: ### м

source: Treat string as multiple lines. That is, change ``^`` and ``$`` from matching at only the very start or end of the string to the start or end of any line anywhere within the string, see also `Line separators <tregexpr_interface.html#line_separators>`__.
bg_bg: Третирайте низ като няколко реда. Тоест, променете `` ^ `` и `` $ `` от съвпадение само в самото начало или край на низ към началото или края на всеки ред, където и да е в низ, вижте също `Разделители на линии &#39; <tregexpr_interface.html#line_separators> `__.
de_de: String als mehrere Zeilen behandeln. Ändern Sie also `` ^ `` und `` $ `` von der Übereinstimmung nur am Anfang oder Ende des Strings bis zum Anfang oder Ende einer beliebigen Zeile innerhalb des Strings. Siehe auch `Zeilentrennzeichen <tregexpr_interface.html#line_separators> __.
es_es: Trate la cuerda como líneas múltiples. Es decir, cambie `` ^ `` y `` $ `` de coincidir solo al principio o al final de la cadena al principio o al final de cualquier línea en cualquier lugar dentro de la cadena, vea también `Separadores de línea <tregexpr_interface.html#line_separators> `__.
fr_fr: Traiter la chaîne comme plusieurs lignes. Autrement dit, changez `` ^ `` et `` $ `` de la correspondance au tout début ou à la fin de la chaîne au début ou à la fin d&#39;une ligne n&#39;importe où dans la chaîne, voir aussi `Séparateurs de lignes <tregexpr_interface.html#line_separators> `__.
ru_ru: Обрабатывать строку как несколько строк. То есть, измените `` ^ `` и `` $ `` с сопоставления только в самом начале или конце строки с началом или концом любой строки в любом месте строки, см. Также `Разделители строк <tregexpr_interface.html#line_separators> `__.

source: ### s
bg_bg: ### с
ru_ru: ### с

source: Treat string as single line. That is, change ``.`` to match any character whatsoever, even a line separators (see also `Line separators <tregexpr_interface.html#line_separators>`__), which it normally would not match.
bg_bg: Третирайте низ като един ред. Тоест, променете `` ``, за да съответства на всеки знак, дори на разделители на редове (вижте също `Разделители на линии <tregexpr_interface.html#line_separators> `__), които обикновено не биха съответствали.
de_de: Zeichenfolge als einzelne Zeile behandeln. Das heißt, ändern Sie `` .`` so, dass es mit jedem beliebigen Zeichen übereinstimmt, sogar einem Trennzeichen für Zeilen (siehe auch `Trennzeichen für Linien) <tregexpr_interface.html#line_separators> `__), was normalerweise nicht passt.
es_es: Trate la cuerda como una sola línea. Es decir, cambie `` .`` para que coincida con cualquier carácter, incluso con separadores de línea (vea también `Separadores de línea <tregexpr_interface.html#line_separators> `__), que normalmente no coincidiría.
fr_fr: Traiter la chaîne comme une seule ligne. Autrement dit, changez `` .`` pour faire correspondre n&#39;importe quel caractère, même un séparateur de ligne (voir aussi `Séparateurs de ligne <tregexpr_interface.html#line_separators> `__), auquel il ne correspond normalement pas.
ru_ru: Обрабатывать строку как одну строку. То есть измените `` .``, чтобы он соответствовал любому символу, даже разделителям строк (см. Также разделители строк). <tregexpr_interface.html#line_separators> `__), что обычно не совпадает.

source: ### g
ru_ru: ### г
