Repository: Alexey-T/TRegExpr
Catalog: docs/locale/*/LC_MESSAGES/regexp_syntax.po
Languages: bg_bg, de, de_de, es_es, fr_fr, ru, ru_ru

source: ``$`` is at the end of a input string, and, if `modifier /m <regexp_syntax.html#modifier_m>`__ is On, also immediately preceding any occurrence of ``\x0D\x0A`` or ``\x0A`` or ``\x0D`` (if You are using `Unicode version <tregexpr_interface.html#unicode>`__ of TRegExpr, then also ``\x2028`` or ``\x2029`` or ``\x0B`` or ``\x0C`` or ``\x85``). Note that there is no empty line within the sequence ``\x0D\x0A``.
bg_bg: `` $ `` е в края на входния низ и, ако е модификатор / m <regexp_syntax.html#modifier_m> `__ е включено, също непосредствено преди всяка поява на` `0D x0A`` или` `0А`` или` `0D`` (ако използвате` Unicode версия` <tregexpr_interface.html#unicode> `__ на TRegExpr, след това също` `2028`` или` `2029`` или` `0B`` или` `0C`` или` `85``). Забележете, че няма празна линия в последователността &quot;x0D0A&quot;.
de_de: `` $ `` steht am Ende einer Eingabezeichenfolge, und wenn `modifier / m <regexp_syntax.html#modifier_m> `__ ist Ein, auch unmittelbar vor jedem Vorkommen von` `\ x0D \ x0A`` oder` `\ x0A`` oder` `\ x0D`` (wenn Sie` Unicode-Version verwenden) <tregexpr_interface.html#unicode> `__ von TRegExpr, dann auch` `\ x2028`` oder` `\ x2029`` oder` \ x0B`` oder `` \ x0C`` oder `` \ x85``). Beachten Sie, dass sich in der Sequenz `` \ x0D \ x0A`` keine leere Zeile befindet.
es_es: `` $ `` está al final de una cadena de entrada, y, si `modificador / m <regexp_syntax.html#modifier_m> `__ está activado, también precede inmediatamente a cualquier aparición de` `\ x0D \ x0A`` o` `\ x0A`` o` `\ x0D`` (si está utilizando la versión` Unicode <tregexpr_interface.html#unicode> `__ de TRegExpr, entonces también` `\ x2028`` o` `\ x2029`` o` `\ x0B`` o` `\ x0C`` o` `\ x85``). Tenga en cuenta que no hay una línea vacía dentro de la secuencia `` \ x0D \ x0A``.
fr_fr: `` $ `` est à la fin d&#39;une chaîne d&#39;entrée, et, si `modificateur / m <regexp_syntax.html#modifier_m> `__ est activé, précédant immédiatement toute occurrence de` \ x0D \ x0A`` ou `` \ x0A`` ou `` \ x0D`` (si vous utilisez la version Unicode <tregexpr_interface.html#unicode> `__ de TRegExpr, puis aussi` `\ x2028`` ou` `\ x2029`` ou` `\ x0B`` ou` `\ x0C`` ou` `\ x85``). Notez qu&#39;il n&#39;y a pas de ligne vide dans la séquence `` \ \ x0D \ x0A``.
ru_ru: `` $ `` находится в конце входной строки, и, если `модификатор / m <regexp_syntax.html#modifier_m> `__ включен, также непосредственно предшествует любому появлению` `\ x0D \ x0A`` или` `\ x0A`` или` `\ x0D`` (если вы используете` версию Unicode <tregexpr_interface.html#unicode> `__ TRegExpr, затем также` `\ x2028`` или` `\ x2029`` или` `\ x0B`` или` `\ x0C`` или` `\ x85``). Обратите внимание, что в последовательности `` \ x0D \ x0A`` нет пустой строки.

source: ``.`` matchs any character, but if You switch Off `modifier /s <regexp_syntax.html#modifier_s>`__ then ``.`` doesn’t match ``\x0D\x0A`` and ``\x0A`` and ``\x0D`` (if You are using `Unicode version <tregexpr_interface.html#unicode>`__ of TRegExpr, then also ``\x2028`` and ``\x2029`` and ``\x0B`` and ``\x0C`` and ``\x85``).
bg_bg: `` `` съответства на всеки символ, но ако изключите `модификатор / и <regexp_syntax.html#modifier_s> `__, тогава` `` `не съответства на` `x0D0A`` и` `0A`` и` `0D`` (ако използвате` Unicode версия \ t <tregexpr_interface.html#unicode> `__ на TRegExpr, след това също` `2028`` и` `2029`` и` `0B`` и` `0C`` и` `85``).
de_de: `` .`` entspricht einem beliebigen Zeichen, aber wenn Sie `Modifikator (en) ausschalten <regexp_syntax.html#modifier_s> `__ passt dann` `.`` nicht zu` `\ x0D \ x0A`` und` `\ x0A`` und` `\ x0D`` (wenn Sie die Unicode-Version verwenden) <tregexpr_interface.html#unicode> `__ von TRegExpr, dann auch` `\ x2028`` und` `\ x2029`` und` `\ x0B`` und` `\ x0C`` und` `\ x85``).
es_es: `` .`` coincide con cualquier carácter, pero si usted desactiva `modifier / s <regexp_syntax.html#modifier_s> `__ entonces` `.`` no coincide con` `\ x0D \ x0A`` y` `\ x0A`` y` `\ x0D`` (si está usando la versión` Unicode <tregexpr_interface.html#unicode> `__ de TRegExpr, entonces también` `\ x2028`` y` `\ x2029`` y` `\ x0B`` y` `\ x0C`` y` `\ x85``).
fr_fr: `` .`` correspond à n&#39;importe quel caractère, mais si vous désactivez `modificateur / s <regexp_syntax.html#modifier_s> `__ then` `.`` ne correspond pas à` `\ x0D \ x0A`` et` `\ x0A`` et` `\ x0D`` (si vous utilisez` la version Unicode <tregexpr_interface.html#unicode> `__ de TRegExpr, puis aussi` `\ x2028`` et` `\ x2029`` et` `\ x0B`` et` `\ x0C`` et` `\ x85``).
ru_ru: `` .`` соответствует любому символу, но если вы выключите `модификатор / s <regexp_syntax.html#modifier_s> `__ then` `.`` не совпадает с` `\ x0D \ x0A`` и` `\ x0A`` и` `\ x0D`` (если вы используете` версию Unicode <tregexpr_interface.html#unicode> `__ TRegExpr, затем также` `\ x2028`` и` `\ x2029`` и` `\ x0B`` и` `\ x0C`` и` `\ x85``).

source: Note that ``^.*$`` (an empty line pattern) doesnot match the empty string within the sequence ``\x0D\x0A``, but matchs the empty string within the sequence ``\x0A\x0D``.
bg_bg: Забележете, че &quot;^. * $` `(Празен шаблон на линия) не съвпада с празния низ в последователността&quot; x0D0A &quot;, но съвпада с празния низ в последователността&quot; x0A x0D &quot;.
de_de: Beachten Sie, dass `` ^. * $ `` (Ein leeres Linienmuster) nicht mit der leeren Zeichenfolge in der Sequenz `` \ x0D \ x0A`` übereinstimmt, sondern mit der leeren Zeichenfolge in der Sequenz `` xxA \ x0D``.
es_es: Tenga en cuenta que `` ^. * $ `` (Un patrón de línea vacío) no coincide con la cadena vacía dentro de la secuencia `` \ x0D \ x0A``, pero coincide con la cadena vacía dentro de la secuencia `` \ x0A \ x0D``.
fr_fr: Notez que `` ^. * $ `` (Un motif de ligne vide) ne correspond pas à la chaîne vide de la séquence `` \ x0D \ x0A``, mais correspond à la chaîne vide de la séquence `` \ x0A \ x0D``.
ru_ru: Обратите внимание, что `` ^. * $ `` (Шаблон пустой строки) не соответствует пустой строке в последовательности `` \ x0D \ x0A``, но соответствует пустой строке в последовательности `` \ x0A \ x0D``.

source: Multiline processing can be easely tuned for Your own purpose with help of TRegExpr properties `LineSeparators <tregexpr_interface.html#lineseparators>`__ and `LinePairedSeparator <tregexpr_interface.html#linepairedseparator>`__, You can use only Unix style separators ``\n`` or only DOS/Windows style ``\r\n`` or mix them together (as described above and used by default) or define Your own line separators!
bg_bg: Многолинейната обработка може лесно да бъде настроена за ваша собствена цел с помощта на свойствата на TRegExpr ® LineSeparators <tregexpr_interface.html#lineseparators> `__ и` LinePairedSeparator <tregexpr_interface.html#linepairedseparator> `__, Можете да използвате само разделители на стил на Unix` `n`` или само стил DOS / Windows` `r`` или да ги смесвате заедно (както е описано по-горе и използвано по подразбиране) или да дефинирате Вашите собствени разделители на линии!
de_de: Mit Hilfe der TRegExpr-Eigenschaften &quot;LineSeparators&quot; können Sie die Multiline-Verarbeitung ganz einfach für Ihren eigenen Zweck optimieren <tregexpr_interface.html#lineseparators> `__ und` LinePairedSeparator <tregexpr_interface.html#linepairedseparator> `__, Sie können nur Unix-Trennzeichen` `\ n`` oder nur DOS / Windows-` `\ r \ n`` verwenden oder sie zusammen mischen (wie oben beschrieben und standardmäßig verwendet) oder Ihre eigenen Trennzeichen definieren!
es_es: El procesamiento multilínea se puede ajustar fácilmente para su propio propósito con la ayuda de las propiedades TRegExpr `LineSeparators <tregexpr_interface.html#lineseparators> `__ y` LinePairedSeparator <tregexpr_interface.html#linepairedseparator> `__, puede usar solo los separadores de estilo Unix` `\ n`` o solo el estilo DOS / Windows` `\ r \ n`` o mezclarlos (como se describió anteriormente y se usa de manera predeterminada) o definir Sus propios separadores de línea.
fr_fr: Le traitement multiligne peut être facilement ajusté à votre convenance à l’aide des propriétés TRegExpr `LineSeparators <tregexpr_interface.html#lineseparators> `__ et` LinePairedSeparator <tregexpr_interface.html#linepairedseparator> `__, Vous pouvez utiliser uniquement des séparateurs de style Unix` `\ \ n`` ou uniquement le style DOS / Windows` `\ r \ n`` ou les mélanger (comme décrit ci-dessus et utilisés par défaut) ou définir vos propres séparateurs de ligne!
ru_ru: Многострочная обработка может быть легко настроена для ваших собственных целей с помощью свойств TRegExpr `LineSeparators <tregexpr_interface.html#lineseparators> `__ и` LinePairedSeparator <tregexpr_interface.html#linepairedseparator> `__, Вы можете использовать только разделители стиля Unix` `\ n`` или только стиль` `DOS / Windows` `\ r \ n`` или смешивать их вместе (как описано выше и используется по умолчанию) или определять свои собственные разделители строк!

source: Metacharacters - predefined classes
bg_bg: Метасимволи - предварително дефинирани класове
de_de: Metazeichen - vordefinierte Klassen
es_es: Metacaracteres - clases predefinidas
fr_fr: Métacaractères - classes prédéfinies
ru_ru: Метасимволы - предопределенные классы

source: You may use ``\w``, ``\d`` and ``\s`` within custom character classes.
bg_bg: Можете да използвате `` w``, `` d`` и `` `` в рамките на персонализираните класове от символи.
de_de: In benutzerdefinierten Zeichenklassen können Sie `` \ w``, `` \ d`` und `` \s`` verwenden.
es_es: Puede usar `` \ w``, `` \ d`` y `` \ s`` dentro de las clases de caracteres personalizados.
fr_fr: Vous pouvez utiliser `` \ w``, `` \ d`` et `` \ s`` dans les classes de caractères personnalisés.
ru_ru: Вы можете использовать `` \ w``, `` \ d`` и `` \ s`` в пользовательских классах символов.

source: TRegExpr uses properties `SpaceChars <tregexpr_interface.html#tregexpr.spacechars>`__ and `WordChars <tregexpr_interface.html#tregexpr.wordchars>`__ to define character classes ``\w``, ``\W``, ``\s``, ``\S``, so You can easely redefine it.
bg_bg: TRegExpr използва свойства `SpaceChars <tregexpr_interface.html#tregexpr.spacechars> `__ и` WordChars <tregexpr_interface.html#tregexpr.wordchars> `__, за да се определят класовете от символи` `w``,` `` `` `` `` `` ``, `` ``, така че можете лесно да ги предефинирате.
de_de: TRegExpr verwendet die Eigenschaften `SpaceChars <tregexpr_interface.html#tregexpr.spacechars> `__ und` WordChars <tregexpr_interface.html#tregexpr.wordchars> `__, um Zeichenklassen zu definieren:` \ w``, `` \ W``, `` \s``, `` \ S``, damit Sie es leicht neu definieren können.
es_es: TRegExpr usa propiedades `SpaceChars <tregexpr_interface.html#tregexpr.spacechars> `__ y` WordChars <tregexpr_interface.html#tregexpr.wordchars> `__ para definir las clases de caracteres` `\ w``,` `\ W``,` `\ s``,` `\ S``, así que puedes redefinirlo fácilmente.
fr_fr: TRegExpr utilise les propriétés `SpaceChars <tregexpr_interface.html#tregexpr.spacechars> `__ et` WordChars <tregexpr_interface.html#tregexpr.wordchars> `__ pour définir les classes de caractères` `\ w``,` `\ W``,` `\ s``,` `\ S``, afin que vous puissiez facilement le redéfinir.
ru_ru: TRegExpr использует свойства `SpaceChars <tregexpr_interface.html#tregexpr.spacechars> `__ и` WordChars <tregexpr_interface.html#tregexpr.wordchars> `__ для определения классов символов` `\ w``,` `\ W``,` `\ s``,` `\ S``, так что вы можете легко переопределить его.

source: Metacharacters - word boundaries
bg_bg: Метасимволи - граници на думи
de_de: Metazeichen - Wortgrenzen
es_es: Metacaracteres - límites de palabras
fr_fr: Métacaractères - limites de mots
ru_ru: Метасимволы - границы слов

source: A word boundary (``\b``) is a spot between two characters that has a ``\w`` on one side of it and a ``\W`` on the other side of it (in either order), counting the imaginary characters off the beginning and end of the string as matching a ``\W``.
bg_bg: Думата граница (`` b``) е място между два знака, което има `` `` `от едната страна на него и` `` `` от другата страна (в двата реда) преброяване на въображаемите символи в началото и в края на низ като съвпадение на `` W``.
de_de: Eine Wortgrenze (`` \ b``) ist ein Punkt zwischen zwei Zeichen, auf dessen einer Seite ein `\ w`` und auf der anderen Seite ein` `W`` (in beliebiger Reihenfolge) steht. , zählen die imaginären Zeichen vom Anfang und Ende der Zeichenfolge als übereinstimmend mit `` \ W``.
es_es: Un límite de palabra (`` \ b``) es un punto entre dos caracteres que tiene un `` \ w`` en un lado y un `` \ W`` en el otro lado (en cualquier orden) , contando los caracteres imaginarios del principio y el final de la cadena para que coincidan con un `` \ W``.
fr_fr: Une limite de mot (`` \ b``) est un espace entre deux caractères qui ont un `` \ w`` d&#39;un côté et un `` \ W`` de l&#39;autre (dans l&#39;un ou l&#39;autre ordre) , en comptant les caractères imaginaires du début et de la fin de la chaîne comme correspondant à un `` \ W``.
ru_ru: Граница слова (`` \ b``) - это точка между двумя символами, на одной стороне которой находится `` \ w`` и на другой стороне `` \ W`` (в любом порядке) , считая воображаемые символы в начале и конце строки как соответствующие `` \ W``.

source: Metacharacters - iterators
bg_bg: Метасимволи - итератори
de_de: Metazeichen - Iteratoren
es_es: Metacaracteres - iteradores
fr_fr: Métacaractères - itérateurs
ru_ru: Метасимволы - итераторы

source: Any item of a regular expression may be followed by another type of metacharacters - iterators. Using this metacharacters You can specify number of occurences of previous character, metacharacter or subexpression.
bg_bg: Всеки елемент от нормален израз може да бъде последван от друг тип метасимволи - итератори. Използвайки този метасимвол Можете да укажете броя на случаите с предишен символ, метасимвол или подекспресия.
de_de: Auf jedes Element eines regulären Ausdrucks kann ein anderer Typ von Metazeichen - Iteratoren - folgen. Verwenden dieser Metazeichen Sie können die Anzahl der Vorkommen von vorherigen Zeichen, Metazeichen oder Unterausdrücken angeben.
es_es: Cualquier elemento de una expresión regular puede ir seguido de otro tipo de metacaracteres: los iteradores. Uso de estos metacaracteres Puede especificar el número de apariciones de caracteres anteriores, metacaracteres o subexpresiones.
fr_fr: Tout élément d&#39;une expression régulière peut être suivi d&#39;un autre type de métacaractères: les itérateurs. Utilisation de ces métacaractères Vous pouvez spécifier le nombre d&#39;occurrences du caractère, métacaractère ou sous-expression précédent.
ru_ru: За любым элементом регулярного выражения могут следовать метасимволы другого типа - итераторы. Используя эти метасимволы Вы можете указать количество вхождений предыдущего символа, метасимвола или подвыражения.

source: So, digits in curly brackets of the form ``{n,m}``, specify the minimum number of times to match the item n and the maximum ``m``. The form ``{n}`` is equivalent to ``{n,n}`` and matches exactly ``n`` times. The form ``{n,}`` matches ``n`` or more times. There is no limit to the size of ``n`` or ``m``, but large numbers will chew up more memory and slow down r.e. execution.
bg_bg: Така, цифрите в къдрави скоби във формата `` {n, m} ``, указват минималния брой пъти, за да съвпаднат позицията n и максималната `` m``. Формата `` {n} `` е еквивалентна на `` {n, n} `` и отговаря точно на `` n`` пъти. Формата `` {n,} `` съвпада с `` n`` или повече пъти. Няма ограничение за размера на `` n`` или `` m``, но големите числа ще дъвчат повече памет и ще забавят повторното изпълнение.
de_de: Geben Sie also in geschweiften Klammern der Form `` {n, m} `` die Mindestanzahl an Übereinstimmungen mit dem Element n und das Maximum &#39;m&#39; an. Das Formular `` {n} `` entspricht `` {n, n} `` und stimmt genau mit `` n``-Zeiten überein. Das Formular `` {n,} `` entspricht `` n`` oder mehrmals. Es gibt keine Begrenzung für die Größe von `` n`` oder `` m``, aber große Zahlen beanspruchen mehr Speicher und verlangsamen die Wiederausführung.
es_es: Entonces, los dígitos entre paréntesis del formulario `` {n, m} ``, especifique el número mínimo de veces para que coincida con el elemento n y el máximo `` m``. La forma `` {n} `` es equivalente a `` {n, n} `` y coincide exactamente con los tiempos `` n``. La forma `` {n,} `` coincide con `` n`` o más veces. No hay límite para el tamaño de `` n`` o `` m``, pero los números grandes consumirán más memoria y ralentizarán la ejecución.
fr_fr: Ainsi, les chiffres entre accolades de la forme `` {n, m} ``, spécifient le nombre minimum de fois pour correspondre à l&#39;élément n et le maximum `` m``. La forme `` {n} `` est équivalente à `` {n, n} `` et correspond exactement à `` n`` fois. Le formulaire `` {n,} `` correspond à `` n`` ou plusieurs fois. Il n&#39;y a pas de limite à la taille de `` n`` ou `` m``, mais des nombres importants vont gaspiller plus de mémoire et ralentir la ré-exécution.
ru_ru: Итак, цифры в фигурных скобках вида `` {n, m} ``, задают минимальное количество раз, которое соответствует элементу n, и максимальное `` m``. Форма `` {n} `` эквивалентна `` {n, n} `` и соответствует ровно `` n`` разам. Форма `` {n,} `` соответствует `` n`` или более раз. Не существует ограничений на размер `` n`` или `` m``, но большие числа будут затрачивать больше памяти и замедлять повторное выполнение.

source: A little explanation about “greediness”. “Greedy” takes as many as possible, “non-greedy” takes as few as possible. For example, ``b+`` and ``b*`` applied to string ``abbbbc`` return ``bbbb``, ``b+?`` returns ``b``, ``b*?`` returns empty string, ``b{2,3}?`` returns ``bb``, ``b{2,3}`` returns ``bbb``.
bg_bg: Малко обяснение за „алчността“. „Алчният“ отнема колкото се може повече, „не-алчен“ отнема възможно най-малко. Например, `` b + `` и `` b * `` се прилагат към низ `` abbbbc`` връщане `` bbbb``, `` b +? `` Връща `` b``, `` b *? `` връща празен низ, `` b {2,3}? `` връща `` bb``, `` b {2,3} `` връща `` bbb``.
de_de: Eine kleine Erklärung zu &quot;Gier&quot;. &quot;Gierig&quot; braucht so viele wie möglich, &quot;Nichtgierig&quot; so wenig wie möglich. Zum Beispiel: `` b + `` und `` b * `` angewendet auf den String `` abbbbc`` geben `` bbbb`` zurück, `` b +? `` `` `` `` `` ` gibt eine leere Zeichenfolge zurück, `` b {2,3}? `` liefert `` bb``, `` b {2,3} `` `` bbb`` zurück.
es_es: Una pequeña explicación sobre la “avaricia”. &quot;Codicioso&quot; toma la mayor cantidad posible, &quot;no codicioso&quot; toma la menor cantidad posible. Por ejemplo, `` b + `` y `` b * `` aplicados a la cadena `` abbbbc`` devuelve `` bbbb``, `` b +? `` Devuelve `` b``, `` b *? `` devuelve una cadena vacía, `` b {2,3}? `` devuelve `` bb``, `` b {2,3} `` devuelve `` bbb``.
fr_fr: Une petite explication sur &quot;la gourmandise&quot;. &quot;Gourmand&quot; en prend le plus possible, &quot;non-gourmand&quot; le moins possible. Par exemple, «b +» et «b *» sont appliqués à la chaîne «abbbbc`` return` `bbbb``,` `b +?` `Renvoie` `b``,` `b *?` ` retourne une chaîne vide, `` b {2,3}? `` retourne `` bb``, `` b {2,3} `` renvoie `` bbb``.
ru_ru: Небольшое объяснение «жадности». «Жадный» берет как можно больше, «не жадный» - как можно меньше. Например, `` b + `` и `` b * `` применяются к строке `` abbbbc`` return `` bbbb``, `` b +? `` Возвращает `` b``, `` b *? `` возвращает пустую строку, `` b {2,3}? `` возвращает `` bb``, `` b {2,3} `` возвращает `` bbb``.

source: You can switch all iterators into “non-greedy” mode (see the `modifier /g <regexp_syntax.html#modifier_g>`__).
bg_bg: Можете да превключите всички итератори в режим “не-алчен” (вижте `модификатор / g <regexp_syntax.html#modifier_g> `__).
de_de: Sie können alle Iteratoren in den &quot;nicht-gierigen&quot; Modus setzen (siehe `modifier / g <regexp_syntax.html#modifier_g> __).
es_es: Puede cambiar todos los iteradores al modo &quot;no codicioso&quot; (consulte el `modificador / g <regexp_syntax.html#modifier_g> `__).
fr_fr: Vous pouvez basculer tous les itérateurs en mode “non gourmand” (voir le `modificateur / g <regexp_syntax.html#modifier_g> `__).
ru_ru: Вы можете переключить все итераторы в «не жадный» режим (см. «Modifier / g»). <regexp_syntax.html#modifier_g> `__).

source: Metacharacters - alternatives
bg_bg: Метасимволи - алтернативи
de_de: Metazeichen - Alternativen
es_es: Metacaracteres - alternativas
fr_fr: Métacaractères - alternatives
ru_ru: Метасимволы - альтернативы
