Repository: Alexey-T/TRegExpr
Catalog: docs/locale/*/LC_MESSAGES/regexp_syntax.po
Languages: bg_bg, de, de_de, es_es, fr_fr, ru, ru_ru

source: The first alternative includes everything from the last pattern delimiter (``(``, ``[``, or the beginning of the pattern) up to the first ``|``, and the last alternative contains everything from the last ``|`` to the next pattern delimiter.
de: Die erste Alternative umfasst alles vom letzten Musterbegrenzer (``(`` `` `` ``) oder vom Anfang des Musters) bis zum ersten `` | `, und die letzte Alternative enthält alles vom letzten` `|` `zum nächsten Musterbegrenzer.
ru: Первая альтернатива включает в себя все от последнего разделителя шаблона (``(``, ``[`` или начало шаблона) до первого ``|``, а последняя альтернатива содержит все от последнего ``|`` до следующего разделителя шаблона.

source: Sounds a little complicated, so it’s common practice to include alternatives in parentheses, to minimize confusion about where they start and end.
de: Klingt etwas kompliziert, daher ist es üblich, Alternativen in Klammern einzufügen, um die Verwirrung über den Anfang und das Ende zu minimieren.
ru: Звучит немного сложно, поэтому обычной практикой является заключение альтернатив в скобки, чтобы минимизировать путаницу относительно того, где они начинаются и заканчиваются.

source: Alternatives are tried from left to right, so the first alternative found for which the entire expression matches, is the one that is chosen.
de: Es werden Alternativen von links nach rechts ausprobiert. Die erste gefundene Alternative, für die der gesamte Ausdruck passt, wird ausgewählt.
ru: Альтернативы пробуются слева направо, поэтому первая же найденная альтернатива - это та, которая и будет выбрана.

source: This means that alternatives are not necessarily ``greedy``. For example, regular expression ``foo|foot`` in string ``barefoot`` will match ``foo``. Just a first alternative that's match.
de: Dies bedeutet, dass Alternativen nicht unbedingt &quot;gierig&quot; sind. Beispielsweise wird der reguläre Ausdruck `` foo | foot`` in der Zeichenfolge ``barefoot`` mit ``foo`` übereinstimmen. Nur eine erste Alternative, die passt.
ru: Это означает, что альтернативы не обязательно являются «жадными». Например, регулярное выражение ``foo|foot`` в строке ``barefoot`` будет соответствовать ``foo``. Совпадет первая альтернатива.

source: Also remember that ``|`` is interpreted as a literal within square brackets, so if you write ``[fee|fie|foe]`` you’re really only matching ``[feio|]``.
de: Denken Sie auch daran, dass `` | `` in eckigen Klammern als Literal interpretiert wird. Wenn Sie also `` [fee | fie | foe] `` schreiben, passen Sie wirklich nur `` [feio |] `` zusammen.
ru: Также помните, что ``|`` в квадратных скобках воспринимается просто как символ, поэтому, если вы напишите ``[fee|fie|foe]``, это тоже самое что ``[feio|]``.

source: Subexpressions
de: Unterausdrücke
ru: Подвыражения

source: The brackets ``( ... )`` may also be used to define regular expression subexpressions.
de: Die Klammern `` (...) `` können auch verwendet werden, um Unterausdrücke regulärer Ausdrücke zu definieren.
ru: Скобки ``(...)`` также могут использоваться для определения подвыражений регулярного выражения.

source: Subexpression positions, lengths and actual values will be in `MatchPos <tregexpr_interface.html#matchpos>`_, `MatchLen <tregexpr_interface.html#matchlen>`_ and `Match <tregexpr_interface.html#match>`_.
de: Positionen, Längen und tatsächliche Werte des Unterausdrucks werden in `MatchPos angegeben <tregexpr_interface.html#matchpos>`_,` MatchLen <tregexpr_interface.html#matchlen>`_ und` Match <tregexpr_interface.html#match>`_.
ru: Позиция, длина и фактические значения подвыражений будут в `MatchPos <tregexpr_interface.html#matchpos>`_, `MatchLen <tregexpr_interface.html#matchlen>`_ и `Match <tregexpr_interface.html#match>`_.

source: You can substitute them with `Substitute <tregexpr_interface.html#substitute>`_).
de: Sie können sie durch `Substitute &#39;ersetzen <tregexpr_interface.html#substitute>`_).
ru: Вы можете заменить их на `Substitute <tregexpr_interface.html#substitute>`_).

source: Subexpressions are numbered from left to right by their opening parenthesis (including nested subexpressions).
de: Unterausdrücke werden von links nach rechts durch ihre öffnenden Klammern nummeriert (einschließlich verschachtelter Unterausdrücke).
ru: Подвыражения нумеруются слева направо по открывающим их скобкам (включая вложенные подвыражения).

source: First subexpression has number ``1``. Whole regular expression match has number ``0``.
de: Der erste Unterausdruck hat die Nummer &quot;1&quot;. Der gesamte reguläre Ausdruck entspricht der Nummer &quot;0&quot;.
ru: Первое подвыражение имеет номер ``1``. Совпадение всего регулярного выражения имеет номер ``0``.

source: Backreferences
de: Rückreferenzen

source: Metacharacters ``\1`` through ``\9`` are interpreted as backreferences. ``\n`` matches previously matched subexpression ``n``.
de: Die Metazeichen &quot;` \ 1 &quot;bis&quot; \ 9 &quot;werden als Rückreferenzen interpretiert. ``\n`` stimmt mit dem vorher übereinstimmenden Unterausdruck ``n`` überein.
ru: Метасимволы от ``\1`` до ``\9`` интерпретируются как обратные ссылки. ``\n`` соответствует ранее найденному подвыражению ``n``.

source: ``(['"]?)(\d+)\1`` matchs ``"13"`` (in double quotes), or ``'4'`` (in single quotes) or ``77`` (without quotes) etc
bg_bg: &quot;(&quot; [? “)?) (d +) 1`` съответства на&quot; 13 &quot;(в двойни кавички), или&quot; 4 &quot;(в единични кавички) или&quot; 77 &quot; (без кавички) и т.н.
de: `` ([&#39;&quot;??) (\ d +) \ 1`` entspricht` `13&#39; (in doppelten Anführungszeichen) oder` `&#39;4&#39;` (in einfachen Anführungszeichen) oder` `77`` (ohne Anführungszeichen) etc
de_de: `` ([&#39;&quot;??) (\ d +) \ 1`` entspricht` `13&#39; (in doppelten Anführungszeichen) oder` `&#39;4&#39;` (in einfachen Anführungszeichen) oder` `77`` (ohne Anführungszeichen) etc
es_es: `` ([&#39;&quot;]?) (\ d +) \ 1`` coincide con` `&quot; 13 &quot;` `(entre comillas dobles), o` `&#39; 4&#39;`` (entre comillas simples) o` `77`` (sin comillas) etc
fr_fr: `` ((&#39;&#39;]]?) (\ d +) \ 1`` correspond `` &quot;13&quot; `(entre guillemets doubles), ou` `&#39;&#39; 4&#39;`` (entre guillemets simples) ou` `77`` (sans guillemets) etc.
ru: ``(['"]?)(\d+)\1`` соответствует ``"13"`` (в двойных кавычках) или ``'4'`` (в одинарных кавычках) или ``77`` (без кавычек) и т. д.
ru_ru: `` ([&#39;&quot;]?) (\ d +) \ 1`` соответствует` `&quot; 13 &quot;` `(в двойных кавычках) или` `&#39; 4&#39;`` (в одинарных кавычках) или` `77`` (без кавычек) и т. д.

source: Modifiers
bg_bg: Модификатори
de: Modifikatoren
de_de: Modifikatoren
es_es: Modificadores
fr_fr: Modificateurs
ru: Модификаторы
ru_ru: Модификаторы

source: Modifiers are for changing behaviour of ``TRegExpr``.
de: Modifikatoren dienen zum Ändern des Verhaltens von ``TRegExpr``.
ru: Модификаторы предназначены для изменения поведения ``TRegExpr``.

source: There are two ways to set up modifiers:
de: Es gibt zwei Möglichkeiten, Modifikatoren einzurichten:
ru: Существует два способа настройки модификаторов:

source: 1) Embed within the regular expression using the `(?imsxr-imsxr) <#inlinemodifiers>`_.
de: 1) Einbetten in den regulären Ausdruck mit den `(? Imsxr-imsxr) <#inlinemodifiers>`_.
ru: 1) Вставить в регулярное выражение, используя `(?imsxr-imsxr) <#inlinemodifiers>`_.

source: 2) Assign to appropriate ``TRegExpr`` property (`Modifier* <tregexpr_interface.html#modifierstr>`__. The default values for new instances of TRegExpr object defined in `global variables <tregexpr_interface.html#global-constants>`_. For example global variable ``RegExprModifierX`` defines default value for ``ModifierX`` property.
de: 2) Weisen Sie die entsprechende ``TRegExpr``-Eigenschaft zu (`Modifier *). <tregexpr_interface.html#modifierstr>`__. Die Standardwerte für neue Instanzen des TRegExpr-Objekts, die in globalen Variablen definiert sind <tregexpr_interface.html#global-constants>`_. Beispielsweise definiert die globale Variable ``RegExprModifierX`` den Standardwert für die `` ModifierX``-Eigenschaft.
ru: 2) Назначить соответствующее свойство ``TRegExpr`` (`Модификатор * <tregexpr_interface.html#modifierstr>`__. Значения по умолчанию для новых экземпляров объекта TRegExpr, определенных в `глобальных переменных <tregexpr_interface.html#global-constants>`_. Например, глобальная переменная ``RegExprModifierX`` определяет значение по умолчанию для свойства ``ModifierX``.

source: i
de: ich

source: Case-insensitive pattern matching (using installed in you system locale settings), see also `InvertCase <tregexpr_interface.html#invertcase>`__.
de: Vergleich der Groß- und Kleinschreibung ohne Übereinstimmung (unter Verwendung der in Ihren System-Locale-Einstellungen installierten Einstellungen), siehe auch InvertCase <tregexpr_interface.html#invertcase>`__.
ru: Регистро-независимое сравнение (с использованием установленных в вашей системе настроек языка), см. также `InvertCase <tregexpr_interface.html#invertcase>`_.

source: Treat string as multiple lines. So ``^`` and ``$`` matches the start or end of any line anywhere within the string.
de: String als mehrere Zeilen behandeln. `` ^ `` Und `` `` `entspricht also dem Anfang oder Ende einer beliebigen Zeile innerhalb des Strings.
ru: Обрабатывать строку как несколько строк. Таким образом, ``^`` и ``$`` соответствуют началу или концу любой строки в любом месте строки.

source: See also `Line separators <tregexpr_interface.html#lineseparators>`_.
de: Siehe auch `Zeilentrenner <tregexpr_interface.html#lineseparators>`_.
ru: Смотрите также `Разделители строк <tregexpr_interface.html#lineseparators>`_.

source: Treat string as single line. So ``.`` matches any character whatsoever, even a line separators.
de: Zeichenfolge als einzelne Zeile behandeln. ``.`` passt also zu jedem beliebigen Charakter, sogar zu Trennzeichen.
ru: Обрабатывать строку как одну строку. Так что ``.`` соответствует любому символу, даже разделителям строк.

source: See also `Line separators <tregexpr_interface.html#lineseparators>`_, which it normally would not match.
de: Siehe auch `Zeilentrenner <tregexpr_interface.html#lineseparators>`_, was normalerweise nicht passt.
ru: Смотрите также `Разделители строк <tregexpr_interface.html#lineseparators>`_.

source: Non standard modifier.
de: Kein Standardmodifikator.
ru: Нестандартный модификатор.

source: Switching it ``Off`` you’ll switch all following operators into non-greedy mode. So, if modifier ``/g`` is ``Off`` then ``+`` works as ``+?``, ``*`` as ``*?`` and so on.
de: Beim Ausschalten schalten Sie alle folgenden Operatoren in den nicht-gierigen Modus. Wenn also der Modifikator `` / g`` ``Off`` ist, funktioniert `+ &#39;als` `+?` `,` `*` `Als` `*?` `Und so weiter.
ru: Выключив его ``Off``, вы переключите все последующие операторы в не жадный режим. Итак, если модификатор ``/g`` имеет значение ``Off``, то ``+``работает как ``+?``, ``*`` Как ``*?`` И так далее.

source: By default this modifier is ``On``.
de: Standardmäßig ist dieser Modifikator ``On``.
ru: По умолчанию этот модификатор имеет значение ``Выкл``.

source: Tells the ``TRegExpr`` to ignore whitespace that is neither backslashed nor within a character class. You can use this to break up your regular expression into more readable parts.
de: Weist den ``TRegExpr`` an, Whitespace zu ignorieren, der weder rückwärts noch innerhalb einer Zeichenklasse ist. Sie können dies verwenden, um Ihren regulären Ausdruck in besser lesbare Teile aufzuteilen.
ru: ``TRegExpr`` будет игнорировать пробел, который не является ни обратной косой чертой, ни внутри класса символов. Вы можете использовать это, чтобы разбить ваше регулярное выражение на более читаемые части.

source: The ``#`` character is also treated as a metacharacter introducing a comment.
de: Das Zeichen `` # `` wird auch als ein Metazeichen behandelt, das einen Kommentar einleitet.
ru: Символ ``#`` также рассматривается как метасимвол, отделяющий комментарий.

source: This also means that if you want real whitespace or ``#`` characters in the pattern (outside a character class, where they are unaffected by ``/x``), you’ll either have to escape them or encode them using octal or hex escapes.
de: Dies bedeutet auch, dass, wenn Sie echte Whitespace- oder `` # `` Zeichen in dem Muster (außerhalb einer Zeichenklasse, wo sie nicht von ``/x`` betroffen sind) möchten, diese entweder entkommen oder sie mit codieren müssen Oktal- oder Hex-Fluchten.
ru: Это также означает, что если вам нужно вставить пробел или символ ``#`` в шаблон (вне класса символов, где они не затрагиваются ``/x``), вам придется либо эскейпить их, либо кодировать, используя восьмеричные или шестнадцатеричные побеги.

source: Non-standard modifier.
de: Nicht-Standard-Modifikator
ru: Нестандартный модификатор.

source: If is set then range ``а-я`` includes also ``ё``. And ``А-Я`` includes also ``Ё``. And ``а-Я`` includes all russian symbols.
de: Wenn eingestellt ist, umfasst der Bereich ``a-я`` auch ``ё``. Und ``А-Я`` umfasst auch ``Ё``. Und ``â-Я`` umfasst alle russischen Symbole.
ru: Если установлено, то диапазон ``а-я`` включает в себя также ``ё``. И ``А-Я`` включает в себя также ``Ё``. А ``а-я`` включает в себя все русские символы.

source: The modifier is set `On` by default.
de: Der Modifikator ist standardmäßig auf &quot;Ein&quot; gesetzt.
ru: Модификатор по умолчанию установлен на ``Вкл``.

source: Perl extensions
bg_bg: Perl разширения
de: Perl-Erweiterungen
de_de: Perl-Erweiterungen
es_es: Extensiones perl
fr_fr: Extensions Perl
ru: Расширения Perl
ru_ru: Расширения Perl

source: You may use it into r.e. for modifying modifiers by the fly. If this construction inlined into subexpression, then it effects only into this subexpression
bg_bg: Можете да го използвате за повторно модифициране на модификаторите от мухата. Ако тази конструкция е вдъхновена в субекспресия, тогава тя се отразява само на тази субекспресия
de: Sie können es verwenden, um Modifikatoren im Handumdrehen zu ändern. Wenn diese Konstruktion in einen Teilausdruck eingebettet ist, wirkt sich dies nur auf diesen Teilausdruck aus
de_de: Sie können es verwenden, um Modifikatoren im Handumdrehen zu ändern. Wenn diese Konstruktion in einen Teilausdruck eingebettet ist, wirkt sich dies nur auf diesen Teilausdruck aus
es_es: Puedes usarlo para re modificar modificadores por la marcha. Si esta construcción está en línea en una subexpresión, entonces solo afecta a esta subexpresión
fr_fr: Vous pouvez l&#39;utiliser pour modifier les modificateurs à la volée. Si cette construction est insérée dans une sous-expression, alors elle n’agit que dans cette sous-expression
ru: Вы можете использовать его в регулярных выражениях для модификации модификаторов на лету. Если эта конструкция встроена в подвыражение, то она влияет только на это подвыражение
ru_ru: Вы можете использовать его в re для модификации модификаторов на лету. Если эта конструкция встроена в подвыражение, то она влияет только на это подвыражение

source: A comment, the text is ignored. Note that TRegExpr closes the comment as soon as it sees a ``)``, so there is no way to put a literal ``)`` in the comment.
bg_bg: Коментар, текстът се игнорира. Имайте предвид, че TRegExpr затваря коментара веднага щом види ``) ``, така че няма начин да сложи литерала ``) `` в коментара.
de: Ein Kommentar, der Text wird ignoriert. Beachten Sie, dass TRegExpr den Kommentar schließt, sobald ein ``) `` angezeigt wird. Daher gibt es keine Möglichkeit, ein Literal ``) `` in den Kommentar einzufügen.
de_de: Ein Kommentar, der Text wird ignoriert. Beachten Sie, dass TRegExpr den Kommentar schließt, sobald ein ``) `` angezeigt wird. Daher gibt es keine Möglichkeit, ein Literal ``) `` in den Kommentar einzufügen.
es_es: Un comentario, el texto se ignora. Tenga en cuenta que TRegExpr cierra el comentario tan pronto como ve un ``) ``, por lo que no hay manera de poner un ``) `literal en el comentario.
fr_fr: Un commentaire, le texte est ignoré. Notez que TRegExpr ferme le commentaire dès qu&#39;il voit un `` `` `, il n&#39;y a donc aucun moyen de mettre un littéral` `)` `dans le commentaire.
ru: Комментарий, текст игнорируется. Обратите внимание, что TRegExpr закрывает комментарий, как только он видит ``)``, поэтому нет способа вставить литерал ``)`` в комментарий.
ru_ru: Комментарий, текст игнорируется. Обратите внимание, что TRegExpr закрывает комментарий, как только он видит ``) ``, поэтому нет способа вставить литерал ``) `` в комментарий.

source: Just now don’t forget to read the `FAQ <faq.html>`_ (expecially ‘non-greediness’ optimization `question <faq.html#nongreedyoptimization>`_).
de: Vergessen Sie jetzt nicht, die `FAQ &#39;zu lesen <faq.html>`_ (insbesondere &#39;Nicht-Gier&#39; Optimierung) Frage <faq.html#nongreedyoptimization>`_).
ru: Не забудьте прочитать `Оптимизация без жадности <faq.html#nongreedyoptimization>`_.

source: Play ground
de: Spielfeld
ru: Песочница

source: You can play with regular expressions using Windows `REStudio <https://github.com/masterandrey/TRegExpr/releases/download/0.952b/REStudio.exe>`_.
de: Sie können mit regulären Ausdrücken mit Windows `REStudio spielen <https://github.com/masterandrey/TRegExpr/releases/download/0.952b/REStudio.exe>`_.
ru: Вы можете поэкспериментировать с регулярными выражениями, используя Windows `REStudio <https://github.com/masterandrey/TRegExpr/releases/download/0.952b/REStudio.exe>`_.

source: (?#text)
bg_bg: (?#текст)
es_es: (?#texto)
fr_fr: (?#texte)
ru: (?#текст)
ru_ru: (?#текст)

source: Important note
bg_bg: Важна забележка
de_de: Wichtige Notiz
es_es: Nota IMPORTANTE
fr_fr: Note importante
ru_ru: Важная заметка

source: Below is the description of regular expressions implemented in freeware library `TRegExpr <http://regexpstudio.com>`__. The library was widely used in many free and commertial software products.
bg_bg: По-долу е описанието на регулярните изрази, внедрени в безплатната библиотека `TRegExpr <http://regexpstudio.com> `__. Библиотеката е широко използвана в много безплатни и комерсиални софтуерни продукти.
de_de: Im Folgenden werden reguläre Ausdrücke beschrieben, die in der Freeware-Bibliothek `TRegExpr &#39;implementiert sind <http://regexpstudio.com> __. Die Bibliothek wurde in vielen kostenlosen und kommerziellen Softwareprodukten eingesetzt.
es_es: A continuación se muestra la descripción de las expresiones regulares implementadas en la biblioteca de freeware `TRegExpr <http://regexpstudio.com> `__. La biblioteca fue ampliamente utilizada en muchos productos de software gratuitos y comerciales.
fr_fr: Ci-dessous se trouve la description des expressions rationnelles implémentées dans la bibliothèque du freeware `TRegExpr <http://regexpstudio.com> `__. La bibliothèque était largement utilisée dans de nombreux logiciels gratuits et commerciaux.
ru_ru: Ниже приведено описание регулярных выражений, реализованных в бесплатной библиотеке `TRegExpr <http://regexpstudio.com> `__. Библиотека широко использовалась во многих бесплатных и коммерческих программных продуктах.

source: Regular Expressions are a widely-used method of specifying patterns of text to search for. Special metacharacters allow You to specify, for instance, that a particular string You are looking for occurs at the beginning or end of a line, or contains n recurrences of a certain character.
bg_bg: Регулярните изрази са широко използван метод за определяне на шаблони за търсене на текст. Специални метасимволи Ви позволяват да укажете, например, че определен низ, който търсите, се появява в началото или в края на ред или съдържа n повторения от определен символ.
de_de: Reguläre Ausdrücke sind eine weit verbreitete Methode zum Festlegen von Textmustern, nach denen gesucht werden soll. Mit speziellen Metazeichen können Sie beispielsweise angeben, dass eine bestimmte Zeichenfolge, nach der Sie suchen, am Anfang oder Ende einer Zeile vorkommt oder n Wiederholungen eines bestimmten Zeichens enthält.
es_es: Las expresiones regulares son un método ampliamente utilizado para especificar patrones de texto para buscar. Los metacaracteres especiales le permiten especificar, por ejemplo, que una cadena particular que está buscando ocurre al principio o al final de una línea, o contiene n repeticiones de un determinado carácter.
fr_fr: Les expressions régulières sont une méthode largement utilisée pour spécifier des modèles de texte à rechercher. Des métacaractères spéciaux vous permettent de spécifier, par exemple, qu&#39;une chaîne particulière que vous recherchez se produit au début ou à la fin d&#39;une ligne ou contient n récurrences d&#39;un caractère donné.
ru_ru: Регулярные выражения - это широко используемый метод определения шаблонов текста для поиска. Специальные метасимволы позволяют вам указать, например, что конкретная искомая строка встречается в начале или конце строки или содержит n повторений определенного символа.

source: Regular expressions look ugly for novices, but really they are very simple (well, usually simple ;) ), handly and powerfull tool.
bg_bg: Редовните изрази изглеждат грозни за начинаещи, но всъщност те са много прости (добре, обикновено прости;)), ръчно и мощно средство.
de_de: Reguläre Ausdrücke sehen für Anfänger hässlich aus, aber sie sind wirklich sehr einfach (gut, normalerweise einfach;)), handlich und leistungsstark.
es_es: Las expresiones regulares se ven feas para los principiantes, pero en realidad son muy simples (bueno, generalmente simples;)), una herramienta práctica y poderosa.
fr_fr: Les expressions régulières ont l&#39;air moche pour les novices, mais en réalité elles sont très simples (enfin, généralement simples;)), pratiques et puissantes.
ru_ru: Регулярные выражения выглядят уродливо для новичков, но на самом деле они очень простые (ну, обычно простые;)), удобный и мощный инструмент.
