Repository: Alexey-T/TRegExpr
Catalog: docs/locale/*/LC_MESSAGES/regular_expressions.po
Languages: bg, de, es, fr

source: `Français <https://regex.masterandrey.com/fr/latest/index.html>`__
bg: `Френски <https://regex.masterandrey.com/fr/latest/index.html>`__

source: Regular expressions (RegEx)
bg: Редовни изрази (RegEx)
de: Reguläre Ausdrücke (RegEx)
es: Expresiones regulares (RegEx)
fr: Expressions régulières (RegEx)

source: Introduction
bg: Въведение
de: Einführung
es: Introducción

source: Regular expressions are a handy way to specify patterns of text.
bg: Редовните изрази са удобен начин да укажете шаблони на текст.
de: Reguläre Ausdrücke sind eine praktische Möglichkeit, Textmuster anzugeben.
es: Las expresiones regulares son una forma práctica de especificar patrones de texto.
fr: Les expressions régulières sont un moyen pratique de spécifier des modèles de texte.

source: With regular expressions you can validate user input, search for some patterns like emails of phone numbers on web pages or in some documents and so on.
bg: С регулярни изрази можете да проверите въвеждането от потребителя, да потърсите някои модели като имейли на телефонни номера на уеб страници или в някои документи и т.н.
de: Mit regulären Ausdrücken können Sie Benutzereingaben validieren, nach Mustern wie E-Mail-Adressen oder Telefonnummern auf Webseiten oder in Dokumenten suchen und so weiter.
es: Con expresiones regulares puede validar la entrada del usuario, buscar algunos patrones como correos electrónicos de números de teléfono en páginas web o en algunos documentos, etc.
fr: Avec les expressions régulières, vous pouvez valider la saisie de l&#39;utilisateur, rechercher des modèles tels que les adresses électroniques de numéros de téléphone sur des pages Web ou dans certains documents, etc.

source: Below is complete regular expressions cheat sheet just on one page.
bg: По-долу е пълна редовни изрази измама лист само на една страница.
de: Nachfolgend auf einer einzigen Seite ein Spickzettel zum Thema reguläre Ausdrücke.
es: A continuación se incluye una hoja de trucos de expresiones regulares solo en una página.
fr: Vous trouverez ci-dessous une feuille de triche sur les expressions régulières complète sur une seule page.

source: Characters
bg: Герои
de: Zeichen
es: Caracteres
fr: Personnages

source: Simple matches
bg: Обикновено съвпадение
de: Einfache Übereinstimmungen
es: Partidos simples
fr: Matchs simples

source: Any single character matches itself.
bg: Всеки един символ съвпада сам.
de: Jedes einzelne Zeichen passt zu sich selbst.
es: Cualquier carácter individual coincide solo.
fr: Tout personnage unique correspond à lui-même.

source: A series of characters matches that series of characters in the input string.
bg: Поредица от символи съвпада с тази поредица от знаци във входния низ.
de: Eine Reihe von Zeichen stimmt mit dieser Reihe von Zeichen in der Eingabezeichenfolge überein.
es: Una serie de caracteres coincide con esa serie de caracteres en la cadena de entrada.
fr: Une série de caractères correspond à cette série de caractères dans la chaîne d&#39;entrée.

source: RegEx
bg: регулярен израз

source: Matches
bg: кибрит
de: passt auf
es: Partidos
fr: Allumettes

source: Non-Printable Characters (escape-codes)
bg: Символи, които не могат да бъдат отпечатани (кодове за бягство)
de: Nicht druckbare Zeichen (Escape-Codes)
es: Caracteres no imprimibles (códigos de escape)
fr: Caractères non imprimables (codes d&#39;échappement)

source: To represent non-printable character in regular expression you use ``\x..``:
bg: За представяне на непечатаем символ в нормален израз използвате `` \ t
de: Um nicht druckbare Zeichen in regulären Ausdrücken darzustellen, verwenden Sie ``\x..``:
es: Para representar caracteres no imprimibles en expresiones regulares, use ``\x..``:
fr: Pour représenter un caractère non imprimable dans une expression régulière, utilisez ``\x..``:

source: character with hex code ``nn``
bg: герой с шестнадесетичен код `` nn``
de: Zeichen mit Hex-Code ``nn``
es: carácter con el código hexadecimal `` nn``
fr: caractère avec code hexagonal `` nn``

source: ``\x{nnnn}``
bg: `` \ Х {NNNN} ``

source: character with hex code ``nnnn`` (one byte for plain text and two bytes for Unicode)
bg: знак с шестнадесетичен код ``nnnn`` (един байт за обикновен текст и два байта за Unicode)
de: Zeichen mit Hex-Code ``nnnn`` (ein Byte für Klartext und zwei Byte für Unicode)
es: carácter con el código hexadecimal ``nnnn`` (un byte para texto sin formato y dos bytes para Unicode)
fr: caractère avec code hexadécimal ``nnnn`` (un octet pour le texte brut et deux octets pour Unicode)

source: ``foo\x20bar``
bg: `` Фу \ x20bar``

source: ``foo bar`` (note space in the middle)
bg: ``foo bar`` (забележете място в средата)
de: ``foo bar`` (Beachten Sie das Leerzeichen in der Mitte)
es: ``foo bar`` (nota el espacio en el medio)
fr: ``foo bar`` (notez l&#39;espace au milieu)

source: There are a number of predefined ``escape-codes`` for non-printable characters, just like in ``C`` language:
bg: Има редица предварително дефинирани `` escape-codes &#39;&#39; за символи, които не могат да бъдат отпечатани, точно като в ``C`` език:
de: Es gibt eine Reihe vordefinierter ``Escape-Codes`` für nicht druckbare Zeichen, genau wie in der Sprache ``C``:
es: Hay una serie de `` códigos de escape »predefinidos para los caracteres no imprimibles, como en el lenguaje` `C``:
fr: Il existe un certain nombre de `` code d&#39;échappement`` prédéfinis pour les caractères non imprimables, comme dans le langage ``C``:

source: tab (HT/TAB), same as ``\x09``
bg: (HT / TAB), същото като &quot;x09&quot;
de: (Horizontal-)Tabulator (HT / TAB), identisch mit ``\x09``
es: pestaña (HT / TAB), igual que ``\x09``
fr: onglet (HT / TAB), identique à ``\x09``

source: newline (NL), same as ``\x0a``
bg: нов ред (NL), същото като &quot;x0a&quot;
de: Zeilenschaltung (Newline, NL), wie ``\x0a``
es: nueva línea (NL), igual que `` \ x0a``
fr: newline (NL), identique à `` \ x0a``

source: car.return (CR), same as ``\x0d``
bg: car.return (CR), същото като &quot;x0d&quot;
de: Wagenrücklauf (carrier return, CR), das gleiche wie `` \ x0d``
es: car.return (CR), igual que `` \ x0d``
fr: car.return (CR), identique à `` \ x0d``

source: form feed (FF), same as ``\x0c``
bg: форма (FF), същата като &quot;x0c&quot;
de: Formularvorschub (FF), wie ``\x0c``
es: form feed (FF), igual que `` \ x0c``
fr: Form Feed (FF), identique à `` \ x0c``

source: alarm (BEL), same as ``\x07``
bg: аларма (BEL), същата като &quot;x07&quot;
de: Alarm (BEL), gleichbedeutend mit ``\x07``
es: alarma (BEL), igual que `` \ x07``
fr: alarme (BEL), identique à `` \ x07``

source: escape (ESC), same as ``\x1b``
bg: бягство (ESC), същото като &quot;x1b&quot;
de: Escape (ESC), genauso wie ``\x1b``
es: escape (ESC), igual que `` \ x1b``
fr: échappement (ESC), identique à `` \ x1b``

source: ``foobar`` preceded by TAB
bg: &quot;foobar&quot;, предшествано от TAB
es: ``foobar`` precedido por TAB
fr: ``foobar`` précédé de TAB

source: Escaping
bg: Бягството
de: Maskierung (Escaping)
es: Escapando
fr: S&#39;échapper

source: If you want to use character ``\`` by itself, not as part of ``escape-code``, just prefix it with ``\``, like that: ``\\``.
bg: Ако искате да използвате символ `` `сам по себе си, а не като част от` `escape-code``, просто го префиксирайте с` `` `, като този:` `.
de: Wenn Sie das Zeichen ``\`` als solches, also nicht als Teil eines ``escape code`` darstellen wollen, setzen Sie einfach noch ein ``\`` davor, also: ``\\``.
es: Si desea utilizar el carácter ``\`` por sí mismo, no como parte de ``escape-code``, simplemente prefiéstelo con ``\``, así: ``\\``.
fr: Si vous voulez utiliser le caractère `` `` lui-même, pas dans le cadre de `` escape-code``, préfixez-le simplement avec le `` ``, comme ceci: ``\\``.

source: In fact you can prefix (or ``escape``) with ``\`` any character that has special meaning in regular expressions.
bg: Всъщност можете да поставите префикс (или &quot;escape&quot;) с `` всеки символ, който има специално значение в регулярните изрази.
de: Tatsächlich können Sie jedem Zeichen, das in regulären Ausdrücken eine Sonderbedeutung hat, ein ``\`` als „„„Fluchtsymbol“““ (``escape``) voranstellen.
es: De hecho, puedes usar el prefijo (o ``escape``) con ``\`` cualquier carácter que tenga un significado especial en las expresiones regulares.
fr: En fait, vous pouvez préfixer (ou ``escape``) avec ``\`` tout caractère ayant une signification spéciale dans les expressions régulières.

source: ``^FooBarPtr`` this is ``^`` and not `start of line <#lineseparators>`__
bg: `` ^ FooBarPtr`` това е `` `` `и не` `старт на ред <#lineseparators&gt;` __
de: ``^FooBarPtr`` (Dies ist ein literales ``^`` und nicht das Metazeichen für `Zeilenanfang <#lineseparators>`__)
es: `` ^ FooBarPtr`` esto es ``^`` y no `comienzo de línea <#lineseparators>`__
fr: `` ^ FooBarPtr`` c&#39;est ``^`` et pas `début de ligne <#lineseparators>`__

source: ``\[a\]``
bg: `` \ [А \] ``

source: ``[a]`` this is not `character class <#userclass>`__
bg: `` [а] `` това не е &#39;class class <#userclass&gt; `__
de: ``[a]`` (Dies ist ein a in eckigen Klammern, nicht eine aus a bestehende `Zeichenklasse <#userclass>`__)
es: `` [a] `` esto no es `clase de caracteres <#userclass>`__
fr: `` [a] `` ceci n&#39;est pas `la classe de caractères <#userclass>`__

source: Character Classes
bg: Класове на знаците
de: Zeichenklassen
es: Clases de personajes
fr: Classes de personnages

source: User Character Classes
bg: Класове на потребителските знаци
de: Benutzerdefinierte Zeichenklassen
es: Clases de caracteres del usuario
fr: Classes de caractères utilisateur

source: Character class is a list of characters inside ``[]``. The class matches any **one** character listed in this class.
bg: Класът символи е списък от символи в ``[]``. Класът съответства на всеки ** един ** символ, изброени в този клас.
de: Eine Zeichenklasse ist eine Liste von Zeichen in ``[]``. Die Klasse steht für genau **ein** beliebiges Zeichen aus dieser Liste.
es: La clase de caracteres es una lista de caracteres dentro de ``[]``. La clase coincide con cualquier ** uno ** carácter listado en esta clase.
fr: La classe de caractères est une liste de caractères à l&#39;intérieur de ``[]``. La classe correspond à n&#39;importe quel ** un ** caractère répertorié dans cette classe.

source: ``foob[aeiou]r``
bg: `` foob [аеиоу] r``

source: ``foobar``, ``foober`` etc but not ``foobbr``, ``foobcr`` etc
bg: &quot;foobar&quot;, &quot;foober&quot; и т.н., но не и &quot;foobbr&quot;, &quot;foobcr&quot; и т.н.
de: ``foobar``, ``foober`` usw., nicht aber ``foobbr``, ``foobcr`` etc.
es: ``foobar``, ``foober`` etc. pero no ``foobbr``, ``foobcr`` etc.
fr: ``foobar``, ``foober`` etc mais pas ``foobbr``, ``foobcr`` etc

source: You can ``invert`` the class - if the first character after the ``[`` is ``^``, then the class matches any character **but** characters listed in the class.
bg: Можете да &quot;инвертирате&quot; класа - ако първият символ след ``[`` е `` ``, тогава класът съответства на всеки символ **, но ** символи, изброени в класа.
de: Sie können die Klasse „invertieren“ - wenn als erstes Zeichen nach dem ``[`` ein ``^`` steht, dann steht die Klasse ebenfalls für **ein** beliebiges Zeichen, allerdings eines, das **nicht** in der Liste vorkommt.
es: Puede `` invertir`` la clase - si el primer carácter después del ``[`` es ``^``, entonces la clase coincide con cualquier carácter ** pero ** los caracteres listados en la clase.
fr: Vous pouvez `` inverser`` la classe - si le premier caractère après le ``[`` est ``^``, alors la classe correspond à n&#39;importe quel caractère ** à l&#39;exception des ** caractères répertoriés dans la classe.

source: ``foob[^aeiou]r``
bg: `` Foob [^ аеиоу] r``

source: ``foobbr``, ``foobcr`` etc but not ``foobar``, ``foober`` etc
bg: &quot;foobbr&quot;, &quot;foobcr&quot; и т.н., но не &quot;foobar&quot;, &quot;foober&quot; и т.н.
de: ``foobbr``, ``foobcr`` usw., aber nicht ``foobar``, ``foober`` etc.
es: ``foobbr``, ``foobcr`` etc. pero no ``foobar``, ``foober`` etc.
fr: ``foobbr``, ``foobcr`` etc mais pas ``foobar``, ``foober`` etc

source: Within a list, the ``-`` character is used to specify a range, so that ``a-z`` represents all characters between ``a`` and ``z``, inclusive.
bg: В рамките на списъка символът ``-`` се използва за задаване на диапазон, така че `` az`` представлява всички символи между ``а`` и `` ``, включително.
de: Innerhalb einer Liste wird der Bindestrich ``-`` verwendet, um einen Bereich anzugeben, z.B. passt ``a-z`` für jedes Zeichen von ``a`` bis ``z`` (einschließlich).
es: Dentro de una lista, el carácter ``-`` se usa para especificar un rango, de modo que ``az`` representa todos los caracteres entre ``a`` y ``z``, inclusive.
fr: Dans une liste, le caractère ``-`` est utilisé pour spécifier une plage, de sorte que ``az`` représente tous les caractères compris entre ``a`` et ``z``, inclus.

source: If you want ``-`` itself to be a member of a class, put it at the start or end of the list, or `escape <#escape>`__ it with a backslash.
bg: Ако искате самият `` `` да бъде член на клас, поставете го в началото или в края на списъка, или `escape <#escape>`__ с обратна наклонена черта.
de: Wenn ein Bindestrich ``-`` selbst Bestandteil der Klasse sein soll, schreiben Sie ihn an den Anfang oder das Ende der Liste oder `maskieren <#escape>`_ ihn per vorangestelltem Rückwärtsschrägstrich (Backslash) ``\`` .
es: Si quiere que ``-`` sea miembro de una clase, póngalo al principio o al final de la lista, o `escape <#escape>`__ con una barra invertida.
fr: Si vous voulez que ``-`` soit lui-même membre d&#39;une classe, mettez-le au début ou à la fin de la liste ou `escape <#escape>`__ avec une barre oblique inverse.

source: If you want ``]`` or ``[`` you may place it at the start of list or escape it with a backslash.
bg: Ако искате `` `` `или` `[` `, можете да го поставите в началото на списъка или да го избягате с обратна наклонена черта.
es: Si desea ``]`` o ``[`` puede colocarlo al comienzo de la lista o escapar con una barra invertida.
fr: Si vous voulez ``]`` ou ``[``, vous pouvez le placer en début de liste ou l&#39;échapper avec une barre oblique inverse.

source: ``a``, ``z`` and ``-``
bg: &quot;а&quot;, &quot;z&quot; и &quot;-`&quot;
de: ``a``, ``z`` und ``-``
es: ``a``, ``z`` y ``-``
fr: ``a``, ``z`` et ``-``

source: ``[a\-z]``
bg: `` [А \ -Z] ``

source: characters from ``a`` to ``z``
bg: символи от ``а`` до `` ``
de: Zeichen von ``a`` bis ``z``
es: caracteres de ``a`` a ``z``
fr: caractères de ``a`` à ``z``

source: characters from ``#10`` to ``#13``
bg: символи от &quot;# 10&quot; до &quot;# 13&quot;
de: Zeichen von ``#10`` bis ``#13``
es: caracteres desde ``#10`` a ``#13``
fr: caractères de ``#10`` à `` # # 13``

source: Predefined Character Classes
bg: Предварително дефинирани класове символи
de: Vordefinierte Zeichenklassen
es: Clases de caracteres predefinidas
fr: Classes de personnage prédéfinies

source: There are a number of predefined character classes that keeps regular expressions more compact.
bg: Има редица предварително дефинирани класове от символи, които поддържат регулярните изрази по-компактни.
de: Es gibt eine Reihe vordefinierter Zeichenklassen, die es erlauben, reguläre Ausdrücke übersichtlich zu halten.
es: Hay una serie de clases de caracteres predefinidas que mantienen las expresiones regulares más compactas.
fr: Il existe un certain nombre de classes de caractères prédéfinies qui maintiennent les expressions régulières plus compactes.

source: an alphanumeric character (including ``_``)
bg: буквено-цифров знак (включително ``_``)
de: ein alphanumerisches Zeichen (einschließlich ``_``)
es: un carácter alfanumérico (incluido ``_``)
fr: un caractère alphanumérique (incluant ``_``)

source: a nonalphanumeric
bg: не-буквено число
de: ein nichtalphanumerisches Zeichen
es: un no alfanumérico
fr: un non-alphanumérique

source: a numeric character (same as ``[0123456789]``)
bg: цифров знак (същия като ``[0123456789]``)
de: ein numerisches Zeichen (dasselbe wie ``[0123456789]``)
es: un carácter numérico (igual que ``[0123456789]``)
fr: un caractère numérique (identique à ``[0123456789]``)

source: a non-numeric
bg: не-цифров
de: ein nichtnumerisches Zeichen
es: un no numérico
fr: un non numérique

source: any space (same as ``[ \t\n\r\f]``)
bg: всяко пространство (същото като `` [\ t
de: ein beliebiger Leerraum (dasselbe wie ``[ \t\n\r\f]``)
es: cualquier espacio (igual que ``[\t\n\r\f]``)
fr: N&#39;importe quel espace (identique à ``[\t\n\r\f]``)

source: a non space
bg: непространство
de: ein Zeichen, das keinen Leerraum ergibt
es: un no espacio
fr: un non espace

source: You may use ``\w``, ``\d`` and ``\s`` within `user character classes <User Character Classes_>`_.
bg: Можете да използвате `` `` `,` `` `и` `` `в рамките на` класовете за потребителски характер <User Character Classes_>`_.
es: Puedes usar ``\w``, `` \ d`` y ``\s`` dentro de `clases de caracteres de usuario <User Character Classes_>`_.
fr: Vous pouvez utiliser ``\w``, ``\d`` et ``\s`` dans `les classes de caractères de l&#39;utilisateur <User Character Classes_>`_.

source: ``foob1r``, ``foob6r`` and so on but not ``foobar``, ``foobbr`` and so on
bg: &quot;foob1r&quot;, &quot;foob6r&quot; и така нататък, но не и &quot;foobar&quot;, &quot;foobbr&quot; и т.н.
de: ``foob1r``, ``foob6r`` usw., aber nicht ``foobar``, ``foobbr`` usw.
es: ``foob1r``, ``foob6r`` y así sucesivamente, pero no ``foobar``, ``foobbr`` y así sucesivamente
fr: ``foob1r``, ``foob6r`` et ainsi de suite mais pas ``foobar``, ``foobbr`` et ainsi de suite

source: ``foob[\w\s]r``
bg: `` Foob [\ т \ S] r``

source: ``foobar``, ``foob r``, ``foobbr`` and so on but not ``foob1r``, ``foob=r`` and so on
bg: &quot;foobar&quot;, &quot;foob r&quot;, &quot;foobbr&quot; и т.н., но не и &quot;foob1r&quot;, &quot;foob = r&quot; и т.н.
de: ``foobar``,``foob r``, ``foobbr`` und so weiter, aber nicht``foob1r``, ``foob=r`` usw.
es: ``foobar``, `` foob r``, ``foobbr`` y así sucesivamente, pero no ``foob1r``, `` foob = r`` y así sucesivamente
fr: ``foobar``, ``foob r``, ``foobbr`` et ainsi de suite mais pas ``foob1r``, ``foob = r`` et ainsi de suite

source: Properties `SpaceChars <tregexpr.html#spacechars>`_ and `WordChars <tregexpr.html#wordchars>`_ define character classes ``\w``, ``\W``, ``\s``, ``\S``.
bg: Свойства `SpaceChars <tregexpr.html#spacechars>`_ и` WordChars <tregexpr.html#wordchars> определяте класовете символи &quot;w&quot;, &quot;W&quot;, &quot;s&quot;, &quot;s&quot;.
de: Die Zeichenklassen ``\w``, ``\W``, ``\s`` und ``\S`` sind in den Properties `SpaceChars <tregexpr.html#spacechars>`_ und `WordChars <tregexpr.html#wordchars>`_ definiert.
es: Propiedades `SpaceChars <tregexpr.html#spacechars>`_ y` WordChars <tregexpr.html#wordchars>`_ define las clases de caracteres` `\ w``,` `\ W``,``\s``, ``\S``.
fr: Propriétés `SpaceChars <tregexpr.html#spacechars>`_ et` WordChars <tregexpr.html#wordchars>`_ définit les classes de caractères` `\ w``,` `\ W``,``\s``, ``\S``.

source: So you can redefine this classes.
bg: Така че можете да предефинирате тези класове.
de: Sie können diese Zeichenklassen also auch neu definieren.
es: Así que puedes redefinir estas clases.
fr: Vous pouvez donc redéfinir ces classes.

source: Boundaries
bg: граници
de: Grenzen
es: Límites
fr: Limites

source: Line Boundaries
bg: Граници на линии
de: Zeilengrenzen
es: Límites de línea
fr: Limites de lignes

source: start of line
bg: начало на линията
de: Zeilenanfang
es: comienzo de linea
fr: début de ligne

source: end of line
bg: края на линията
de: Zeilenende
es: fin de la línea
fr: fin de ligne

source: start of text
bg: начало на текста
de: Beginn des Textes (Stringanfang)
es: comienzo del texto
fr: début du texte

source: end of text
bg: края на текста
de: Ende des Textes (Stringende)
es: fin del texto
fr: fin du texte

source: any character in line
bg: всеки знак в ред
de: ein beliebiges Zeichen (innerhalb derselben Zeile)
es: cualquier caracter en linea
fr: n&#39;importe quel caractère en ligne

source: ``foobar`` only if it's at the beginning of line
bg: &quot;foobar&quot; само ако е в началото на линията
de: ``foobar`` nur, wenn es am Anfang der Zeile steht
es: ``foobar`` solo si está al principio de la línea
fr: ``foobar`` seulement si c&#39;est en début de ligne

source: ``foobar`` only if it's at the end of line
bg: &quot;foobar&quot;, само ако е в края на реда
de: ``foobar`` nur wenn es am Zeilenende steht
es: ``foobar`` solo si está al final de la línea
fr: ``foobar`` seulement si c&#39;est en fin de ligne

source: ``foobar`` only if it's the only string in line
bg: ``foobar`` само ако е единственият низ в ред
de: ``foobar`` nur wenn davor und danach kein sonstiges Zeichen innerhalb der Zeile steht
es: ``foobar`` solo si es la única cadena en línea
fr: ``foobar`` seulement s&#39;il s&#39;agit de la seule chaîne en ligne

source: ``foobar``, ``foobbr``, ``foob1r`` and so on
bg: &quot;foobar&quot;, &quot;foobbr&quot;, &quot;foob1r&quot; и т.н.
de: ``foobar``, ``foobbr``, ``foob1r`` usw.
es: ``foobar``, ``foobbr``, ``foob1r`` y así sucesivamente
fr: ``foobar``, ``foobbr``, ``foob1r`` et ainsi de suite

source: ``^`` metacharacter by default match the beginning of the input string. ``$`` - the end.
bg: `` `` metacharacter по подразбиране съвпада с началото на входния низ. `` $ `` - краят.
de: Das Metazeichen ``^`` passt auf den Anfang ,``$`` auf das Ende der Zeichenkette.
es: ``^`` el metacarácter por defecto coincide con el principio de la cadena de entrada. ``$`` - el final.
fr: Le métacaractère ``^`` correspond par défaut au début de la chaîne d&#39;entrée. ``$`` - la fin.

source: You may, however, wish to treat a string as a multi-line text, so ``^`` will match after any line separator within the string, and ``$`` will match before any line separator. You can do this by switching `modifier /m <#m>`_.
bg: Може обаче да искате да третирате низ като многоредов текст, така че ``^`` ще съвпадне след всеки разделител на редове в низ и ``$`` ще съвпадне преди всеки разделител. Можете да направите това, като превключите `modifier /m <#m>`_.
de: Eventuell wollen Sie eine Zeichenfolge als mehrzeiligen Text behandeln, in dem ``^`` auch nach jedem internen Zeilenende und ``$`` vor jedem Zeilenende passt. Dieses Verhalten erhalten Sie mit dem Schalter `modifier / m <#m>`_ .
es: Sin embargo, es posible que desee tratar una cadena como un texto de varias líneas, por lo que ``^`` coincidirá después de cualquier separador de línea dentro de la cadena, y ``$`` coincidirá antes de cualquier separador de línea. Puede hacer esto cambiando `modifier / m <#m>`_.
fr: Cependant, vous pouvez souhaiter traiter une chaîne comme un texte sur plusieurs lignes. Par conséquent, ``^`` correspond après tout séparateur de ligne de la chaîne et `$ $` avant chaque séparateur de ligne. Vous pouvez le faire en changeant `modificateur / m <#m>`_.

source: Note that there is no empty line within the sequence ``\x0D\x0A``.
bg: Забележете, че няма празна линия в последователността &quot;x0D0A&quot;.
de: Beachten Sie, dass sich in der Sequenz ``\x0D\x0A`` keine leere Zeile befindet.
es: Tenga en cuenta que no hay una línea vacía dentro de la secuencia ``\x0D \ x0A``.
fr: Notez qu&#39;il n&#39;y a pas de ligne vide dans la séquence `` \ \ x0D \ x0A``.
