Repository: Alexey-T/TRegExpr
Catalog: docs/locale/*/LC_MESSAGES/regular_expressions.po
Languages: bg, de, es, fr

source: This can be especially handy because it has local scope in a regular expression. It affects only that part of regular expression that follows ``(?imsgxr-imsgxr)`` operator.
bg: Това може да бъде особено полезно, защото има локален обхват в редовен израз. Тя засяга само онази част от регулярния израз, която следва `` (? Imsgxr-imsgxr) `` оператора.
de: Das Praktische daran kann sein, dass die Änderung direkt im Regex nur lokalen Gültigkeitsbereich hat. Sie betrifft sogar nur denjenigen Anteil des regulären Ausdrucks, der auf den Operator ``(?imsgxr-imsgxr)`` folgt.
es: Esto puede ser especialmente útil porque tiene un alcance local en una expresión regular. Afecta solo a la parte de la expresión regular que sigue al operador `` ((imsgxr-imsgxr) ``.
fr: Cela peut être particulièrement utile car il a une portée locale dans une expression régulière. Cela affecte uniquement la partie de l&#39;expression régulière qui suit l&#39;opérateur `` (?? Imsgxr-imsgxr) ``.

source: And if it's inside subexpression it will affect only this subexpression - specifically the part of the subexpression that follows after the operator. So in ``((?i)Saint)-Petersburg`` it affects only subexpression ``((?i)Saint)`` so it will match ``saint-Petersburg`` but not ``saint-petersburg``.
bg: И ако това е вътре в под-експресията, то ще засегне само тази подекспресия - по-специално частта от подекспресията, която следва след оператора. Така в ``((?i)Saint)-Petersburg`` засяга само подекспресия ``((?i)Saint)`` така ще съвпадне ``saint-Petersburg``, но не ``saint-petersburg`` ,
de: Innerhalb eines Unterausdrucks gesetzt, wirkt sich der Operator nur innerhalb dessen aus, wiederum auch nur auf den Teil des Teilausdrucks, der auf den Operator folgt. In ``((?i)Saint)-Petersburg`` betrifft es nur den Teilausdruck ``((?i) Saint)``, so dass ``sankt-Petersburg``, aber nicht ``Sankt-petersburg`` passt .
es: Y si está dentro de la subexpresión, afectará solo a esta subexpresión, específicamente a la parte de la subexpresión que sigue después del operador. Así que en `` (((? I) Saint) -Petersburg`` afecta solo a la subexpresión `` ((??) Saint) `` por lo que coincidirá con `` saint-Petersburg`` pero no a ``saint-petersburg`` .
fr: Et si c&#39;est dans la sous-expression, cela n&#39;affectera que cette sous-expression - en particulier la partie de la sous-expression qui suit l&#39;opérateur. Donc, dans ``((?i)Saint)-Petersburg``, cela n&#39;affecte que la sous-expression ``((?i)Saint)``, donc cela correspond à `&#39;saint-Petersburg`` mais pas` `saint-petersburg`` .

source: ``Saint-petersburg`` and ``Saint-Petersburg``
bg: `` Saint-petersburg`` и `` Санкт Петербург``
de: `` Sankt-petersburg`` und `` Sankt-Petersburg``
es: `` San Petersburgo`` y `` San Petersburgo``
fr: «Saint-Pétersbourg» et «Saint-Pétersbourg»

source: ``(?i)Saint-(?-i)Petersburg``
bg: `` Свети (К) - (- и) Petersburg``
de: ``(?i)Sankt-(?-i)Petersburg``

source: ``Saint-Petersburg`` but not ``Saint-petersburg``
bg: &quot;Санкт Петербург&quot;, но не и &quot;Санкт-Петербург&quot;
de: ``Sankt Petersburg`` aber nicht ``Sankt petersburg``
es: `` San Petersburgo`` pero no `` San Petersburgo``
fr: `` Saint-Petersburg`` mais pas `` Saint-petersburg``

source: ``(?i)(Saint-)?Petersburg``
bg: `` (Saint -) (К)? Petersburg``
de: ``(?i)(Sankt-)?Petersburg``
es: `` (? i) (San -)? Petersburg``

source: ``Saint-petersburg`` and ``saint-petersburg``
bg: `` Saint-petersburg`` и ``saint-petersburg``
de: ``Sankt-petersburg`` und ``sankt-petersburg``
es: `` Saint-petersburg`` y ``saint-petersburg``
fr: `` Saint-petersburg`` et ``saint-petersburg``

source: ``((?i)Saint-)?Petersburg``
bg: `` (? (И) Saint -) Petersburg``?
de: ``((?i)Sankt-)?Petersburg``

source: ``saint-Petersburg``, but not ``saint-petersburg``
bg: `` Санкт Петербург``, но не ``saint-petersburg``
de: ``saint-Petersburg``, aber nicht ``saint-petersburg``
es: `` San Petersburgo``, pero no `` San Petersburgo``
fr: ``saint-Petersburg``, mais pas ``saint-petersburg``

source: (?#text)
bg: (?#текст)
es: (?#texto)
fr: (?#texte)

source: A comment, the text is ignored.
bg: Коментар, текстът се игнорира.
de: Ein Kommentar („Text“ wird ignoriert).
es: Un comentario, el texto se ignora.
fr: Un commentaire, le texte est ignoré.

source: Note that the comment is closed by the nearest ``)``, so there is no way to put a literal ``)`` in the comment.
bg: Забележете, че коментарът е затворен от най-близкия ``), така че няма начин да се сложи буквален ``) в коментара.
de: Beachten Sie, dass der Kommentar durch die nächstfolgende ``)`` geschlossen wird. Es gibt also keine Möglichkeit, eine schließende runde Klammer ``)`` in den Kommentar einzufügen.
es: Tenga en cuenta que el comentario está cerrado por el ``)`` más cercano, por lo que no hay manera de poner un ``)`` literal en el comentario.
fr: Notez que le commentaire est fermé par le ``)`` le plus proche, il n’ya donc aucun moyen de mettre un littéral ``)`` dans le commentaire.

source: Afterword
bg: послеслов
de: Nachwort
es: Epílogo
fr: Épilogue

source: In this `ancient blog post from previous century <https://masterandrey.com/posts/en/text_processing_from_birds_eye_view.html>`__ I illustrate some usages of regular expressions.
bg: В този „пост на стария блог от предишния век <https://masterandrey.com/posts/en/text_processing_from_birds_eye_view.html>`__ Илюстрирам някои употреби на регулярни изрази.

source: English
de: Englisch

source: `Deutsch <https://regex.sorokin.engineer/de/latest/regular_expressions.html>`__
de: Deutsch

source: Control Escape Sequence (``Ctrl-x``)
de: Kontrolltasten-Kombination (``Ctrl-x``)

source: For example, ``\ci`` matches the target sequence
de: Beispielsweise passt ``\ci`` auf die Zielsequenz

source: ``\x09``, because ``ctrl-i`` has the value ``0x09``
de: ``\x09``, weil ``ctrl-i`` dem Wert ``0x09`` entspricht

source: horizontal whitespace. the tab and all characters
de: Horizontaler Leerraum, d.h. ein Horizontaltabulator oder jedes Zeichen

source: in the "space separator" Unicode category.
de: in der Unicode-Kategorie "space separator".

source: not a horizontal whitespace
de: jedes Zeichen, das kein horizontaler Leerraum ist

source: vertical whitespace. all characters treated as
de: vertikaler Leerraum, jedes Zeichen, das

source: line breaks in the Unicode standard.
de: in die Unicode-Kategorie ``Trenner, Abstand (space separator)`` gehört.

source: not a vertical whitespace
de: jedes Zeichen, das *nicht* einen vertikalen Abstand liefert

source: Subexpressions
de: Unterausdrücke (subexpressions)
es: Subexpresiones
fr: Sous-expressions

source: subexpression
de: Unterausdruck
es: subexpresión
fr: sous-expression

source: Backreferences
de: Rückreferenzen
es: Referencias
fr: Références arrières

source: ``?:`` is used when you want to group an expression, but you do not want to save it as a matched/captured portion of the string.
de: ``?:`` wird genutzt, wenn man einen Ausdruck zwar gruppieren, aber keine Rückwärtsreferenz auf den passenden Textabschnitt speichern möchte.

source: So this is just a way to organize your regex into subexpressions without overhead of capturing result:
de: Auf diese Weise können Sie Ihren Regex in Unterausdrücke gliedern, ohne unnötig Speicherplatz und Verarbeitungszeit für die Ergebniserfassung zu verschwenden:

source: in ``https://sorokin.engineer`` matches ``https`` and ``sorokin.engineer``
de: ``https`` und ``sorokin.engineer`` in ``https://sorokin.engineer``

source: in ``https://sorokin.engineer`` matches only ``sorokin.engineer``
de: nur ``sorokin.engineer`` in ``https://sorokin.engineer``

source: ``(?i)Saint-Petersburg``
de: ``(?i)Sankt-Petersburg``
es: `` (? i) San Petersburgo``

source: In this `ancient blog post from previous century <https://sorokin.engineer/posts/en/text_processing_from_birds_eye_view.html>`__ I illustrate some usages of regular expressions.
de: In diesem `alten Blogeintrag aus dem vorigen Jahrhundert <https://sorokin.engineer/posts/en/text_processing_from_birds_eye_view.html>`__ erläutere ich einige Anwendungsfälle von regulären Ausdrücken.
es: En este `antiguo blog del siglo anterior. <https://sorokin.engineer/posts/en/text_processing_from_birds_eye_view.html>`__ ilustro algunos usos de expresiones regulares.
fr: Dans cet `ancien billet de blog du siècle précédent <https://sorokin.engineer/posts/en/text_processing_from_birds_eye_view.html>`__ J&#39;illustre quelques utilisations d&#39;expressions régulières.
