Repository: Alexey-T/TRegExpr
Catalog: docs/locale/*/LC_MESSAGES/regular_expressions.po
Languages: bg, de, es, fr

source: You can substitute them with `Substitute <tregexpr.html#substitute>`_.
bg: Можете да ги замените с &quot;Заместник&quot; <tregexpr.html#substitute>`_.
de: Sie können sie durch `Substitute <tregexpr.html#substitute>`_ ersetzen.
es: Puedes sustituirlos por `Sustituto <tregexpr.html#substitute>`_.
fr: Vous pouvez les remplacer par `Substitute <tregexpr.html#substitute>`_.

source: Subexpressions are numbered from left to right by their opening parenthesis (including nested subexpressions).
bg: Подекспресиите се номерират от ляво на дясно чрез тяхната отваряща скоба (включително вложени вдъхновения).
de: Unterausdrücke werden von links nach rechts durch ihre öffnenden Klammern nummeriert (einschließlich verschachtelter Unterausdrücke).
es: Las subexpresiones se numeran de izquierda a derecha por su paréntesis de apertura (incluidas las subexpresiones anidadas).
fr: Les sous-expressions sont numérotées de gauche à droite par leur parenthèse d&#39;ouverture (y compris les sous-expressions imbriquées).

source: First subexpression has number ``1``. Whole regular expression has number ``0``.
bg: Първата субекспресия има число &quot;1&quot;. Целият редовен израз има число &quot;0&quot;.
de: Der erste Unterausdruck hat die Nummer ``1``. Der gesamte reguläre Ausdruck hat die Nummer ``0``.
es: La primera subexpresión tiene el número ``1``. La expresión regular entera tiene el número ``0``.
fr: La première sous-expression a le numéro ``1``. L&#39;expression régulière entière a le numéro ``0``.

source: For example for input string ``foobar`` regular expression ``(foo(bar))`` will find:
bg: Например за входен низ ``foobar`` редовен израз ``(foo(bar)) `` ще намери:
de: Zum Beispiel wird für die Eingabezeichenfolge ``foobar`` der reguläre Ausdruck ``(foo(bar))`` folgendes finden:
es: Por ejemplo, para la cadena de entrada ``foobar`` la expresión regular ``(foo(bar))`` encontrará:
fr: Par exemple pour la chaîne d&#39;entrée ``foobar`` l&#39;expression régulière ``(foo(bar)) `` trouvera:

source: value
bg: стойност
de: Wert
es: valor
fr: valeur

source: Metacharacters ``\1`` through ``\9`` are interpreted as backreferences. ``\n`` matches previously matched subexpression ``n``.
bg: Метасимволите ``1`` до `` `` се тълкуват като обратни връзки. `` `` съвпада с предварително съвпадащата субекспресия ``n``.
de: Die Metazeichen ``\1`` bis ``\9`` werden als Rückreferenzen interpretiert. ``\n`` stimmt dabei mit dem vorher übereinstimmenden Unterausdruck ``n`` überein.
es: Los metacaracteres `` \ 1`` a través de `` \ 9`` se interpretan como referencias inversas. ``\n`` coincide con la subexpresión previamente coincidente ``n``.
fr: Les métacaractères `` \ 1`` à `` \ 9`` sont interprétés comme des références arrières. ``\n`` correspond à la sous-expression précédemment trouvée ``n``.

source: ``aaaa`` and ``cc``
bg: &quot;aaaa&quot; и &quot;cc&quot;
de: ``aaaa`` und ``cc``
es: ``aaaa`` y ``cc``
fr: ``aaaa`` et ``cc``

source: also ``abab`` and ``123123``
bg: също &quot;abab&quot; и &quot;123123&quot;
de: auch ``abab`` und ``123123``
es: también ``abab`` y ``123123``
fr: aussi ``abab`` et ``123123``

source: ``(['"]?)(\d+)\1`` matchs ``"13"`` (in double quotes), or ``'4'`` (in single quotes) or ``77`` (without quotes) etc
bg: &quot;(&quot; [? “)?) (d +) 1`` съответства на&quot; 13 &quot;(в двойни кавички), или&quot; 4 &quot;(в единични кавички) или&quot; 77 &quot; (без кавички) и т.н.
de: ``(['"]?)(\d+)\1`` passt auf ``"13"`` (in doppelten Anführungszeichen) genauso wie auch auf ``'4'`` (in einfachen Anführungszeichen) oder ``77`` (ohne Anführungszeichen) usw.
es: `` ([&#39;&quot;]?) (\ d +) \ 1`` coincide con` `&quot; 13 &quot;` `(entre comillas dobles), o` `&#39; 4&#39;`` (entre comillas simples) o` `77`` (sin comillas) etc
fr: `` ((&#39;&#39;]]?) (\ d +) \ 1`` correspond `` &quot;13&quot; `(entre guillemets doubles), ou` `&#39;&#39; 4&#39;`` (entre guillemets simples) ou` `77`` (sans guillemets) etc.

source: Modifiers
bg: Модификатори
de: Modifikatoren
es: Modificadores
fr: Modificateurs

source: Modifiers are for changing behaviour of regular expressions.
bg: Модификаторите са за промяна на поведението на регулярните изрази.
de: Modifikatoren gestatten eine Verhaltensänderung regulärer Ausdrücke.
es: Los modificadores son para cambiar el comportamiento de las expresiones regulares.
fr: Les modificateurs permettent de modifier le comportement des expressions régulières.

source: You can set modifiers globally in your system or change inside the the regular expression using the `(?imsxr-imsxr) <#inlinemodifiers>`_.
bg: Можете да зададете глобални модификатори във вашата система или да промените вътре в редовния израз, като използвате `(? Imsxr-imsxr) <#inlinemodifiers>`_.
de: Sie können Modifikatoren sowohl global in Ihrem System festlegen als auch das Verhalten eines regulären Ausdrucks quasi an Ort und Stelle mithilfe von `Inline-Modifikatoren <#inlinemodifiers>`_ ändern.
es: Puede configurar modificadores globalmente en su sistema o cambiar dentro de la expresión regular utilizando el `(? Imsxr-imsxr) <#inlinemodifiers>`_.
fr: Vous pouvez définir des modificateurs globalement dans votre système ou les modifier dans l&#39;expression régulière à l&#39;aide de `(? Imsxr-imsxr) <#inlinemodifiers>`_.

source: To change modifiers use `ModifierStr <tregexpr.html#modifierstr>`__ or appropriate ``TRegExpr`` properties `Modifier* <tregexpr.html#modifieri>`__.
bg: За да промените модификаторите, използвайте `ModifierStr <tregexpr.html#modifierstr>`__ или подходящи ``TRegExpr`` свойства` Модификатор * <tregexpr.html#modifieri>`__.
de: Um den Wert eines Modifikators festzulegen, verwenden Sie entweder `ModifierStr <tregexpr.html#modifierstr>`__ oder die entsprechende ``TRegExpr``-Eigenschaft namens `Modifier* <tregexpr.html#modifieri> __.
es: Para cambiar modificadores usa `ModifierStr <tregexpr.html#modifierstr>`__ o las propiedades ``TRegExpr`` apropiadas` Modificador * <tregexpr.html#modifieri>`__.
fr: Pour changer les modificateurs, utilisez `ModifierStr <tregexpr.html#modifierstr>`__ ou les propriétés ``TRegExpr``` appropriées` Modifier * <tregexpr.html#modifieri>`__.

source: The default values are defined in `global variables <tregexpr.html#global-constants>`_. For example global variable ``RegExprModifierX`` defines default value for ``ModifierX`` property.
bg: Стойностите по подразбиране са дефинирани в глобалните променливи <tregexpr.html#global-constants>`_. Например глобалната променлива `` RegExprModifierX`` определя стойността по подразбиране за `` ModifierX``.
de: Die Standardwerte sind in den `globalen Variablen <tregexpr.html#global-constants>`_ definiert. Beispielsweise legt die globale Variable `` RegExprModifierX`` den Standardwert für die ``ModifierX``-Eigenschaft fest.
es: Los valores por defecto se definen en `variables globales <tregexpr.html#global-constants>`_. Por ejemplo, la variable global `` RegExprModifierX`` define el valor predeterminado para la propiedad `` ModifierX``.
fr: Les valeurs par défaut sont définies dans `variables globales <tregexpr.html#global-constants>`_. Par exemple, la variable globale ``RegExprModifierX`` définit la valeur par défaut de la propriété ``ModifierX``.

source: i, case-insensitive
bg: i, без чувствителност
de: i: Groß- und Kleinschreibung ignorieren
es: yo, insensible a mayúsculas
fr: je, insensible à la casse

source: Case-insensitive. Use installed in you system locale settings, see also `InvertCase <tregexpr.html#invertcase>`__.
bg: Case-нечувствителен. Използвайте инсталирани във вашите системни локали настройки, вижте също `InvertCase <tregexpr.html#invertcase>`__.
de: Groß- und Kleinschreibung wird nicht berücksichtigt. Verwendet ansonsten die in Ihrem System eingestellten Spracheinstellungen, siehe auch `InvertCase <tregexpr.html#invertcase>`__.
es: Mayúsculas y minúsculas Use instalado en la configuración regional de su sistema, vea también `InvertCase <tregexpr.html#invertcase>`__.
fr: Insensible à la casse. Utilisez installé dans les paramètres régionaux de votre système, voir aussi `InvertCase <tregexpr.html#invertcase>`__.

source: m, multi-line strings
bg: м, многолинейни низове
de: m: mehrzeilige Zeichenketten
es: m, cuerdas multilínea
fr: m, chaînes multi-lignes

source: Treat string as multiple lines. So ``^`` and ``$`` matches the start or end of any line anywhere within the string.
bg: Третирайте низ като няколко реда. Така `` `` и ``$`` съвпадат с началото или края на всяка линия навсякъде в низ.
de: String zeilenweise als mehrzeiligen Text behandeln. ``^`` und ``$`` finden damit Anfang und Ende in jeder beliebigen Zeile innerhalb des Strings.
es: Trate la cuerda como líneas múltiples. Entonces ``^`` y ``$`` coinciden con el inicio o final de cualquier línea en cualquier lugar dentro de la cadena.
fr: Traiter la chaîne comme plusieurs lignes. Donc `` `` `et``$`` correspondent au début ou à la fin de n&#39;importe quelle ligne n&#39;importe où dans la chaîne.

source: See also `Line Boundaries <#lineseparators>`__.
bg: Вижте също `Линии на границите <#lineseparators>`__.
de: Siehe auch `Zeilengrenzen <#lineseparators>`__.
es: Vea también `Límites de línea <#lineseparators>`__.
fr: Voir aussi `Limites de ligne <#lineseparators>`__.

source: s, single line strings
bg: s, единични низове
de: s: einzeilige Zeichenfolgen
es: s, cuerdas de una sola línea
fr: s, chaînes simples

source: Treat string as single line. So ``.`` matches any character whatsoever, even a line separators.
bg: Третирайте низ като един ред. Така `` `` съответства на какъвто и да е знак, дори и на линейни разделители.
de: Gesamte Zeichenfolge als einzelne Zeile behandeln. ``.`` passt dann auf *jedes* beliebige Zeichen, insbesondere auch auf Zeilenwechsel.
es: Trate la cuerda como una sola línea Entonces ``.`` coincide con cualquier carácter, incluso con separadores de línea.
fr: Traiter la chaîne comme une seule ligne. Donc ``.`` correspond à n&#39;importe quel caractère, même à un séparateur de ligne.

source: See also `Line Boundaries <#lineseparators>`__, which it normally would not match.
bg: Вижте също `Линии на границите <#lineseparators>`__, които нормално не биха съответствали.
de: Siehe auch `Zeilengrenzen <#lineseparators>`__, die normalerweise nicht gefunden würden.
es: Vea también `Line Boundaries <#lineseparators>`__, que normalmente no coincidiría.
fr: Voir aussi `Limites de ligne <#lineseparators>`__, auquel elle ne correspond normalement pas.

source: g, greediness
bg: g, алчност
de: g: Gierigkeit
es: g, codicia
fr: g, la gourmandise

source: `TRegExpr <tregexpr.html>`__ only modifier.
bg: `TRegExpr <tregexpr.html>`__ само модификатор.
de: In `TRegExpr <tregexpr.html>`__ nur als Modifikator verfügbar.
es: `TRegExpr <tregexpr.html>`__ solo modificador.
fr: `TRegExpr <tregexpr.html>`__ seul modificateur.

source: Switching it ``Off`` you’ll switch `quantifiers <#iterator>`__ into `non-greedy <#greedy>`__ mode.
bg: Превключването му ``Off`` ще превключи `quantifiers <#iterator>`__ в `не-алчен <#gred&gt;&gt; __ режим.
de: Wenn Sie auf ``Off`` umschalten, bringen Sie alle `Quantifier <#iterator>`__ vom gierigen (greedy) in den ``trägen (non-greedy)<#greedy>`__-Modus.
es: Si lo desactiva ``Off`` cambiará los `cuantificadores <#iterator>`__ al `no codicioso <#greedy>`__ mode.
fr: En le sélectionnant ``Off``, vous basculerez les quantificateurs <#iterator>`__ en mode` non glouton <#greedy>`__.

source: So, if modifier ``/g`` is ``Off`` then ``+`` works as ``+?``, ``*`` as ``*?`` and so on.
bg: Така че, ако модификаторът ``/g`` е ``Off``, тогава ``+`` работи като `` +?
de: Wenn also der Modifikator ``/g`` ``Off`` ist, funktioniert ``+`` als ``+?``, ``*`` als ``*?`` und so weiter.
es: Entonces, si el modificador ``/g`` es ``Off`` entonces ``+`` funciona como ``+?``, ``*`` Como ``*?`` Y así sucesivamente.
fr: Donc, si le modificateur «/ g» est «désactivé», alors «+» fonctionne comme «+?», «*» Comme «*?» Et ainsi de suite.

source: By default this modifier is ``On``.
bg: По подразбиране този модификатор е ``On``.
de: Standardmäßig ist dieser Modifikator ``On``.
es: Por defecto este modificador es ``On``.
fr: Par défaut, ce modificateur est ``On``.

source: x, eXtended syntax
bg: x, разширен синтаксис
de: x: erweiterte Syntax
es: x, sintaxis extendida
fr: x, syntaxe eXtended

source: Allows to comment regular expression and break them up into multiple lines.
bg: Позволява да коментирате нормален израз и да ги разделяте на няколко реда.
de: Ermöglicht den regulären Ausdruck zu kommentieren und in mehrere Zeilen aufzuteilen.
es: Permite comentar expresiones regulares y dividirlas en múltiples líneas.
fr: Permet de commenter une expression régulière et de la diviser en plusieurs lignes.

source: If the modifier is ``On`` we ignore all whitespaces that is neither backslashed nor within a character class.
bg: Ако модификаторът е `` On``, игнорираме всички бели пространства, които не са нито обратни, нито в рамките на клас знаци.
de: Wenn dieser Modifikator ``On`` ist, ignorieren wir alle Leerräume, sofern sie weder maskiert noch innerhalb einer Zeichenklasse stehen.
es: Si el modificador es `` On``, ignoramos todos los espacios en blanco que no estén recortados ni dentro de una clase de caracteres.
fr: Si le modificateur est `` On``, nous ignorons tous les espaces qui ne sont ni antislash ni dans une classe de caractères.

source: And the ``#`` character separates comments.
bg: А символът ``#`` отделя коментарите.
de: Und das Zeichen `` #`` trennt Kommentare ab.
es: Y el carácter ``#`` separa los comentarios.
fr: Et le caractère ``#`` sépare les commentaires.

source: Notice that you can use empty lines to format regular expression for better readability:
bg: Забележете, че можете да използвате празни редове за форматиране на регулярния израз за по-добра четливост:
de: Eine mehrzeilige Darstellung macht übrigens reguläre Ausdrücke oft besser lesbar:
es: Observe que puede usar líneas vacías para formatear expresiones regulares para una mejor legibilidad:
fr: Notez que vous pouvez utiliser des lignes vides pour mettre en forme une expression régulière pour une meilleure lisibilité:

source: ( (abc) # comment 1 # (efg) # comment 2 )
bg: ((abc) # коментар 1 # (efg) # коментар 2)
de: ( (abc) # Kommentar 1 # (efg) # Kommentar 2 )
es: ((abc) # comentario 1 # (efg) # comentario 2)

source: This also means that if you want real whitespace or ``#`` characters in the pattern (outside a character class, where they are unaffected by ``/x``), you’ll either have to escape them or encode them using octal or hex escapes.
bg: Това също така означава, че ако искате реални пробели или ``#`` символи в шаблона (извън клас знаци, където те не са засегнати от `` / x``), или ще трябва да ги избягвате или да ги кодирате с помощта на осмична или шестнадесетична бягства.
de: Dies bedeutet auch: wenn Sie literale Whitespace- oder ``#`` Zeichen in dem Muster (außerhalb einer Zeichenklasse, wo sie nicht von ``/x`` betroffen sind) angeben möchten, müssen Sie diese entweder maskieren oder als Oktal- oder Hex-Codes schreiben.
es: Esto también significa que si desea que haya espacios en blanco reales o caracteres ``#`` en el patrón (fuera de una clase de caracteres, donde no estén afectados por ``/x``), tendrá que escapar de ellos o codificarlos usando Escape octal o hexadecimal.
fr: Cela signifie également que si vous voulez de vrais espaces ou des caractères `#` `dans le motif (en dehors d&#39;une classe de caractères, où ils ne sont pas affectés par` `/ x``), vous devrez soit les échapper soit les encoder en utilisant échappées octales ou hexagonales.

source: r, Russian ranges
bg: r, руски диапазони
de: r: russische Zeichenbereiche
es: r, gamas rusas
fr: r, gammes russes

source: In Russian ASCII table characters ``ё``/``Ё`` are placed separately from others.
bg: В руската ASCII таблица символите `` `` `` `` `` се поставят отделно от другите.
de: In der russischen ASCII-Tabelle sind die Zeichen ``ё`` / ``Ё`` separat untergebracht.
es: En la tabla rusa de ASCII, los caracteres ``ё`` / ``Ё`` se colocan separados de los demás.
fr: En russe, les caractères de la table ASCII `` `` / ``Ё`` sont placés séparément des autres.

source: Big and small Russian characters are in separated ranges, this is the same as with English characters but nevertheless I wanted some short form.
bg: Големи и малки руски символи са в отделни диапазони, това е същото като с английски символи, но въпреки това исках някаква кратка форма.
de: Die übrigen großen und kleinen russische Schriftzeichen liegen jeweils in getrennten Bereichen, analog wie bei den englischen. Ich wollte eine praktische Kurzform.
es: Los caracteres rusos grandes y pequeños están en rangos separados, esto es lo mismo que con los caracteres en inglés pero, sin embargo, quería un poco de forma corta.
fr: Grands et petits caractères russes sont dans des plages séparées, c&#39;est la même chose que pour les caractères anglais mais néanmoins je voulais une forme abrégée.

source: With this modifier instead of ``[а-яА-ЯёЁ]`` you can write ``[а-Я]`` if you need all Russian characters.
bg: С този модификатор вместо `` [а-яА-Яо &#39;] `` можете да напишете `` [а-Я] `` ако имате нужда от всички руски символи.
de: Mit diesem Modifikator können Sie also statt ``[а-яА-ЯёЁ]`` einfach ``[а-Я]`` schreiben, wenn Sie sämtliche russischen Zeichen benötigen.
es: Con este modificador en lugar de ``[а-яА-ЯёЁ]`` puede escribir ``[а-Я]`` si necesita todos los caracteres rusos.
fr: Avec ce modificateur à la place de ``[а-яА-ЯёЁ]`` `vous pouvez écrire` `[а-`] `` si vous avez besoin de tous les caractères russes.

source: When the modifier is ``On``:
bg: Когато модификаторът е `` On``:
de: Wenn dieser Modifikator ``On`` ist:
es: Cuando el modificador es `` On``:
fr: Lorsque le modificateur est `` On``:

source: chars from ``а`` to ``я`` and ``ё``
bg: символи от ``а`` до ``я`` и `` ```
de: Kleinbuchstaben, von ``а`` bis ``я`` sowie ``ё``
es: caracteres de ``а`` a ``я`` y ``ё``
fr: caractères de ``а`` à ``я`` et `` ``

source: chars from ``А`` to ``Я`` and ``Ё``
bg: символи от ``А`` до ``Я`` и ``Ё``
de: Großbuchstaben, von ``A`` bis ``Я`` sowie ``Ё``
es: caracteres de ``А`` a ``Я`` y ``Ё``
fr: caractères de ``А`` à ``Я`` et `` ``

source: all russian symbols
bg: всички руски символи
de: Sämtliche russischen Schriftzeichen
es: todos los simbolos rusos
fr: tous les symboles russes

source: The modifier is set `On` by default.
bg: Модификаторът е зададен по подразбиране &quot;On&quot;.
de: Dieser Modifikator ist standardmäßig ``Ein``.
es: El modificador se establece `On` por defecto.
fr: Le modificateur est défini par défaut sur `On`.

source: Extensions
bg: Разширения
de: Erweiterungen
es: Extensiones
fr: Les extensions

source: ``Look ahead`` assertion. It checks input for the regular expression ``<look-ahead>``, but do not capture it.
bg: Твърдението &quot;Погледнете напред&quot;. Той проверява входа за регулярния израз `` <look-ahead>``, но не го улавяйте.
de: Eine ``Vorauschauannahme (look-ahead assertion)`` prüft auf ein nachfolgendes Vorkommen des Ausdrucks ``<look-ahead>``, aber erfasst diese nicht mit.
es: &quot;Mirar hacia adelante&quot;. Afirmación. Comprueba la entrada para la expresión regular `` <look-ahead>``, pero no lo captura.
fr: Affirmation de `` regarder devant``. Il vérifie l&#39;entrée pour l&#39;expression régulière `` <look-ahead>``, mais ne le capturez pas.

source: Look-ahead is not implemented in TRegExpr.
bg: Поглед напред не се прилага в TRegExpr.
de: Look-Ahead ist in TRegExpr nicht implementiert.
es: Look-ahead no está implementado en TRegExpr.
fr: Look-ahead n&#39;est pas implémenté dans TRegExpr.

source: In many cases you can replace ``look ahead`` with `Sub-expression <#subexpression>`_ and just ignore what will be captured in this subexpression.
bg: В много случаи можете да замените `` look ahead`` с `Sub-expression <#subexpression>` и просто да игнорирате това, което ще бъде уловено в тази подекспресия.
de: In vielen Fällen können Sie ``look ahead`` durch einen `Unterausdruck <#subexpression>`_ ersetzen und einfach ignorieren, was in diesem Unterausdruck erfasst wird.
es: En muchos casos, puede reemplazar ``look ahead`` con `Sub-expression <#subexpression>`_ y simplemente ignorar lo que se capturará en esta subexpresión.
fr: Dans de nombreux cas, vous pouvez remplacer ``look ahead`` par la sous-expression <#sousexpression>`_ et ignorer simplement ce qui sera capturé dans cette sous-expression.

source: For example ``(blah)(?=foobar)(blah)`` is the same as ``(blah)(foobar)(blah)``. But in the latter version you have to exclude the middle sub-expression manually - use ``Match[1] + Match[3]`` and ignore ``Match[2]``.
bg: Например &quot;(blah) (? = Foobar) (blah)` `е същото като` (blah) (foobar) (blah) ``. Но в последната версия трябва да изключите средния под-израз ръчно - използвайте `` Match [1] + Match [3] `` и игнорирайте `` Match [2] ``.
de: Zum Beispiel arbeitet ``(blah) (? = foobar) (blah)`` prinzipiell genauso wie ``(blah) (foobar) (blah)``. In der letzteren Variante müssen Sie lediglich den mittleren Unterausdruck ausschließen - verwenden Sie also den Ausdruck ``Match [1] + Match [3]`` und ignorieren Sie ``Match[2]``.
es: Por ejemplo, `` (bla) (? = Foobar) (bla) `` es lo mismo que `` (bla) (foobar) (bla) ``. Pero en la última versión tienes que excluir la sub-expresión del medio manualmente - usa `` Match [1] + Match [3] `` e ignora ``Match[2]``.
fr: Par exemple, `(blah) (? = Foobar) (blah)` `est identique à` `(blah) (foobar) (blah)` `. Mais dans cette dernière version, vous devez exclure manuellement la sous-expression du milieu - utilisez `` Match [1] + Match [3] `` et ignorez ``Match[2]``.

source: This is just not so convenient as in the former version where you can use whole ``Match[0]`` because captured by ``look ahead`` part would not be included in the regular expression match.
bg: Това не е толкова удобно, колкото в предишната версия, където можете да използвате цялото ``Match[0]``, защото заловената от `` поглед напред`` част няма да бъде включена в съвпадение на регулярния израз.
de: Dies ist lediglich ein bisschen unpraktischer als in einer look-ahead-Version, in welcher Sie den gesamten ``Match[0]`` verwenden könnten, weil der vom ``look ahead`` erfasste Teil zwar gesucht, aber nicht in das Ergebnis mit einbezogen würde.
es: Esto simplemente no es tan conveniente como en la versión anterior, en la que puede usar ``Match[0]`` completo porque la parte capturada por ``look ahead`` no se incluiría en la coincidencia de expresiones regulares.
fr: Ce n’est tout simplement pas aussi pratique que dans la version précédente où vous pouvez utiliser tout le mot «Match [0]» car la capture de la partie «look ahead» ne serait pas incluse dans la correspondance de l’expression régulière.

source: You may use it inside regular expression for modifying modifiers by the fly.
bg: Можете да го използвате в нормален израз за модифициране на модификаторите от муха.
de: Damit kann man innerhalb von regulären Ausdrücken Modifikatoren „im Handumdrehen“ ändern.
es: Puede usarlo dentro de expresiones regulares para modificar modificadores por el momento.
fr: Vous pouvez l’utiliser dans une expression régulière pour modifier les modificateurs à la volée.
