Repository: Alexey-T/TRegExpr
Catalog: docs/locale/*/LC_MESSAGES/regular_expressions.po
Languages: bg, de, es, fr

source: If you are using `Unicode version <tregexpr.html#unicode>`__, then ``^``/``$`` also matches ``\x2028``, ``\x2029``, ``\x0B``, ``\x0C`` or ``\x85``.
bg: Ако използвате `Unicode версия <tregexpr.html#unicode>`__, след това` `` `` `` `` `` `също съвпада` `2028``,` `2029``,` `0B``,` `0C`` или` ` `.
de: Wenn Sie die `Unicode-Version <tregexpr.html#unicode>`__ verwenden, dann stimmen ``^``/``$`` auch mit ``\x2028``, ``\x2029``, ``\x0B``, ``\x0C`` or ``\x85`` überein.
es: Si está utilizando la versión `Unicode <tregexpr.html#unicode>`__, entonces ``^``/``$`` también coincide con` `\ x2028``,` `\ x2029``,` `\ x0B``,` `\ x0C`` o ``\x85``.
fr: Si vous utilisez la version Unicode <tregexpr.html#unicode>`__, alors` `^` `/``$`` correspond également à` `\ x2028``,` `\ x2029``,` `\ x0B``,` `\ x0C`` ou ``\x85``.

source: The ``\A`` and ``\Z`` are just like ``^`` and ``$``, except that they won’t match multiple times when the `modifier /m <#m>`_ is used.
bg: `` `` И `` `` са точно като `` `` `и` `` `, с изключение на това, че те няма да отговарят на няколко пъти, когато` модификаторът / m <#m>`_ се използва.
de: Die Anker ``\A`` und ``\Z`` funktionieren genau wie ``^`` and ``$``, außer dass sie auch dann nicht mehrmals übereinstimmen, wenn die Option`modifier /m <#m>`_ eingeschaltet ist.
es: `` \ A`` y `` \ Z`` son como ``^`` y ``$``, excepto que no coincidirán varias veces cuando el `modificador / m <#m>`_ se utiliza
fr: Le `` \ A`` et le `` \ Z`` sont juste comme ``^`` et ``$``, sauf qu&#39;ils ne correspondront pas plusieurs fois quand le modificateur / m <#m>`_ est utilisé.

source: The ``.`` metacharacter by default matches any character, but if you switch ``Off`` the `modifier /s <#s>`_, then ``.`` won’t match line separators inside the string.
bg: Метасимволът &quot;.` `По подразбиране съвпада с всеки символ, но ако включите` `Off`` на` modifier / s <#s&gt; `_, то` `` `няма да съвпада с разделителните линии в низ.
de: Das Metazeichen ``.`` passt von Haus aus auf jedes Zeichen, solange jedoch der Schalter `Modifier / s <#s>`_ ``Off`` ist, dann mit Ausnahme von Zeilentrennzeichen.
es: El metacarácter `` .`` por defecto coincide con cualquier carácter, pero si cambia ``Off`` el `modificador / s <#s>`_, entonces `` .`` no coincidirá con los separadores de línea dentro de la cadena.
fr: Le métacaractère `` .`` correspond par défaut à n&#39;importe quel caractère, mais si vous basculez ``Off`` le modificateur / s <#s>`_, alors` `.`` ne correspondra pas aux séparateurs de ligne à l&#39;intérieur de la chaîne.

source: Note that ``^.*$`` does not match a string between ``\x0D\x0A``, because this is unbreakable line separator. But it matches the empty string within the sequence ``\x0A\x0D`` because this is just wrong order to be treated as line separator.
bg: Обърнете внимание, че &quot;^. * $` `Не съвпада с низа между&quot; x0D0A &quot;, защото това е нечуплив разделител на линии. Но той съвпада с празния низ в последователността &quot;x0A x0D&quot;, защото това е просто грешен ред, за да бъде третиран като разделител на линии.
de: Beachten Sie, dass ``^.*$`` nicht auf eine Zeichenfolge inmitten von ``\x0D\x0A`` (CRLF) passt, denn die CRLF-Sequenz gilt als untrennbare Zeilenschaltung. Er passt hingegen auf die leeren Zeichenfolge in der Sequenz ``\x0A\x0D``, weil dies einfach die falsche Reihenfolge ist, um als Zeilenschaltung interpretiert zu werden.
es: Tenga en cuenta que ``^.*$`` No coincide con una cadena entre ``\x0D \ x0A``, porque este es un separador de línea irrompible. Pero coincide con la cadena vacía dentro de la secuencia ``\x0A\x0D`` porque esto es simplemente un orden incorrecto para ser tratado como separador de línea.
fr: Notez que ``^.*$`` Ne correspond pas à une chaîne entre ``\x0D \ x0A``, car il s&#39;agit d&#39;un séparateur de ligne incassable. Mais cela correspond à la chaîne vide de la séquence `` \ \ x0A \ x0D`` car il s’agit d’un ordre erroné à traiter comme séparateur de ligne.

source: Multiline processing can be tuned with of properties `LineSeparators <tregexpr.html#lineseparators>`__ and `LinePairedSeparator <tregexpr.html#linepairedseparator>`_.
bg: Многолинейната обработка може да бъде настроена с свойства `LineSeparators <tregexpr.html#lineseparators>`__ и` LinePairedSeparator <tregexpr.html#linepairedseparator>`_.
de: Feinheiten der mehrzeiligen Verarbeitung können mit den Eigenschaften `LineSeparators <tregexpr.html#lineseparators>`__ und `LinePairedSeparator <tregexpr.html#linepairedseparator>`_ justiert werden.
es: El procesamiento multilínea se puede ajustar con las propiedades `LineSeparators <tregexpr.html#lineseparators>`__ y` LinePairedSeparator <tregexpr.html#linepairedseparator>`_.
fr: Le traitement multiligne peut être adapté avec les propriétés `LineSeparators <tregexpr.html#lineseparators>`__ et` LinePairedSeparator <tregexpr.html#linepairedseparator>`_.

source: So you can use Unix style separators ``\n`` or DOS/Windows style ``\r\n`` or mix them together (as in described above default behaviour).
bg: Така че можете да използвате разделители за стилове на Unix ``n`` или DOS / Windows стил `` r`` или да ги смесвате заедно (както е описано по-горе по подразбиране).
de: Sie können also Zeilenschaltungen im Unix-Stil ``\n`` oder im DOS/Windows-Stil ``\r\n`` verwenden oder beides (Standardverhalten wie oben beschrieben).
es: Por lo tanto, puede usar los separadores de estilo Unix ``\n`` o el estilo DOS / Windows ``\r\n`` o mezclarlos (como se describe anteriormente en el comportamiento predeterminado).
fr: Vous pouvez donc utiliser les séparateurs de style Unix ``\n`` ou le style DOS / Windows ``\r\n`` ou les mélanger (comme décrit dans le comportement par défaut ci-dessus).

source: If you prefer mathematically correct description you can find it on `www.unicode.org <http://www.unicode.org/unicode/reports/tr18/>`__.
bg: Ако предпочитате математически правилно описание, можете да го намерите на адрес: www.unicode.org <http://www.unicode.org/unicode/reports/tr18/>`__.
de: Wenn Sie eine mathematisch korrekte Beschreibung bevorzugen, können Sie sie unter www.unicode.org finden <http://www.unicode.org/unicode/reports/tr18/>__.
es: Si prefiere una descripción matemáticamente correcta, puede encontrarla en `www.unicode.org <http://www.unicode.org/unicode/reports/tr18/>`__.
fr: Si vous préférez une description mathématiquement correcte, vous pouvez la trouver sur `www.unicode.org <http://www.unicode.org/unicode/reports/tr18/>`__.

source: Word Boundaries
bg: Граници на думи
de: Wortgrenzen (Ankerpunkte)
es: Límites de palabras
fr: Limites des mots

source: a word boundary
bg: граница на думата
de: eine Wortgrenze
es: un límite de palabra
fr: une limite de mot

source: a non-word boundary
bg: граница без думи
de: keine Wortgrenze (Ankerpunkt, der entweder beidseits von \w oder \W umgeben ist)
es: un límite sin palabra
fr: une limite de non-mot

source: A word boundary ``\b`` is a spot between two characters that has a ``\w`` on one side of it and a ``\W`` on the other side of it (in either order).
bg: Думата граница &quot;b&quot; е място между два знака, което има `` `` `от едната страна на него и` `` `` от другата страна (в който и да е ред).
de: Eine Wortgrenze ``\b`` ist eine Stelle zwischen zwei Zeichen, von denen eines ``\w`` und das andere ein ``\W`` ist (Reihenfolge egal).
es: Un límite de palabra ``\b`` es un punto entre dos caracteres que tiene un ``\w`` en un lado y un `` \ W` en el otro lado (en cualquier orden).
fr: Une limite de mots ``\b`` est un espace entre deux caractères qui ont un `` w w`` d&#39;un côté et un ``\W`` de l&#39;autre côté (dans l&#39;un ou l&#39;autre ordre).

source: Quantification
bg: количествено определяне
de: Quantifizierung
es: Cuantificación

source: Quantifier
bg: квантор
de: Quantifizierer
es: Cuantificador
fr: Quantificateur

source: Any item of a regular expression may be followed by quantifier. Quantifier specifies number of repetition of the item.
bg: Всеки елемент от регулярен израз може да бъде последван от квантор. Quantifier определя броя на повторенията на елемента.
de: Auf jedes Element eines regulären Ausdrucks kann ein Quantifizierer folgen. Dieser gibt die Anzahl der Wiederholungen des Elements an.
es: Cualquier elemento de una expresión regular puede ser seguido por un cuantificador. El cuantificador especifica el número de repetición del artículo.
fr: Tout élément d&#39;une expression régulière peut être suivi d&#39;un quantificateur. Le quantificateur spécifie le nombre de répétitions de l&#39;article.

source: exactly ``n`` times
bg: точно ``n`` пъти
de: genau ``n`` mal
es: exactamente ``n`` veces
fr: exactement ``n`` fois

source: ``{n,}``
bg: `` {П} ``

source: at least ``n`` times
bg: поне ``n`` пъти
de: mindestens ``n`` mal
es: al menos ``n`` veces
fr: au moins ``n`` fois

source: ``{n,m}``
bg: `` {П, т} ``

source: at least ``n`` but not more than ``m`` times
bg: най-малко ``n``, но не повече от ``m`` пъти
de: zumindest &quot;n&quot; aber nicht mehr als &quot;m&quot; mal
es: al menos ``n`` pero no más de ``m`` veces
fr: au moins ``n`` mais pas plus de ``m`` fois

source: zero or more, similar to ``{0,}``
bg: нула или повече, подобно на `` {0,} ``
de: nicht bis beliebig oft vorkommend, alternative Notation: ``{0,}``
es: cero o más, similar a ``{0,}``
fr: zéro ou plus, semblable à ``{0,}``

source: one or more, similar to ``{1,}``
bg: една или повече, подобни на ``{1,}``
de: mindestens einmal vorkommend, alternative Notation: ``{1,}``
es: uno o más, similar a ``{1,}``
fr: un ou plusieurs, similaire à ``{1,}``

source: zero or one, similar to ``{0,1}``
bg: нула или едно, подобно на ``{0,1}``
de: höchstens einmal vorkommend, alternative Notation: ``{0,1}``
es: cero o uno, similar a ``{0,1}``
fr: zéro ou un, similaire à ``{0,1}``

source: So, digits in curly brackets ``{n,m}``, specify the minimum number of times to match ``n`` and the maximum ``m``.
bg: Така, цифрите в къдрави скоби `` {n, m} ``, определят минималния брой пъти, за да съответстват ``n`` и максималния ``m``.
de: Innerhalb der geschweiften Klammern ``{n, m}`` geben Sie also die Mindest-( ``n`` ) und Höchstanzahl ( ``m`` ) für das Vorkommen des voranstehenden Elements an.
es: Entonces, los dígitos entre paréntesis `` {n, m} ``, especifique el número mínimo de veces para que coincida con ``n`` y el máximo ``m``.
fr: Ainsi, les chiffres entre accolades `` {n, m} ``, spécifient le nombre minimum de fois où correspondre ``n`` et le maximum ``m``.

source: The ``{n}`` is equivalent to ``{n,n}`` and matches exactly ``n`` times.
bg: `` {N} `` е еквивалентно на `` {n, n} `` и отговаря точно на ``n`` пъти.
de: Die Kurzform ``{n}`` entspricht ``{n, n}`` und stimmt mit genau ``n`` Vorkommen überein.
es: El `` {n} `` es equivalente a `` {n, n} `` y coincide exactamente con los tiempos ``n``.
fr: Le `` {n} `` est équivalent à `` {n, n} `` et correspond exactement ``n`` fois.

source: The ``{n,}`` matches ``n`` or more times.
bg: `` {N,} `` съвпада с ``n`` или повече пъти.
de: Das ``{n,}`` entspricht „mindestens ``n`` Mal“.
es: El `` {n,} `` coincide con ``n`` o más veces.
fr: Le `` {n,} `` correspond à ``n`` ou plusieurs fois.

source: There is no limit to the size of ``n`` or ``m``.
bg: Няма ограничение за размера на „n“ или „m“.
de: Es gibt keine Obergrenze für ``n`` oder ``m``.
es: No hay límite para el tamaño de ``n`` o ``m``.
fr: Il n&#39;y a pas de limite à la taille de ``n`` ou ``m``.

source: If a curly bracket occurs in any other context, it is treated as a regular character.
bg: Ако фигурна скоба се появява във всеки друг контекст, тя се третира като редовен символ.
de: Wenn eine geschweifte Klammer in einem anderen Kontext auftritt, wird sie als normales Zeichen behandelt.
es: Si aparece un corchete en cualquier otro contexto, se trata como un carácter regular.
fr: Si une accolade apparaît dans un autre contexte, elle est traitée comme un caractère normal.

source: ``foobar``, ``foobalkjdflkj9r`` and ``foobr``
bg: &quot;foobar&quot;, &quot;foobalkjdflkj9r&quot; и &quot;foobr&quot;
de: ``foobar``, ``foobalkjdflkj9r`` und ``foobr``
es: ``foobar``, ``foobalkjdflkj9r`` y ``foobr``
fr: ``foobar``, ``foobalkjdflkj9r`` et ``foobr``

source: ``foobar``, ``foobalkjdflkj9r`` but not ``foobr``
bg: ``foobar``, ``foobalkjdflkj9r``, но не ``foobr``
de: ``foobar``, ``foobalkjdflkj9r``` aber nicht ``foobr``
es: ``foobar``, ``foobalkjdflkj9r`` pero no ``foobr``
fr: ``foobar``, ``foobalkjdflkj9r`` mais pas ``foobr``

source: ``foobar``, ``foobbr`` and ``foobr`` but not ``foobalkj9r``
bg: ``foobar``, ``foobbr`` и ``foobr``, но не `` foobalkj9r``
de: ``foobar``, ``foobbr`` und ``foobr``, aber nicht ``foobalkj9r``
es: ``foobar``, ``foobbr`` y ``foobr`` pero no ``foobalkj9r``
fr: ``foobar``, ``foobbr`` et ``foobr`` mais pas ``foobalkj9r``

source: ``foobaar'``, ``foobaaar``, ``foobaaaar`` etc.
bg: ``foobaar``, ``foobaaar``, ``foobaaaar`` и т.н.
de: ``foobaar``, ``foobaaar``, ``foobaaaar`` usw.
es: `` foobaar&#39;``, ``foobaaar``, ``foobaaaar`` etc.

source: ``foobaar``, or ``foobaaar`` but not ``foobaaaar``
bg: &quot;foobaar&quot;, или &quot;foobaaar&quot;, но не и &quot;foobaaaar&quot;
de: ``foobaar`` oder ``foobaaar``, aber nicht ``foobaaaar``
es: ``foobaar``, o ``foobaaar`` pero no ``foobaaaar``
fr: ``foobaar``, ou ``foobaaar`` mais pas ``foobaaaar``

source: ``8``, ``9`` or ``10`` instances of the ``foobar`` (``()`` is `Subexpression <#subexpression>`__)
bg: &quot;8&quot;, &quot;9&quot; или &quot;10&quot; случаи на &quot;foobar&quot; (``()`` е `Subexpression <#subexpression>`__)
de: ``8``, ``9`` oder ``10`` Vorkommen des Worts ``foobar`` (``()`` ist ein `Unterausdruck (subexpression) <#subexpression>`__)
es: Las instancias `` 8``, `` 9`` o `` 10`` de ``foobar`` (``()`` es `Subexpresión <#subexpression>`__)
fr: `` 8``, `` 9`` ou `` 10`` instances du ``foobar`` (``()`` est `la sous-expression <# expression_sous>`__)

source: Greediness
bg: лакомия
de: Gier (greediness)
es: Codicia
fr: Cupidité

source: `Quantifiers <#iterator>`_ in ``greedy`` mode takes as many as possible, in ``non-greedy`` mode - as few as possible.
bg: &quot;Quantifiers <#iterator>`_ в &quot;greedy&quot; режим отнема колкото е възможно повече, в &quot;не-алчен&quot; режим - възможно най-малко.
de: Im ``gierigen`` (greedy) Modus versuchen `Quantifizierer <#iterator>`_ so viele Übereinstimmungen wie möglich zu treffen, im ``trägen`` Modus so wenig wie möglich.
es: `Quantifiers <#iterator>`_ en el modo `` greedy`` toma la mayor cantidad posible, en el modo `` non-greedy`` - el menor número posible.
fr: `Quantificateurs <#iterator>`_ en mode `` greedy`` en prend autant que possible, en mode `` non-gourmand`` - aussi peu que possible.

source: By default all quantifiers are ``greedy``. Use ``?`` to make any quantifier ``non-greedy``.
bg: По подразбиране всички квантори са &quot;алчни&quot;. Използвайте ``?``, За да направите какъвто и да е квантификатор `` алчен``.
de: Standardmäßig verhalten sich alle Quantifizierer ``gierig``. Durch Anhängen eines Fragezeichens ``?`` kann man sie jedoch ``träge`` machen.
es: Por defecto, todos los cuantificadores son `` codiciosos``. Use ``?`` Para hacer cualquier cuantificador `` no-codicioso``.
fr: Par défaut, tous les quantificateurs sont `` greedy``. Utilisez ``?`` Pour créer n&#39;importe quel quantificateur `` non-gourmand``.

source: For string ``abbbbc``:
bg: За низ `` abbbbc``:
de: Für den String ``abbbbc``:
es: Para la cadena ``abbbbc``:
fr: Pour la chaîne ``abbbbc``:

source: ``b+``
bg: `` Б + ``

source: ``b+?``
bg: `` Б +? ``

source: ``b*?``
bg: `` В *? ``

source: empty string
bg: празен низ
de: leerer String
es: cuerda vacía
fr: chaîne vide

source: ``b{2,3}?``
bg: `` б {2,3}? ``

source: ``b{2,3}``
bg: `` Б {2,3} ``

source: You can switch all quantifiers into ``non-greedy`` mode (`modifier /g <#g>`_, below we use `in-line modifier change <#inlinemodifiers>`_).
bg: Можете да превключите всички квантори в `` неагресивен`` режим (`modifier / g <#g>`_, по-долу използваме `in-line модификатор <#inlinemodifiers>`_).
de: Alle Quantifizierer können Sie in den ``trägen`` (``non-greedy``) Modus umschalten (`modifier / g <#g>`_), im nachfolgenden Beispiel als `Inline-Modifikation <#inlinemodifiers>`_) gezeigt.
es: Puede cambiar todos los cuantificadores al modo `` no codicioso`` (`modifier / g <#g>`_, a continuación usamos `cambio de modificador en línea <#inlinemodifiers>`_).
fr: Vous pouvez basculer tous les quantificateurs en mode ``non-gourmand`` (`modificateur / g <#g>`_, nous utilisons ci-dessous `le modificateur en ligne &lt;et # du modificateur de ligne>`_).

source: ``(?-g)b+``
bg: `` (? -G) б + ``

source: The choice
bg: Избора
de: Alternative Ausdrücke
es: La elección
fr: Le choix

source: Expressions in the choice are separated by ``|``.
bg: Изрази в избора са разделени с ``|``.
de: Alternative Ausdrücke werden durch ``|`` getrennt.
es: Las expresiones en la elección están separadas por ``|``.
fr: Les expressions dans le choix sont séparées par ``|``.

source: So ``fee|fie|foe`` will match any of ``fee``, ``fie``, or ``foe`` in the target string (as would ``f(e|i|o)e``).
bg: Така че &quot;такса&quot; е в съответствие с &quot;такса&quot;, `` fie``, или `` foe`` в целевия низ (както би `` f (e | i | o) e) ``).
de: ``fee|fie|foe`` passt also zu einem ``fee``, ``fie`` oder ``foe`` in der Zielzeichenfolge (ebenso wie ``fee|fie|foe``).
es: Entonces `` fee | fie | foe`` coincidirá con cualquiera de ``fee``, ``fie``, o ``foe`` en la cadena objetivo (como lo haría `` f (e | i | o) e ``).
fr: Donc `` fee | fie | foe`` correspondra à l&#39;un des ``fee``, ``fie`` ou ``foe`` dans la chaîne cible (comme le ferait `` f (e | i | o) e ``).

source: The first expression includes everything from the last pattern delimiter (``(``, ``[``, or the beginning of the pattern) up to the first ``|``, and the last expression contains everything from the last ``|`` to the next pattern delimiter.
bg: Първият израз включва всичко - от последния разделител на шаблони (`` (``, ``[``, или началото на шаблона] до първия ``|``, а последният израз съдържа всичко от последното ``; `|` `към следващия разделител на шаблона.
de: Zum ersten Ausdruck zählt alles vom letzten Musterbegrenzer (``(``, ``[`` oder dem Anfang des Musters) bis vor das erste ``| ``, und der letzte Ausdruck umfasst alles nach dem letzten ``|`` zum nächsten Musterbegrenzer.
es: La primera expresión incluye todo desde el último delimitador de patrón (``(``, ``[``, o el comienzo del patrón) hasta el primer ``|``, y la última expresión contiene todo desde el último ``|`` al siguiente delimitador de patrón.
fr: La première expression inclut tout du dernier délimiteur de motif (`` (``, `` `` ``, ou le début du motif) jusqu&#39;au premier ``|``, et la dernière expression contient tout du dernier ``|`` vers le prochain délimiteur de motif.

source: Sounds a little complicated, so it’s common practice to include the choice in parentheses, to minimize confusion about where it starts and ends.
bg: Звучи малко сложно, така че е обичайна практика да се включва изборът в скоби, за да се сведе до минимум объркването за това къде започва и свършва.
de: Klingt etwas kompliziert, daher setzt man üblicherweise die Alternativausdrücke in Klammern, um damit ihren Anfang und das Ende deutlicher erkennbar zu machen.
es: Suena un poco complicado, por lo que es una práctica común incluir la elección entre paréntesis, para minimizar la confusión acerca de dónde comienza y dónde termina.
fr: Cela semble un peu compliqué, il est donc courant d&#39;inclure le choix entre parenthèses afin d&#39;éviter toute confusion quant au début et à la fin.

source: Expressions in the choice are tried from left to right, so the first expression that matches, is the one that is chosen.
bg: Изразът в избора се опитва от ляво на дясно, така че първият израз, който съвпада, е този, който е избран.
de: Die alternativen Ausdrücke werden von links nach rechts durchgetestet, und der erste passende wird verwendet.
es: Las expresiones en la elección se prueban de izquierda a derecha, por lo que la primera expresión que coincide es la elegida.
fr: Les expressions dans le choix sont essayées de gauche à droite, ainsi la première expression qui correspond est celle qui est choisie.

source: For example, regular expression ``foo|foot`` in string ``barefoot`` will match ``foo``. Just a first expression that matches.
bg: Например, редовен израз &quot;foo | foot&quot; в низа &quot;barefoot&quot; ще съответства на &quot;foo&quot;. Само първия израз, който съвпада.
de: Beispielsweise wird der reguläre Ausdruck ``foo|foot`` in der Zeichenfolge ``barefoot`` nur ``foo`` ergeben. Dies war nämlich die erste passende Alternative.
es: Por ejemplo, la expresión regular ``foo|foot`` en la cadena ``barefoot`` coincidirá con ``foo``. Sólo una primera expresión que coincide.
fr: Par exemple, l&#39;expression régulière `&#39;foo | foot`` dans la chaîne` `barefoot`` correspond à`&#39; foo``. Juste une première expression qui correspond.

source: Also remember that ``|`` is interpreted as a literal within square brackets, so if you write ``[fee|fie|foe]`` you’re really only matching ``[feio|]``.
bg: Също така не забравяйте, че ``|`` се интерпретира като буквален в квадратни скоби, така че ако напишете `` [такса | fie | foe] `` вие наистина съвпадате само `` [feio |] ``.
de: Denken Sie auch daran, dass ``|`` innerhalb eckiger Klammern als Literal interpretiert wird. Wenn Sie also ``[fee|fie|foe]`` schreiben, bedeutet das wirklich nur die Zeichenklasse ``[efio |]``.
es: También recuerda que ``|`` se interpreta como un literal entre corchetes, así que si escribes `` [fee | fie | foe] `` en realidad solo estás haciendo coincidir `` [feio |] ``.
fr: Rappelez-vous également que ``|`` est interprété comme un littéral entre crochets, donc si vous écrivez `[[fee | fie | foe]` `vous ne faites en fait que correspondre à` `[feio |]` `.

source: ``foo(bar|foo)``
bg: `` Foo (бар | Foo) ``

source: ``foobar`` or ``foofoo``
bg: &quot;foobar&quot; или &quot;foofoo&quot;
de: ``foobar`` oder ``foofoo``
es: ``foobar`` o ``foofoo``
fr: ``foobar`` ou ``foofoo``

source: The brackets ``( ... )`` may also be used to define regular expression subexpressions.
bg: В скоби `` (...) `` може да се използва и за дефиниране на подекспресии на регулярни изрази.
de: Die Klammern ``(...)`` können auch verwendet werden, um Unterausdrücke in einem regulären Ausdruck zu definieren.
es: Los corchetes `` (...) `` también se pueden usar para definir subexpresiones de expresiones regulares.
fr: Les crochets `` (...) `` peuvent également être utilisés pour définir des sous-expressions d&#39;expressions régulières.

source: Subexpression positions, lengths and actual values will be in `MatchPos <tregexpr.html#matchpos>`_, `MatchLen <tregexpr.html#matchlen>`_ and `Match <tregexpr.html#match>`_.
bg: Позициите, дължините и действителните стойности на подексимация ще бъдат в `MatchPos <tregexpr.html#matchpos>`_,` MatchLen <tregexpr.html#matchlen>`_ и` Match <tregexpr.html#match>`_.
de: Positionen, Längen und tatsächliche Werte des Unterausdrucks werden in `MatchPos <tregexpr.html#matchpos>`_,`MatchLen <tregexpr.html#matchlen>`_ und`Match <tregexpr.html#match>`_ angegeben.
es: Las posiciones de subexpresión, longitudes y valores reales estarán en `MatchPos <tregexpr.html#matchpos>`_,` MatchLen <tregexpr.html#matchlen>`_ y` partido <tregexpr.html#match>`_.
fr: Les positions, longueurs et valeurs réelles des sous-expressions seront dans `MatchPos <tregexpr.html#matchpos>`_,` MatchLen <tregexpr.html#matchlen>`_ et` Match <tregexpr.html#match>`_.
