Repository: Alexey-T/TRegExpr
Catalog: docs/locale/*/LC_MESSAGES/tregexpr.po
Languages: de, es, fr

source: Implements `regular expressions <regular_expressions.html>`_ in pure pascal. Is compatible with Free Pascal, Delphi 2-7, Borland C++ Builder 3-6.
de: Implementiert `reguläre Ausdrücke <regular_expressions.html> in reinem Pascal. Ist kompatibel mit Free Pascal, Delphi 2-7, Borland C ++ Builder 3-6.
es: Implementa expresiones regulares <regular_expressions.html>`_ en puro pascal. Es compatible con Free Pascal, Delphi 2-7, Borland C ++ Builder 3-6.
fr: Implémente `expressions régulières <regular_expressions.html>`_ en pur pascal. Est compatible avec Free Pascal, Delphi 2-7 et Borland C ++ Builder 3-6.

source: To use it just copy `source code <https://github.com/masterandrey/TRegExpr/blob/master/src/RegExpr.pas>`_ into your project.
es: Para usarlo simplemente copie el código fuente <https://github.com/masterandrey/TRegExpr/blob/master/src/RegExpr.pas>`_ en tu proyecto.
fr: Pour l&#39;utiliser, il suffit de copier le code source <https://github.com/masterandrey/TRegExpr/blob/master/src/RegExpr.pas>`_ dans votre projet.

source: The library had already included into `Lazarus (Free Pascal) <http://wiki.freepascal.org/Regexpr>`_ project so you do not need to copy anything if you use `Lazarus <https://www.lazarus-ide.org/>`_.
de: Die Bibliothek war bereits in `Lazarus (Free Pascal) enthalten. <http://wiki.freepascal.org/Regexpr> Wenn Sie `Lazarus verwenden, müssen Sie nichts kopieren <https://www.lazarus-ide.org/>`_.
es: La biblioteca ya había incluido en `Lázaro (Pascal Libre) <http://wiki.freepascal.org/Regexpr>`_ proyecta para que no necesites copiar nada si usas` Lazarus <https://www.lazarus-ide.org/>`_.
fr: La bibliothèque avait déjà inclus dans `Lazarus (Free Pascal) <http://wiki.freepascal.org/Regexpr>`_ projet donc vous n&#39;avez pas besoin de copier quoi que ce soit si vous utilisez` Lazarus <https://www.lazarus-ide.org/>`_.

source: TRegExpr class
de: TRegExpr-Klasse
es: Clase TRegExpr
fr: Classe TRegExpr

source: Return major and minor version, for example, for ``version 0.944``
de: Geben Sie die Dur- und Moll-Version zurück, zum Beispiel für `` Version 0.944``
es: Devuelva las versiones principales y secundarias, por ejemplo, para `` versión 0.944``
fr: Retourne les versions majeure et mineure, par exemple, pour `` version 0.944``

source: Expression
de: Ausdruck
es: Expresión

source: Regular expression.
de: Regulären Ausdruck.
es: Expresión regular.
fr: Expression régulière.

source: For optimization regular expression is automatically compiled into ``P-code``. Human-readable form of the ``P-code`` returns by Dump_.
de: Zur Optimierung wird der reguläre Ausdruck automatisch in ``P-Code`` kompiliert. Von Menschen lesbare Form des ``P-Codes`` wird von Dump_ zurückgegeben.
es: Para la optimización, la expresión regular se compila automáticamente en `` P-code``. La forma legible por el hombre del `` P-code`` devuelve Dump_.
fr: Pour l&#39;optimisation, l&#39;expression régulière est automatiquement compilée dans le `` P-code``. La forme lisible par l’homme du `` P-code`` est retournée par Dump_.

source: In case of any errors in compilation, ``Error`` method is called (by default ``Error`` raises exception ERegExpr_)
de: Bei Fehlern beim Kompilieren wird die ``Error``-Methode aufgerufen (standardmäßig ``Error`` löst die Ausnahme ERegExpr_ aus)
es: En caso de cualquier error en la compilación, se llama al método ``Error`` (por defecto, ``Error`` genera la excepción ERegExpr_)
fr: En cas d&#39;erreur de compilation, la méthode ``Error`` est appelée (par défaut ``Error`` lève l&#39;exception ERegExpr_)

source: Set or get values of `regular expression modifiers <regular_expressions.html#modifiers>`__.
de: Werte für reguläre Ausdrücke einstellen oder abrufen <regular_expressions.html#modifiers> __.
es: Establecer u obtener valores de `modificadores de expresiones regulares <regular_expressions.html#modifiers>`__.
fr: Définir ou obtenir les valeurs de `modificateurs d&#39;expression régulière <regular_expressions.html#modifiers>`__.

source: Format of the string is similar as in `(?ismx-ismx) <regular_expressions.html#inlinemodifiers>`__. For example ``ModifierStr := ‘i-x’`` will switch on modifier `/i <regular_expressions.html#i>`_, switch off `/x <regular_expressions.html#x>`_ and leave unchanged others.
de: Das Format der Zeichenfolge ist ähnlich wie in `(? Ismx-ismx). <regular_expressions.html#inlinemodifiers> __. Zum Beispiel ``ModifierStr: = &#39;i-x``` schaltet den Modifikator `/ i ein <regular_expressions.html#i>`_, schalten Sie`/x aus <regular_expressions.html#x> und lassen andere unverändert.
es: El formato de la cadena es similar al de `(? Ismx-ismx) <regular_expressions.html#inlinemodifiers>`__. Por ejemplo ``ModifierStr: = &#39;i-x&#39;`` activará el modificador `/ i <regular_expressions.html#i>`_, apaga`/x <regular_expressions.html#x>`_ y dejar sin cambios otros.
fr: Le format de la chaîne est similaire à celui de `(?? Ismx-ismx) <regular_expressions.html#inlinemodifiers>`__. Par exemple, ``ModifierStr: = &#39;i-x&#39;`` activera le modificateur `/ i <regular_expressions.html#i>`_, éteint`/x <regular_expressions.html#x>`_ et laisser les autres inchangés.

source: If you try to set unsupported modifier, ``Error`` will be called.
de: Wenn Sie versuchen, einen nicht unterstützten Modifikator einzustellen, wird ``Error`` aufgerufen.
es: Si intenta configurar un modificador no compatible, se llamará a ``Error``.
fr: Si vous essayez de définir un modificateur non supporté, ``Error`` sera appelé.

source: ModifierI
es: Modificador
fr: Modificateur

source: `Modifier /i, "case-insensitive" <regular_expressions.html#i>`, initialized with RegExprModifierI_ value.
de: `Modifier / i,&quot; Groß- und Kleinschreibung wird nicht berücksichtigt &quot; <regular_expressions.html#i>`__, initialisiert mit RegExprModifierI_ value.
es: `Modificador / i,&quot; no distingue mayúsculas y minúsculas &quot; <regular_expressions.html#i>`__, inicializado con RegExprModifierI_ valor.
fr: `Modificateur / i,&quot; insensible à la casse &quot; <regular_expressions.html#i>`__, initialisé avec la valeur RegExprModifierI_.

source: ModifierR
es: Modificador r
fr: Modificateur

source: `Modifier /r, "Russian range extension" <regular_expressions.html#r>`_, initialized with RegExprModifierR_ value.
de: `Modifier / r,&quot; Russische Reichweitenerweiterung &quot; <regular_expressions.html#r>`_, initialisiert mit RegExprModifierR_-Wert.
es: `Modificador / r,&quot; extensión de rango ruso &quot; <regular_expressions.html#r>`_, inicializado con el valor RegExprModifierR_.
fr: `Modificateur / r,&quot; extension de la plage russe &quot; <regular_expressions.html#r>`_, initialisé avec la valeur RegExprModifierR_.

source: ModifierS
es: Modificadores
fr: Modificateurs

source: `Modifier /s, "single line strings" <regular_expressions.html#s>`_, initialized with RegExprModifierS_ value.
de: `Modifikator / en,&quot; einzeilige Zeichenketten &quot; <regular_expressions.html#s>`_, initialisiert mit RegExprModifierS_-Wert.
es: `Modificador / s,&quot; cadenas de una sola línea &quot; <regular_expressions.html#s>`_, inicializado con RegExprModifierS_ valor.
fr: `Modificateur / s,&quot; chaînes simples &quot; <regular_expressions.html#s>`_, initialisé avec la valeur RegExprModifierS_.

source: ModifierG
es: ModificadorG
fr: Modificateur

source: `Modifier /g, "greediness" <regular_expressions.html#g>`_, initialized with RegExprModifierG_ value.
de: `Modifikator / g,&quot; Gier &quot; <regular_expressions.html#g>`_, initialisiert mit RegExprModifierG_-Wert.
es: `Modificador / g,&quot; codicia &quot; <regular_expressions.html#g>`_, inicializado con el valor RegExprModifierG_.
fr: `Modificateur / g,&quot; gourmandise &quot; <regular_expressions.html#g>`_, initialisé avec la valeur RegExprModifierG_.

source: ModifierM
es: Modificador
fr: Modificateur

source: `Modifier /m, "multi-line strings" <regular_expressions.html#m>`_, initialized with RegExprModifierM_ value.
de: `Modifier / m,&quot; mehrzeilige Zeichenketten &quot; <regular_expressions.html#m>`_, initialisiert mit RegExprModifierM_-Wert.
es: `Modificador / m,&quot; cadenas multilínea &quot; <regular_expressions.html#m>`_, inicializado con el valor RegExprModifierM_.
fr: `Modificateur / m,&quot; chaînes multilignes &quot; <regular_expressions.html#m>`_, initialisé avec la valeur RegExprModifierM_.

source: ModifierX
es: Modificador x
fr: ModificateurX

source: `Modifier /x, "eXtended syntax" <regular_expressions.html#x>`_, initialized with RegExprModifierX_ value.
de: `Modifier / x,&quot; erweiterte Syntax &quot; <regular_expressions.html#x> `_, initialisiert mit RegExprModifierX_-Wert.
es: `Modificador / x,&quot; sintaxis extendida &quot; <regular_expressions.html#x>`_, inicializado con el valor RegExprModifierX_.
fr: `Modificateur / x,&quot; syntaxe eXtended &quot; <regular_expressions.html#x>`_, initialisé avec la valeur RegExprModifierX_.

source: Match the regular expression against ``AInputString``.
de: Vergleichen Sie den regulären Ausdruck mit ``AInputString``.
es: Haga coincidir la expresión regular con ``AInputString``.
fr: Faites correspondre l&#39;expression régulière avec ``AInputString``.

source: Available overloaded ``Exec`` version without ``AInputString`` - it uses ``AInputString`` from previous call.
de: Verfügbare überladene ``Exec``-Version ohne ``AInputString`` - es verwendet ``AInputString`` aus dem vorherigen Aufruf.
es: Disponible la versión ``Exec`` sobrecargada sin ``AInputString`` - usa `` AInputString`` de la llamada anterior.
fr: Version ``Exec`` surchargée disponible sans ``AInputString`` - elle utilise ``AInputString`` de l&#39;appel précédent.

source: See also global function ExecRegExpr_ that you can use without explicit ``TRegExpr`` object creation.
de: Siehe auch die globale Funktion ExecRegExpr_, die Sie ohne explizite ``TRegExpr``-Objekterstellung verwenden können.
es: Vea también la función global ExecRegExpr_ que puede usar sin la creación explícita de objetos ``TRegExpr``.
fr: Voir aussi la fonction globale ExecRegExpr_ que vous pouvez utiliser sans la création explicite d&#39;objet ``TRegExpr``.

source: ExecNext
es: ExecSiguiente

source: Find next match.
de: Nächstes Spiel finden
es: Encuentra el próximo partido.
fr: Trouver le prochain match.

source: Without parameter works the same as
de: Ohne Parameter funktioniert das Gleiche wie
es: Sin parámetro funciona igual que
fr: Sans paramètre fonctionne de la même manière que

source: if MatchLen [0] = 0 then ExecPos (MatchPos [0] + 1) else ExecPos (MatchPos [0] + MatchLen [0]);
de: wenn MatchLen [0] = 0, dann ExecPos (MatchPos [0] + 1) oder ExecPos (MatchPos [0] + MatchLen [0]);
es: si MatchLen [0] = 0 entonces ExecPos (MatchPos [0] + 1) más ExecPos (MatchPos [0] + MatchLen [0]);
fr: si MatchLen [0] = 0 alors ExecPos (MatchPos [0] + 1) sinon ExecPos (MatchPos [0] + MatchLen [0]);

source: Raises exception if used without preceeding successful call to Exec_, ExecPos_ or ExecNext_.
de: Löst eine Ausnahme aus, wenn sie ohne vorherigen Aufruf von Exec_, ExecPos_ oder ExecNext_ verwendet wird.
es: Aumenta la excepción si se usa sin preceder una llamada exitosa a Exec_, ExecPos_ o ExecNext_.
fr: Lève une exception si elle est utilisée sans précéder l&#39;appel réussi à Exec_, ExecPos_ ou ExecNext_.

source: So you always must use something like
de: Du musst also sowas immer verwenden
es: Así que siempre debes usar algo como
fr: Donc, vous devez toujours utiliser quelque chose comme

source: if Exec (InputString) then repeat { proceed results} until not ExecNext;
de: wenn Exec (InputString), dann wiederholen Sie {continue results}, bis nicht ExecNext;
es: si es Exec (InputString), repita {proceder resultados} hasta que no sea ExecNext;
fr: Si Exec (InputString), répétez {continue result} jusqu&#39;à ce que ce ne soit pas ExecNext;

source: Finds match for ``InputString`` starting from ``AOffset`` position
de: Sucht nach ``InputString`` ab ``AOffset``
es: Encuentra coincidencia para ``InputString`` a partir de la posición `` AOffset``
fr: Recherche une correspondance pour ``InputString`` à partir de la position ```AOffset``

source: AOffset = 1 // first char of InputString
de: AOffset = 1 // erstes Zeichen von InputString
es: AOffset = 1 // primer char de InputString
fr: AOffset = 1 // premier caractère de InputString

source: Returns current input string (from last Exec_ call or last assign to this property).
de: Gibt die aktuelle Eingabezeichenfolge zurück (vom letzten Exec_-Aufruf oder der letzten Zuweisung an diese Eigenschaft).
es: Devuelve la cadena de entrada actual (de la última llamada ejecutiva o la última asignación a esta propiedad).
fr: Renvoie la chaîne d&#39;entrée en cours (à partir du dernier appel Exec_ ou de la dernière affectation à cette propriété).

source: Any assignment to this property clears Match_, MatchPos_ and MatchLen_.
de: Jede Zuweisung zu dieser Eigenschaft löscht Match_, MatchPos_ und MatchLen_.
es: Cualquier asignación a esta propiedad borra Match_, MatchPos_ y MatchLen_.
fr: Toute affectation à cette propriété efface Match_, MatchPos_ et MatchLen_.

source: Substitute
de: Ersatz
es: Sustituir
fr: Remplacer

source: function Substitute (const ATemplate : RegExprString) : RegExprString;
es: función Sustituir (const ATemplate: RegExprString): RegExprString;
fr: fonction Substitute (const ATemplate: RegExprString): RegExprString;

source: Returns ``ATemplate`` with ``$&`` or ``$0`` replaced by whole regular expression and ``$n`` replaced by occurence of subexpression number ``n``.
de: Gibt ``ATemplate`` zurück, wobei ``$&`` oder ``$0`` durch den ganzen regulären Ausdruck ersetzt werden und ``$n`` durch das Auftreten der Unterausdrucknummer ``n`` ersetzt wird.
es: Devuelve ``ATemplate`` con ``$&`` o ``$0`` reemplazado por la expresión regular completa y ``$n`` reemplazado por el número de subexpresión ``n``.
fr: Retourne `&#39;ATemplate`` avec` `$ &amp;` `ou`&#39; $ 0`` remplacés par une expression régulière complète et ``$n`` remplacés par l&#39;occurrence d&#39;un nombre de sous-expressions ``n``.

source: To place into template characters ``$`` or ``\``, use prefix ``\``, like ``\\`` or ``\$``.
de: Verwenden Sie das Präfix ``\`` wie ``\\`` oder `` \ $ ``.
es: Para colocar en la plantilla los caracteres ``$`` o ``\``, use el prefijo ``\``, como ``\\`` o `` \ $ ``.
fr: Pour insérer des caractères de modèle ``$`` ou `` ``, utilisez le préfixe ``\``, comme ``\\`` ou `` \ $ ``.

source: symbol
es: símbolo
fr: symbole

source: description
de: Beschreibung
es: descripción
fr: la description

source: whole regular expression match
de: ganze Übereinstimmung des regulären Ausdrucks
es: coincidencia de toda la expresión regular
fr: match entier expression régulière

source: regular subexpression ``n`` match
de: regulärer Unterausdruck ``n``
es: subexpresión regular ``n``
fr: correspondance régulière ``n`` match

source: in Windows replaced with ``\r\n``
de: in Windows durch ``\r\n`` ersetzt
es: en Windows reemplazado con ``\r\n``
fr: dans Windows remplacé par ``\r\n``

source: lowcase one next char
de: Kleinbuchstabe ein nächstes Zeichen
es: lowcase una próxima char
fr: lowcase un prochain personnage

source: lowercase all chars after that
de: Kleinbuchstaben alle Zeichen danach
es: en minúsculas todos los caracteres después de eso
fr: minuscule tous les caractères après cela

source: uppcase one next char
de: ein weiteres Zeichen
es: uppcase una próxima char
fr: mettre en valeur un prochain personnage

source: uppercase all chars after that
de: Großbuchstaben alle Zeichen danach
es: mayúsculas todos los caracteres después de eso
fr: majuscule tous les caractères après cela

source: '1\$ is $2\\rub\\' -> '1$ is <Match[2]>\rub\' '\U$1\\r' transforms into '<Match[1] in uppercase>\r'
de: &#39;1 \ $ ist $ 2 \\ rub \\&#39; -&gt; &#39;1 $ ist <Match[2]> \ rub \ &#39;&#39; \ U $ 1 \\ &#39;verwandelt sich in&#39; <Match[1] in uppercase> \ r &#39;
es: &#39;1 \ $ is $ 2 \\ rub \\&#39; -&gt; &#39;1 $ is <Match[2]> \ rub \ &#39;&#39; \ U $ 1 \\ r &#39;se transforma en&#39; <Match[1] in uppercase> \ r &#39;
fr: &#39;1 \ $ est $ 2 \\ rub \\&#39; -&gt; &#39;1 $ est <Match[2]> \ rub \ &#39;&#39; \ U $ 1 \\ r &#39;se transforme en&#39; <Match[1] in uppercase> \ r &#39;

source: If you want to place raw digit after ‘$n’ you must delimit ``n`` with curly braces ``{}``.
de: Wenn Sie eine rohe Ziffer nach &#39;$ n&#39; setzen möchten, müssen Sie ``n`` mit geschweiften Klammern ``{}`` abgrenzen.
es: Si desea colocar un dígito en bruto después de &#39;$ n&#39;, debe delimitar ``n`` con llaves &#39;`{}` `.
fr: Si vous voulez placer un chiffre brut après &#39;$ n&#39;, vous devez délimiter ``n`` avec des accolades `` {} ``.

source: 'a$12bc' -> 'a<Match[12]>bc' 'a${1}2bc' -> 'a<Match[1]>2bc'.
de: &#39;a $ 12bc&#39; -&gt; &#39;a <Match[12]> bc &#39;&#39; a $ {1} 2bc &#39;-&gt;&#39; a <Match[1]> 2bc &#39;.
es: &#39;a $ 12bc&#39; -&gt; &#39;a <Match[12]> bc &#39;&#39; a $ {1} 2bc &#39;-&gt;&#39; a <Match[1]> 2bc &#39;.
fr: &#39;a $ 12bc&#39; -&gt; &#39;a <Match[12]> bc &#39;&#39; a $ {1} 2bc &#39;-&gt;&#39; a <Match[1]> 2bc &#39;.

source: Split
de: Teilt
es: División
fr: Divisé

source: Split AInputStr into APieces by r.e. occurencies
de: Trennen Sie AInputStr nach Wiederholungen in APieces
es: Dividir AInputStr en piezas por repeticiones
fr: Fractionner AInputStr en APieces par répétitions

source: Internally calls Exec_ / ExecNext_
de: Ruft intern Exec_ / ExecNext_ auf
es: Llama internamente a Exec_ / ExecNext_
fr: Appelle en interne Exec_ / ExecNext_

source: See also global function SplitRegExpr_ that you can use without explicit ``TRegExpr`` object creation.
de: Siehe auch die globale Funktion SplitRegExpr_, die Sie ohne explizite ``TRegExpr``-Objekterstellung verwenden können.
es: Vea también la función global SplitRegExpr_ que puede usar sin la creación explícita de objetos ``TRegExpr``.
fr: Voir aussi la fonction globale SplitRegExpr_ que vous pouvez utiliser sans la création explicite d&#39;objet ``TRegExpr``.

source: Replace, ReplaceEx
de: Ersetzen, ErsetzenEx
es: Reemplazar, ReplaceEx
fr: Remplacer, RemplacerEx

source: function Replace (Const AInputStr : RegExprString; const AReplaceStr : RegExprString; AUseSubstitution : boolean= False) : RegExprString; overload; function Replace (Const AInputStr : RegExprString; AReplaceFunc : TRegExprReplaceFunction) : RegExprString; overload; function ReplaceEx (Const AInputStr : RegExprString; AReplaceFunc : TRegExprReplaceFunction): RegExprString;
de: function Replace (Const AInputStr: RegExprString; const AReplaceStr: RegExprString; AUseSubstitution: boolean = False): RegExprString; Überlast; function Replace (Const AInputStr: RegExprString; AReplaceFunc: TRegExprReplaceFunction): RegExprString; Überlast; function ReplaceEx (Const AInputStr: RegExprString; AReplaceFunc: TRegExprReplaceFunction): RegExprString;
es: función Reemplazar (Const AInputStr: RegExprString; const AReplaceStr: RegExprString; AUseSubstitution: boolean = False): RegExprString; sobrecarga; función Reemplazar (Const AInputStr: RegExprString; AReplaceFunc: TRegExprReplaceFunction): RegExprString; sobrecarga; función ReplaceEx (Const AInputStr: RegExprString; AReplaceFunc: TRegExprReplaceFunction): RegExprString;
fr: fonction Remplacer (Const AInputStr: RegExprString; const AReplaceStr: RegExprString; AUseSubstitution: boolean = False): RegExprString; surcharge; function Remplacer (Const AInputStr: RegExprString; AReplaceFunc: TRegExprReplaceFunction): RegExprString; surcharge; function ReplaceEx (Const AInputStr: RegExprString; AReplaceFunc: TRegExprReplaceFunction): RegExprString;

source: Returns the string with r.e. occurencies replaced by the replace string.
de: Gibt die Zeichenfolge mit erneuten Vorkommen durch die Ersetzungszeichenfolge zurück.
es: Devuelve la cadena con repeticiones sustituidas por la cadena de reemplazo.
fr: Renvoie la chaîne dont les occurrences sont remplacées par la chaîne de remplacement.

source: If last argument (``AUseSubstitution``) is true, then ``AReplaceStr`` will be used as template for Substitution methods.
de: Wenn das letzte Argument (&quot;AUseSubstitution&quot;) wahr ist, wird &quot;AReplaceStr&quot; als Vorlage für Substitutionsmethoden verwendet.
es: Si el último argumento (`` AUseSubstitution``) es verdadero, entonces `` AReplaceStr`` se usará como plantilla para los métodos de sustitución.
fr: Si le dernier argument (`` AUseSubstitution``) est vrai, alors ``AReplaceStr`` sera utilisé comme modèle pour les méthodes de substitution.

source: Expression := '((?i)block|var)\s*(\s*\([^ ]*\)\s*)\s*'; Replace ('BLOCK( test1)', 'def "$1" value "$2"', True);
de: Ausdruck: = &#39;((? I) block | var) \ s * (\ s * \ ([^] * \) \ s *) \ s *&#39;; Ersetzen Sie (&#39;BLOCK (test1)&#39;, &#39;def &quot;$ 1&quot; -Wert &quot;$ 2&quot;&#39;, True);
es: Expresión: = &#39;((??) Bloque | var) \ s * (\ s * \ ([^] * \) \ s *) \ s *&#39;; Reemplace (&#39;BLOCK (test1)&#39;, &#39;def &quot;$ 1&quot; valor &quot;$ 2&quot;&#39;, Verdadero);
fr: Expression: = &#39;((? I) bloc | var) \ s * (\ s * \ ([^] * \) \ s *) \ s *&#39;; Remplacez (&#39;BLOCK (test1)&#39;, &#39;def &quot;$ 1&quot; valeur &quot;$ 2&quot;&#39;, True);

source: Returns ``def "BLOCK" value "test1"``
de: Liefert ``def "BLOCK" Wert &quot;test1&quot; ``
es: Devuelve el valor de `` def &quot;BLOCK&quot; &quot;test1&quot; ``
fr: Retourne `` def &quot;BLOCK&quot; valeur &quot;test1&quot; &quot;` `

source: Replace ('BLOCK( test1)', 'def "$1" value "$2"', False)
de: Ersetzen (&#39;BLOCK (test1)&#39;, &#39;def &quot;$ 1&quot; Wert &quot;$ 2&quot;&#39;, False)
es: Reemplace (&#39;BLOQUEO (prueba1)&#39;, &#39;def &quot;$ 1&quot; valor &quot;$ 2&quot;&#39;, Falso)
fr: Remplacez (&#39;BLOCK (test1)&#39;, &#39;def &quot;$ 1&quot;, valeur &quot;$ 2&quot;&#39;, False)

source: Returns ``def "$1" value "$2"``
de: Liefert `` def &quot;$ 1&quot; Wert &quot;$ 2&quot; ``
es: Devuelve el valor `` def &quot;$ 1&quot; valor &quot;$ 2&quot; ``
fr: Retourne `` def &quot;$ 1&quot; valeur &quot;$ 2&quot; ``

source: Overloaded version and ``ReplaceEx`` operate with call-back function, so you can implement really complex functionality.
de: Die überladene Version und ``ReplaceEx`` arbeiten mit der Rückruffunktion, sodass Sie sehr komplexe Funktionen implementieren können.
es: La versión sobrecargada y ``ReplaceEx`` operan con la función de devolución de llamada, por lo que puede implementar una funcionalidad realmente compleja.
fr: La version surchargée et ``ReplaceEx`` fonctionnent avec la fonction de rappel, ce qui vous permet d&#39;implémenter des fonctionnalités vraiment complexes.

source: See also global function ReplaceRegExpr_ that you can use without explicit ``TRegExpr`` object creation.
de: Siehe auch die globale Funktion ReplaceRegExpr_, die Sie ohne explizite ``TRegExpr``-Objekterstellung verwenden können.
es: Vea también la función global ReplaceRegExpr_ que puede usar sin la creación explícita de objetos ``TRegExpr``.
fr: Voir aussi la fonction globale ReplaceRegExpr_ que vous pouvez utiliser sans la création explicite d&#39;objet ``TRegExpr``.

source: Number of subexpressions has been found in last Exec_ / ExecNext_ call.
de: Die Anzahl der Unterausdrücke wurde im letzten Exec_ / ExecNext_-Aufruf gefunden.
es: Se ha encontrado el número de subexpresiones en la última llamada Exec_ / ExecNext_.
fr: Un nombre de sous-expressions a été trouvé lors du dernier appel Exec_ / ExecNext_.
