Repository: Alexey-T/TRegExpr
Catalog: docs/locale/*/LC_MESSAGES/tregexpr_interface.po
Languages: bg, es_es, fr_fr, ru, ru_ru

source: -1 there are not enough closing brackets ‘)’;
es_es: -1 no hay suficientes corchetes de cierre &#39;)&#39;;
fr_fr: -1 il n&#39;y a pas assez de crochets de fermeture &#39;)&#39;;
ru_ru: -1 недостаточно закрывающих скобок &#39;)&#39;;

source: -(n+1) at position n was found opening ‘[’ without corresponding closing ‘]’;
es_es: - (n + 1) en la posición n se encontró abriendo &#39;[&#39; sin el correspondiente cierre &#39;]&#39;;
fr_fr: - (n + 1) à la position n a été trouvé ouvrant &#39;[&#39; sans fermeture correspondante &#39;]&#39;;
ru_ru: - (n + 1) в позиции n было найдено открытие &#39;[&#39; без соответствующего закрытия &#39;]&#39;;

source: n at position n was found closing bracket ‘)’ without corresponding opening ‘(’.
es_es: n en la posición n se encontró el corchete de cierre &#39;)&#39; sin la correspondiente apertura &#39;(&#39;.
fr_fr: n à la position n a été trouvé crochet de fermeture &#39;)&#39; sans ouverture correspondante &#39;(&#39;.
ru_ru: n в позиции n была найдена закрывающая скобка &#39;)&#39; без соответствующего открывания &#39;(&#39;.

source: If Result <> 0, then ASubExprs can contain empty items or illegal ones
es_es: Si Resultado &lt;&gt; 0, entonces ASubExprs puede contener elementos vacíos o ilegales
fr_fr: Si Résultat &lt;&gt; 0, ASubExprs peut contenir des éléments vides ou illégaux.
ru_ru: Если Result &lt;&gt; 0, то ASubExprs может содержать пустые или недопустимые

source: Exception type
es_es: Tipo de excepción
fr_fr: Type d&#39;exception
ru_ru: Тип исключения

source: Default error handler of TRegExpr raise exception:
es_es: El controlador de errores predeterminado de TRegExpr genera una excepción:
fr_fr: Gestionnaire d&#39;erreurs par défaut de l&#39;exception TRegExpr:
ru_ru: Обработчик ошибок по умолчанию TRegExpr возбудить исключение:

source: TRegExpr now supports UniCode, but it works very slow :(
bg: TRegExpr вече поддържа UniCode, но работи много бавно: (
es_es: TRegExpr ahora es compatible con UniCode, pero funciona muy lento :(
fr_fr: TRegExpr supporte maintenant UniCode, mais cela fonctionne très lentement :(
ru: TRegExpr теперь поддерживает UniCode, но работает очень медленно :(
ru_ru: TRegExpr теперь поддерживает UniCode, но работает очень медленно :(

source: Who want to optimize it ? ;)
bg: Кой иска да го оптимизира? )
es_es: ¿Quién quiere optimizarlo? ;)
fr_fr: Qui veut l&#39;optimiser? ;)
ru: Кто хочет оптимизировать это? ;)
ru_ru: Кто хочет оптимизировать это? ;)

source: Use it only if you really need Unicode support !
bg: Използвайте го само ако наистина се нуждаете от поддръжка на Unicode!
es_es: ¡Úsalo solo si realmente necesitas soporte Unicode!
fr_fr: Utilisez-le uniquement si vous avez vraiment besoin du support Unicode!
ru: Используйте его, только если вам действительно нужна поддержка Юникода!
ru_ru: Используйте его, только если вам действительно нужна поддержка Юникода!

source: Remove ``.`` in ``{.$DEFINE UniCode}`` in regexpr.pas. After that all strings will be treated as WideString.
bg: Премахнете ``.`` в ``{.$DEFINE UniCode}`` в regexpr.pas. След това всички низове ще се третират като WideString.
es_es: Elimine `` .`` en `` {. $ DEFINE UniCode} `` en regexpr.pas. Después de eso, todas las cadenas serán tratadas como WideString.
fr_fr: Supprimez `` .`` dans `` {. $ DEFINE UniCode} `` dans regexpr.pas. Après cela, toutes les chaînes seront traitées comme WideString.
ru: Удалите ``.`` в ``{.$DEFINE UniCode}`` в regexpr.pas. После этого все строки будут рассматриваться как WideString.
ru_ru: Удалите `` .`` в `` {. $ DEFINE UniCode} `` в regexpr.pas. После этого все строки будут рассматриваться как WideString.

source: Implements `regular expressions <regexp_syntax.html>`_ in pure pascal.
bg: Изпълнява &quot;регулярни изрази&quot; <regexp_syntax.html> в чист паскал.
ru: Реализует `регулярные выражения <regexp_syntax.html>`_ в чистом паскале.

source: To use it just copy `source code <https://github.com/masterandrey/TRegExpr/blob/master/src/RegExpr.pas>`_ into your project.
bg: За да го използвате просто копирайте `изходния код <https://github.com/masterandrey/TRegExpr/blob/master/src/RegExpr.pas>`_ във вашия проект.
ru: Чтобы использовать это просто скопируйте `исходный код <https://github.com/masterandrey/TRegExpr/blob/master/src/RegExpr.pas>`_ в ваш проект.

source: The library had already included in `Lazarus (Free Pascal) <http://wiki.freepascal.org/Regexpr>`_ project so you do not need to copy anything if you use `Lazarus <https://www.lazarus-ide.org/>`_.
bg: Библиотеката вече беше включена в `Lazarus (Free Pascal) <http://wiki.freepascal.org/Regexpr>`_ проекта, така че не е необходимо да копирате нищо, ако използвате` Lazarus <https://www.lazarus-ide.org/>`_.
ru: Библиотека уже включена в `Lazarus (Free Pascal) <http://wiki.freepascal.org/Regexpr>`_ проект, поэтому вам не нужно ничего копировать, если вы используете `Lazarus <https://www.lazarus-ide.org/>`_.

source: TRegExpr class
bg: TRegExpr клас
ru: Класс TRegExpr

source: For optimization, TRegExpr will automatically compiles it into ``P-code`` (you can see it with help of Dump_ method) and stores in internal structures.
bg: За оптимизация, TRegExpr автоматично ще го компилира в `` P-code &#39;&#39; (можете да го видите с помощта на метода Dump_) и съхранява във вътрешни структури.
ru: Для оптимизации TRegExpr автоматически скомпилирует его в ``P-код`` (вы можете увидеть его с помощью метода Dump_) и сохранит во внутренних структурах.

source: Regular expresion is re-compiled only if you call Exec_, ExecNext_, Substitute_, Dump_, etc. And only if Expression_ was changed after last compilation.
bg: Редовната експресия се прекомпилира само ако се обадите на Exec_, ExecNext_, Substitute_, Dump_ и т.н. И само ако Expression_ беше променен след последната компилация.
ru: Регулярное выражение перекомпилируется, только если вы вызываете Exec_, ExecNext_, Substitute_, Dump_ и т. Д. И только если Expression_ было изменено после последней компиляции.

source: In case of any errors in compilation, ``Error`` method is called (by default ``Error`` raises exception ERegExpr_)
bg: В случай на грешки при компилирането се извиква методът ``Error`` (по подразбиране ``Error`` повдига изключение ERegExpr_)
ru: В случае каких-либо ошибок при компиляции вызывается метод ``Error`` (по умолчанию ``Error`` вызывает исключение ERegExpr_)

source: Set or get default values of `r.e.modifiers <regexp_syntax.html#modifiers>`__.
bg: Задайте или получите стойности по подразбиране на `r.e.modifiers <regexp_syntax.html#modifiers>`__.
ru: Установить или получить значения по умолчанию для `modifiers <#regexprmodifieri>`__.

source: Format of the string is similar as in `(?ismx-ismx) <regexp_syntax.html#inlinemodifiers>`__. For example ``ModifierStr := ‘i-x’`` will switch on modifier `/i <regexp_syntax.html#i>`_, switch off `/x <regexp_syntax.html#x>`_ and leave unchanged others.
bg: Форматът на низа е подобен на този в ((? Ismx-ismx) <regexp_syntax.html#inlinemodifiers>`__. Например ``ModifierStr: = &#39;i-x&#39;`` ще включи модификатор `/ i <regexp_syntax.html#i>`_, изключете`/x <regexp_syntax.html#x>`_ и оставят непроменени други.
ru: Формат строки такой же, как в `(? Ismx-ismx) <regexp_syntax.html#inlinemodifiers>`__. Например, ``ModifierStr: = &#39;i-x&#39;`` включит модификатор `/i <regexp_syntax.html#i>`_, выключить `/x <regexp_syntax.html#x>`_ и оставляйте без изменений других.

source: If you try to set unsupported modifier, ``Error`` will be called.
bg: Ако се опитате да зададете неподдържан модификатор, ще се извика `` Error &#39;&#39;.
ru: Если вы попытаетесь установить неподдерживаемый модификатор, будет вызвано ``Error``.

source: Modifier /r - (“Russian syntax extensions), initialized with `RegExprModifierR <#modifier_defs>`__ value.
bg: Модификатор / r - (&quot;Руски синтаксични разширения&quot;), инициализиран с `RegExprModifierR &lt;#modifier_defs>` __ стойност.
ru: Модификатор / r - («Расширения русского синтаксиса»), инициализируется значением `RegExprModifierR <#regexprmodifierr>` __.

source: ModifierS
bg: модификатори
ru: модификаторы

source: `Modifier /s <regexp_syntax.html#modifier_s>`__ - ‘.’ works as any char (else doesn’t match LineSeparators_ and `LinePairedSeparator <tregexpr_interface.html#linepairedseparator>`__), initialized with `RegExprModifierS <#modifier_defs>`__ value.
bg: `Модификатор / и <regexp_syntax.html#modifier_s>`__ - &#39;.&#39; работи като всеки char (иначе не съвпада с LineSeparators_ и `LinePairedSeparator <tregexpr_interface.html#linepairedseparator>`__), инициализиран с` RegExprModifierS &lt;#modifier_defs>`__ стойност.
ru: `Модификатор /s <regexp_syntax.html#s>`__ - &#39;.&#39; работает как любой символ (иначе не соответствует LineSeparators_ и `LinePairedSeparator <tregexpr_interface.html#linepairedseparator>`__), инициализируется значением `RegExprModifierS <#regexprmodifiers>`__.

source: Match the regular expression against ``AInputString``.
bg: Съвпадение на регулярния израз срещу ``AInputString``.
ru: Сопоставьте регулярное выражение с ``AInputString``.

source: Available overloaded ``Exec`` version without ``AInputString`` - it uses ``AInputString`` from previous call.
bg: Налична претоварена версия ``Exec`` без ``AInputString`` - използва `` AInputString`` от предишно повикване.
ru: Доступна перегруженная версия ``Exec`` без ``AInputString`` - она использует ``AInputString`` из предыдущего вызова.

source: See also global function ExecRegExpr_ that you can use without explicit ``TRegExpr`` object creation.
bg: Вижте също глобалната функция ExecRegExpr_, която можете да използвате без изричното създаване на ``TRegExpr`` обекта.
ru: Смотрите также глобальную функцию ExecRegExpr_, которую вы можете использовать без явного создания объекта ``TRegExpr``.

source: Find next match.
bg: Намерете следващия мач.
ru: Найти следующий матч.

source: Raises exception if used without preceeding successful call to Exec_, ExecPos_ or ExecNext_.
bg: Повдига изключението, ако се използва без предишното успешно извикване на Exec_, ExecPos_ или ExecNext_.
ru: Вызывает исключение, если используется без предшествующего успешного вызова Exec_, ExecPos_ или ExecNext_.

source: So you always must use something like
bg: Така че винаги трябва да използвате нещо подобно
ru: Таким образом, вы всегда должны использовать что-то вроде

source: Finds match for ``InputString`` starting from ``AOffset`` position
bg: Намира съвпадение за ``InputString``, започвайки от позиция ``AOffset``
ru: Находит совпадение для ``InputString``, начиная с позиции ``AOffset``

source: Returns current input string (from last Exec_ call or last assign to this property).
bg: Връща текущия входен низ (от последното Exec_ повикване или последното присвояване на това свойство).
ru: Возвращает текущую входную строку (из последнего вызова Exec_ или последнего присвоения этому свойству).

source: Any assignment to this property clears Match_, MatchPos_ and MatchLen_.
bg: Всяко присвояване на това свойство изчиства Match_, MatchPos_ и MatchLen_.
ru: Любое присвоение этому свойству очищает Match_, MatchPos_ и MatchLen_.

source: Returns ``ATemplate`` with ``$&`` or ``$0`` replaced by whole regular expression and ``$n`` replaced by occurence of subexpression number ``n``.
bg: Връща ``ATemplate`` с `` $ &amp; `` или ``$0``, заменен с цял редовен израз и `` $ n`` заменен с поява на под-експресионен номер ``n``.
ru: Возвращает ``ATemplate`` с `` $ &amp; `` или ``$0``, замененным целым регулярным выражением, а `` $ n`` заменяется вхождением числа подвыражения ``n``.

source: To place into template characters ``$`` or ``\``, use prefix ``\``, like ``\\`` or ``\$``.
bg: За да поставите в шаблони символи `` $ `` или `` `, използвайте префикс` `` `, като` `` `или` `` `.
ru: Чтобы поместить в шаблон символы ``$`` или ````, используйте префикс ````, например ``\`` или ``$``.

source: description
bg: описание
ru: описание

source: whole regular expression match
bg: съвпадение на целия регулярен израз
ru: полное совпадение регулярного выражения

source: regular subexpression ``n`` match
bg: редовно съвпадение ``n``
ru: регулярное подвыражение ``n`` совпадение

source: in Windows replaced with ``\r\n``
bg: в Windows се заменя с ``r``
ru: в Windows заменено на ``\r\n``

source: uppcase one next char
bg: въведете следващия знак
ru: Uppcase один следующий символ

source: If you want to place raw digit after ‘$n’ you must delimit ``n`` with curly braces ``{}``.
bg: Ако искате да поставите необработена цифра след &#39;$ n&#39;, трябва да ограничите ``n`` с фигурни скоби `` {} ``.
ru: Если вы хотите поместить необработанную цифру после &#39;$ n&#39;, вы должны разделить ``n`` фигурными скобками ``{}``.

source: Internally calls Exec_ / ExecNext_
bg: Вътрешно извиква Exec_ / ExecNext_
ru: Внутренне вызывает Exec_ / ExecNext_

source: See also global function SplitRegExpr_ that you can use without explicit ``TRegExpr`` object creation.
bg: Вижте също глобалната функция SplitRegExpr_, която можете да използвате без изричното създаване на ``TRegExpr`` обекта.
ru: Смотрите также глобальную функцию SplitRegExpr_, которую вы можете использовать без явного создания объекта ``TRegExpr``.

source: Replace, ReplaceEx
bg: Замяна, ReplaceEx

source: Returns the string with r.e. occurencies replaced by the replace string.
bg: Връща низа с повторно заменяеми с заместващия низ низ.
ru: Возвращает строку с повторениями, замененными строкой замены.

source: If ``AUseSubstitution`` is true, then ``AReplaceStr`` will be used as template for Substitution methods.
bg: Ако ``AUseSubstitution`` е вярно, то ``AReplaceStr`` ще се използва като шаблон за методи за заместване.
ru: Если ``AUseSubstitution`` равно true, то ``AReplaceStr`` будет использоваться в качестве шаблона для методов подстановки.

source: Overloaded version and ``ReplaceEx`` operate with call-back function, so you can implement really complex functionality.
bg: Претоварената версия и ``ReplaceEx`` работят с функция обратно повикване, така че можете да реализирате наистина сложна функционалност.
ru: Перегруженная версия и ``ReplaceEx`` работают с функцией обратного вызова, поэтому вы можете реализовать действительно сложную функциональность.

source: See also global function ReplaceRegExpr_ that you can use without explicit ``TRegExpr`` object creation.
bg: Вижте също глобална функция ReplaceRegExpr_, която можете да използвате без изричното създаване на ``TRegExpr``.
ru: Смотрите также глобальную функцию ReplaceRegExpr_, которую вы можете использовать без явного создания объекта ``TRegExpr``.

source: Number of subexpressions has been found in last Exec_ / ExecNext_ call.
bg: В последното повикване Exec_ / ExecNext_ е намерен брой подекспресии.
ru: Количество подвыражений было найдено в последнем вызове Exec_ / ExecNext_.

source: If there are no subexpr. but whole expr was found (Exec\* returned True), then ``SubExprMatchCount=0``, if no subexpressions nor whole r.e. found (Exec_ / ExecNext_ returned false) then ``SubExprMatchCount=-1``.
bg: Ако няма субекспр. но е открит цял expr (Exec * върна True), след това `` SubExprMatchCount = 0``, ако не са намерени никакви подекспресии или цяло (Exec_ / ExecNext_ false), след това `` SubExprMatchCount = -1``.
ru: Если нет субэкспр. но был найден весь expr (Exec \ * вернул True), затем `` SubExprMatchCount = 0``, если ни подвыражений, ни целых повторно не найдено (Exec_ / ExecNext_ вернул false), тогда `` SubExprMatchCount = -1``.

source: Note, that some subexpr. may be not found and for such subexpr. ``MathPos=MatchLen=-1`` and ``Match=’’``.
bg: Имайте предвид, че някои субекспр. може да не бъде намерен и за такъв subexpr. `` MathPos = MatchLen = -1`` и `` Match = &#39;&#39; ``.
ru: Обратите внимание, что некоторые субэкспр. может быть не найден и для такого подэкспр. ``MathPos = MatchLen = -1`` и ``Match = &#39;&#39;``.

source: Returns ``’’`` if in r.e. no such subexpression or this subexpression was not found in the input string.
bg: Връща `` &#39;&#39; `, ако няма подобна експресия или тази субекспресия не е намерена във входния низ.
ru: Возвращает ``&#39;&#39;``, если в подобном подвыражении нет или это подвыражение не было найдено во входной строке.

source: Returns ``ID`` of last error, ``0`` if no errors (unusable if ``Error`` method raises exception) and clear internal status into ``0`` (no errors).
bg: Връща ``ID`` на последната грешка, ``0``, ако няма грешки (неизползваеми, ако метод ``Error`` повдигне изключение) и изчисти вътрешния статус в `` 0`` (без грешки).
ru: Возвращает ``ID`` последней ошибки, ``0``, если ошибок нет (невозможно использовать, если метод ``Error`` вызывает исключение) и очищает внутренний статус в ``0`` (без ошибок).

source: Returns ``Error`` message for error with ``ID = AErrorID``.
bg: Връща съобщението `` Error &#39;&#39; за грешка с `` ID = AErrorID``.
ru: Возвращает сообщение об ошибке ``Error`` с `` ID = AErrorID``.

source: Useful for error diagnostics
bg: Полезно за диагностика на грешки
ru: Полезно для диагностики ошибок

source: Contains chars, treated as ``\s`` (initially filled with RegExprSpaceChars_ global constant)
bg: Съдържа символи, третирани като `` `&#39;(първоначално запълнени с глобална константа RegExprSpaceChars_).
ru: Содержит символы, которые рассматриваются как `` \ s`` (изначально заполнены глобальной константой RegExprSpaceChars_)

source: Contains chars, treated as ``\w`` (initially filled with RegExprWordChars_ global constant)
bg: Съдържа символи, третирани като ``w`` (първоначално запълнени с глобална константа RegExprWordChars_)
ru: Содержит символы, которые рассматриваются как `` \ w`` (изначально заполнены глобальной константой RegExprWordChars_)

source: line separators (like ``\n`` in Unix), initially filled with RegExprLineSeparators_ global constant)
bg: разделители на линии (като ``n`` в Unix), първоначално запълнени с глобална константа RegExprLineSeparators_)
ru: разделители строк (например, ``\n`` в Unix), изначально заполненные глобальной константой RegExprLineSeparators_)

source: see also `about line separators <regexp_syntax.html#line-separators>`__
bg: виж също `за разделителите на линии <regexp_syntax.html#line-separators>`__
ru: смотрите также `о разделителях строк <regexp_syntax.html#line-separators>`__

source: For example, if you need Unix-style behaviour, assign ``LineSeparators := #$a`` and ``LinePairedSeparator := ''`` (empty string).
bg: Например, ако се нуждаете от поведение в стил Unix, задайте `` LineSeparators: = # $ a`` и `` LinePairedSeparator: = &#39;&#39; `(празен низ).
ru: Например, если вам нужно поведение в стиле Unix, присвойте `` LineSeparators: = #$a`` и ``LinePairedSeparator: = &#39;&#39;`` (пустая строка).

source: If you want to accept as line separators only ``\x0D\x0A`` but not ``\x0D`` or ``\x0A`` alone, then assign ``LineSeparators := ''`` (empty string) and ``LinePairedSeparator := #$d#$a``.
bg: Ако искате да приемете като разделители на редове само ``x0D0A``, но не и ``0D`` или ``0A``, задайте `` LineSeparators: = &#39;&#39; `(празен низ) и `` LinePairedSeparator: = # $ d # $ a``.
ru: Если вы хотите принять в качестве разделителей строк только `` \ x0D \ x0A``, но не ``\x0D`` или ``\x0A``, тогда присвойте ``LineSeparators: = &#39;&#39;`` (пустая строка) и ``LinePairedSeparator: = #$d#$a``.

source: Compiles regular expression.
bg: Компилира регулярния израз.
ru: Компилирует регулярное выражение.

source: Useful for example for GUI regular expressions editors - to check regular expression without using it.
bg: Полезно например за редакторите на регулярни изрази с графичен интерфейс - за да проверите регулярния израз без да го използвате.
ru: Полезно, например, для редакторов регулярных выражений в графическом интерфейсе - для проверки регулярных выражений без их использования.

source: Show ``P-code`` (compiled regular expression) as human-readable string.
bg: Покажете ``P-code`` (компилиран редовен израз) като четлив за човека низ.
ru: Показать ``P-код`` (скомпилированное регулярное выражение) в виде удобочитаемой строки.

source: Escape-char, by default ``\``.
bg: Escape-char, по подразбиране `` `.
ru: Escape-char, по умолчанию ``\``.

source: `Modifier i <regexp_syntax.html#i>`_ default value
bg: &quot;Модификатор i <regexp_syntax.html#i>`_ стойност по подразбиране
ru: `Модификатор i <regexp_syntax.html#i>`_ значение по умолчанию

source: `Modifier r <regexp_syntax.html#r>`_ default value
bg: `Модификатор r <regexp_syntax.html#r>`_ стойност по подразбиране
ru: `Модификатор r <regexp_syntax.html#r>`_ значение по умолчанию

source: `Modifier s <regexp_syntax.html#s>`_ default value
bg: `Модификатор s <regexp_syntax.html#s>`_ стойност по подразбиране
ru: `Модификатор s <regexp_syntax.html#s>`_ значение по умолчанию

source: `Modifier g <regexp_syntax.html#g>`_ default value
bg: `Модификатор g <regexp_syntax.html#g>`_ стойност по подразбиране
ru: `Модификатор g <regexp_syntax.html#g>`_ значение по умолчанию

source: `Modifier m <regexp_syntax.html#m>`_ default value
bg: `Модификатор m <regexp_syntax.html#m>`_ стойност по подразбиране
ru: `Модификатор m <regexp_syntax.html#m>`_ значение по умолчанию

source: `Modifier x <regexp_syntax.html#x>`_ default value
bg: `Модификатор x <regexp_syntax.html#x>`_ стойност по подразбиране
ru: `Модификатор х <regexp_syntax.html#x>`_ значение по умолчанию

source: Default for SpaceChars_ property
bg: По подразбиране за свойството SpaceChars_
ru: По умолчанию для свойства SpaceChars_

source: Default value for WordChars_ property
bg: Стойност по подразбиране за свойството WordChars_
ru: Значение по умолчанию для свойства WordChars_

source: Default value for LineSeparators_ property
bg: Стойност по подразбиране за свойството LineSeparators_
ru: Значение по умолчанию для свойства LineSeparators_

source: Default value for LinePairedSeparator_ property
bg: Стойност по подразбиране за свойството LinePairedSeparator_
ru: Значение по умолчанию для свойства LinePairedSeparator_

source: Default for InvertCase_ property
bg: По подразбиране за свойството InvertCase_
ru: По умолчанию для свойства InvertCase_

source: Global functions
bg: Глобални функции
ru: Глобальные функции

source: All this functionality is available as methods of ``TRegExpr``, but with global functions you do not need to create ``TReExpr`` instance so your code would be more simple if you just need one function.
bg: Цялата тази функционалност е достъпна като методи на ``TRegExpr``, но с глобални функции не е необходимо да създавате ``TReExpr`` екземпляр, така че вашият код да бъде по-прост, ако имате нужда само от една функция.
ru: Вся эта функциональность доступна как методы ``TRegExpr``, но с глобальными функциями вам не нужно создавать экземпляр ``TReExpr``, поэтому ваш код будет более простым, если вам просто понадобится одна функция.

source: true if the string matches the regular expression. Just as Exec_ in ``TRegExpr``.
bg: true, ако низът съответства на регулярния израз. Точно като Exec_ в &quot;TRegExpr&quot;.
ru: Значение true, если строка соответствует регулярному выражению. Так же, как Exec_ в ``TRegExpr``.

source: Splits the string by regular expressions. See also Split_ if you prefer to create ``TRegExpr`` instance explicitly.
bg: Разделя низа с регулярни изрази. Вижте също Split_, ако предпочитате да създадете екземпляр ``TRegExpr`` изрично.
ru: Разбивает строку по регулярным выражениям. Смотрите также Split_, если вы предпочитаете явно создавать экземпляр ``TRegExpr``.
