Repository: Alexey-T/TRegExpr
Catalog: docs/locale/*/LC_MESSAGES/tregexpr_interface.po
Languages: bg, es_es, fr_fr, ru, ru_ru

source: Note, that some subexpr. may be not found and for such subexpr. MathPos=MatchLen=-1 and Match=’’.
es_es: Tenga en cuenta, que algunos subexpr. No se pueden encontrar y para tales subexpr. MathPos = MatchLen = -1 y Match = &#39;&#39;.
fr_fr: Notez que certains subexpr. peut ne pas être trouvé et pour ces subexpr. MathPos = MatchLen = -1 et Match = &#39;&#39;.
ru_ru: Обратите внимание, что некоторые субэкспр. может быть не найден и для такого подэкспр. MathPos = MatchLen = -1 и Match = &#39;&#39;.

source: pos of entrance subexpr. ``#Idx`` into tested in last ``Exec*`` string. First subexpr. have ``Idx=1``, last - ``MatchCount``, whole r.e. have ``Idx=0``.
bg: поз. `` # Idx`` се тества в последния `` Exec * `` низ. Първият субекср. има `` Idx = 1``, последно - ``MatchCount``, цялото re има `` Idx = 0``.
es_es: pos de entrada subexpr. `` # Idx`` en probado en la última cadena `` Exec * ``. Primer subexpr. tiene `` Idx = 1``, último - `` MatchCount``, todo lo que tiene `` Idx = 0``.
fr_fr: pos d&#39;entrée subexpr. `` # # Idx`` dans testé dans la dernière chaîne `` Exec * ``. Premier sous-représentant ont `` Idx = 1``, dernier - `` MatchCount``, tout le monde a `` Idx = 0``.
ru: pos въезда субэкспр. `` # Idx`` в проверенную в последней строке `` Exec * ``. Первый субэкспр. иметь `` Idx = 1``, последний - ``MatchCount``, все &#39;имеют `` Idx = 0``.
ru_ru: pos въезда субэкспр. `` # Idx`` в проверенную в последней строке `` Exec * ``. Первый субэкспр. иметь `` Idx = 1``, последний - `` MatchCount``, все &#39;имеют `` Idx = 0``.

source: Returns ``-1`` if in r.e. no such subexpr. or this subexpr. not found in input string.
bg: Връща ``-1``, ако не е такъв. или този субекспр. не е намерен във входния низ.
es_es: Devuelve `` -1`` si no existe dicho subexpr. o este subexpr. no se encuentra en la cadena de entrada.
fr_fr: Retourne `` -1`` s&#39;il n&#39;y a pas de tel sous-expression. ou ce subexpr. introuvable dans la chaîne d&#39;entrée.
ru: Возвращает ``-1``, если нет такого субэкспра. или этот подэкспр. не найден во входной строке.
ru_ru: Возвращает `` -1``, если нет такого субэкспра. или этот подэкспр. не найден во входной строке.

source: len of entrance subexpr. ``#Idx`` r.e. into tested in last ``Exec*`` string. First subexpr. have ``Idx=1``, last - MatchCount, whole r.e. have ``Idx=0``.
bg: от входния субекспр. `` # Idx`` се тества в последния `` Exec * `` низ. Първият субекср. да има `` Idx = 1``, последно - MatchCount, целият има `` Idx = 0``.
es_es: len de entrada subexpr. `` # Idx`` se probó en la última cadena `` Exec * ``. Primer subexpr. tiene `` Idx = 1``, último - MatchCount, todo lo que tiene `` Idx = 0``.
fr_fr: len d&#39;entrée subexpr. `` # # Idx`` est testé dans la dernière chaîne `` Exec * ``. Premier sous-représentant ont `` Idx = 1``, dernier - MatchCount, tout le monde a `` Idx = 0``.
ru: лен въездной субэкспр. `` # Idx`` проверяется в последней строке `` Exec * ``. Первый субэкспр. иметь `` Idx = 1``, последний - MatchCount, все &#39;иметь `` Idx = 0``.
ru_ru: лен въездной субэкспр. `` # Idx`` проверяется в последней строке `` Exec * ``. Первый субэкспр. иметь `` Idx = 1``, последний - MatchCount, все &#39;иметь `` Idx = 0``.

source: Returns -1 if in r.e. no such subexpr. or this subexpr. not found in input string.
bg: Връща -1, ако не е такъв. или този субекспр. не е намерен във входния низ.
es_es: Devuelve -1 si no hay subexpr. o este subexpr. no se encuentra en la cadena de entrada.
fr_fr: Renvoie -1 s&#39;il n&#39;y a pas de tel sous-expression. ou ce subexpr. introuvable dans la chaîne d&#39;entrée.
ru: Возвращает -1, если в подобном подэкспресе нет. или этот подэкспр. не найден во входной строке.
ru_ru: Возвращает -1, если в подобном подэкспресе нет. или этот подэкспр. не найден во входной строке.

source: Match
bg: Мач
es_es: Partido
fr_fr: Rencontre
ru: Матч
ru_ru: Матч

source: Returns ’’ if in r.e. no such subexpr. or this subexpr. not found in input string.
es_es: Devuelve &#39;&#39; si no hay subexpr. o este subexpr. no se encuentra en la cadena de entrada.
fr_fr: Retourne &#39;&#39; s&#39;il n&#39;y a pas de tel sous-expression. ou ce subexpr. introuvable dans la chaîne d&#39;entrée.
ru_ru: Возвращает &#39;&#39;, если в таком нет такого субэкспр. или этот подэкспр. не найден во входной строке.

source: Returns ID of last error, 0 if no errors (unusable if Error method raises exception) and clear internal status into 0 (no errors).
es_es: Devuelve el ID del último error, 0 si no hay errores (inutilizable si el método de error genera una excepción) y borra el estado interno a 0 (sin errores).
fr_fr: Renvoie l&#39;ID de la dernière erreur, 0 si aucune erreur (inutilisable si la méthode Error génère une exception) et efface le statut interne en 0 (pas d&#39;erreurs).
ru_ru: Возвращает идентификатор последней ошибки, 0, если ошибок нет (невозможно использовать, если метод Error вызывает исключение) и очищает внутренний статус в 0 (ошибок нет).

source: Returns Error message for error with ID = AErrorID.
es_es: Devuelve el mensaje de error por error con ID = AErrorID.
fr_fr: Renvoie un message d&#39;erreur pour une erreur avec ID = AErrorID.
ru_ru: Возвращает сообщение об ошибке для ошибки с ID = AErrorID.

source: Returns pos in r.e. there compiler stopped.
bg: Връща пози в ре там компилаторът спря.
es_es: Devuelve pos en el compilador re detenido.
fr_fr: Retourne le poseur là où le compilateur est arrêté.
ru: Возвращает pos в ре там компилятор остановился.
ru_ru: Возвращает pos в ре там компилятор остановился.

source: Usefull for error diagnostics
es_es: Útil para el diagnóstico de errores.
fr_fr: Utile pour le diagnostic d&#39;erreur
ru_ru: Полезно для диагностики ошибок

source: Contains chars, treated as \\s (initially filled with RegExprSpaceChars global constant)
es_es: Contiene caracteres, tratados como \\ s (inicialmente rellenados con la constante global RegExprSpaceChars)
fr_fr: Contient des caractères, traités comme \\ s (initialement remplis avec la constante globale RegExprSpaceChars)
ru_ru: Содержит символы, которые рассматриваются как \\ s (изначально заполненные глобальной константой RegExprSpaceChars)

source: Contains chars, treated as \\w (initially filled with RegExprWordChars global constant)
es_es: Contiene caracteres, tratados como \\ w (inicialmente con la constante global RegExprWordChars)
fr_fr: Contient des caractères, traités comme \\ w (initialement remplis avec la constante globale RegExprWordChars)
ru_ru: Содержит символы, которые рассматриваются как \\ w (изначально заполненные глобальной константой RegExprWordChars)

source: line separators (like ``\n`` in Unix), initially filled with RegExprLineSeparators global constant)
es_es: separadores de línea (como `` \ n`` en Unix), inicialmente rellenados con la constante global RegExprLineSeparators)
fr_fr: séparateurs de lignes (comme `` \ n`` dans Unix), initialement renseignés avec la constante globale RegExprLineSeparators)
ru_ru: разделители строк (например, `` \ n`` в Unix), изначально заполненные глобальной константой RegExprLineSeparators)

source: see also `about line separators <regexp_syntax.html#syntax_line_separators>`__
es_es: vea también `sobre separadores de línea <regexp_syntax.html#syntax_line_separators> `__
fr_fr: voir aussi `à propos des séparateurs de lignes <regexp_syntax.html#syntax_line_separators> `__
ru_ru: смотрите также `о разделителях строк <regexp_syntax.html#syntax_line_separators> `__

source: paired line separator (like ``\r\n`` in DOS and Windows).
bg: разделител на сдвоена линия (като &quot;r&quot; в DOS и Windows).
es_es: separador de línea emparejado (como `` \ r \ n`` en DOS y Windows).
fr_fr: séparateur de lignes jumelé (comme `` \ \ r \ n`` sous DOS et Windows).
ru: разделитель парных строк (например, `` `` в DOS и Windows).
ru_ru: разделитель парных строк (например, `` \ r \ n`` в DOS и Windows).

source: must contain exactly two chars or no chars at all, initially filled with RegExprLinePairedSeparator global constant)
bg: трябва да съдържа точно два знака или никакви символа, първоначално запълнени с глобална константа RegExprLinePairedSeparator)
es_es: debe contener exactamente dos caracteres o ningún carácter, inicialmente con la constante global RegExprLinePairedSeparator)
fr_fr: doit contenir exactement deux caractères ou aucun caractère, initialement renseignés avec la constante globale RegExprLinePairedSeparator)
ru: должен содержать ровно два символа или вообще не содержать символов, изначально заполненных глобальной константой RegExprLinePairedSeparator)
ru_ru: должен содержать ровно два символа или вообще не содержать символов, изначально заполненных глобальной константой RegExprLinePairedSeparator)

source: For example, if You need Unix-style behaviour, assign LineSeparators := #\ :math:`a (newline character) and LinePairedSeparator := '' (empty string), if You want to accept as line separators only `\x0D\x0A` but not `\x0D` or `\x0A` alone, then assign `LineSeparators := ''` (empty string) and `LinePairedSeparator := #`\ d#$a`.
es_es: Por ejemplo, si necesita un comportamiento estilo Unix, asigne LineSeparators: = # \: math: `a (carácter de nueva línea) y LinePairedSeparator: = &#39;&#39; (cadena vacía), si desea aceptar como separadores de línea solamente` \ x0D \ x0A` pero no `\ x0D` o` \ x0A` solo, luego asigne `LineSeparators: = &#39;&#39;` (cadena vacía) y `LinePairedSeparator: = #` \ d # $ a`.
fr_fr: Par exemple, si vous avez besoin d&#39;un comportement de style Unix, affectez LineSeparators: = # \: math: `a (caractère de nouvelle ligne) et LinePairedSeparator: = &#39;&#39; (chaîne vide), si vous souhaitez accepter uniquement les séparateurs de ligne` \ x0D \. x0A` mais pas `\ x0D` ou` \ x0A`, affectez ensuite `LineSeparators: = &#39;&#39; (chaîne vide) et` LinePairedSeparator: = # `\ d # $ a`.
ru_ru: Например, если вам нужно поведение в стиле Unix, присвойте LineSeparators: = # \: math: `a (символ новой строки) и LinePairedSeparator: = &#39;&#39; (пустая строка), если вы хотите принять в качестве разделителей строк только` \ x0D \ x0A`, но не `\ x0D` или` \ x0A`, затем назначьте `LineSeparators: = &#39;&#39;` (пустая строка) и `LinePairedSeparator: = #` \ d # $ a`.

source: By default ‘mixed’ mode is used (defined in RegExprLine[Paired]Separator[s] global constants):
bg: По подразбиране се използва &#39;смесен&#39; режим (дефиниран в RegExprLine [Paired] Сепаратор [s] глобални константи):
es_es: Por defecto, se usa el modo &#39;mixto&#39; (definido en RegExprLine [Paired] Separator [s] constantes globales):
fr_fr: Par défaut, le mode &quot;mixte&quot; est utilisé (défini dans les constantes globales RegExprLine [Paired] Separator [s]):
ru: По умолчанию используется смешанный режим (определенный в глобальных константах разделителя RegExprLine [Paired]):
ru_ru: По умолчанию используется смешанный режим (определенный в глобальных константах разделителя RegExprLine [Paired]):

source: Behaviour of this mode is detailed described in the `syntax section <regexp_syntax.html#syntax_line_separators>`__.
bg: Поведението на този режим е описано подробно в `синтактичния раздел <regexp_syntax.html#syntax_line_separators>`__.
es_es: El comportamiento de este modo se describe detalladamente en la sección de &#39;sintaxis&#39; <regexp_syntax.html#syntax_line_separators> `__.
fr_fr: Le comportement de ce mode est décrit en détail dans la section `syntaxe <regexp_syntax.html#syntax_line_separators> `__.
ru: Поведение этого режима подробно описано в разделе «Синтаксис». <regexp_syntax.html#syntax_line_separators>`__.
ru_ru: Поведение этого режима подробно описано в разделе «Синтаксис». <regexp_syntax.html#syntax_line_separators> `__.

source: Set this property if you want to override case-insensitive functionality.
bg: Задайте това свойство, ако искате да замените функционалността без чувствителност към регистър.
es_es: Establezca esta propiedad si desea anular una funcionalidad que no distinga mayúsculas y minúsculas.
fr_fr: Définissez cette propriété si vous souhaitez remplacer la fonctionnalité ne respectant pas la casse.
ru: Установите это свойство, если вы хотите переопределить независимую от регистра функциональность.
ru_ru: Установите это свойство, если вы хотите переопределить независимую от регистра функциональность.

source: Create set it to RegExprInvertCaseFunction (InvertCaseFunction by default)
es_es: Crear configurarlo en RegExprInvertCaseFunction (InvertCaseFunction por defecto)
fr_fr: Créer le définir sur RegExprInvertCaseFunction (InvertCaseFunction par défaut)
ru_ru: Создать установить его в RegExprInvertCaseFunction (InvertCaseFunction по умолчанию)

source: Compile
bg: събирам
es_es: Compilar
fr_fr: Compiler
ru_ru: компилировать

source: [Re]compile r.e. Usefull for example for GUI r.e. editors (to check all properties validity).
es_es: [Re] compile re Usefull por ejemplo para re editores de GUI (para verificar la validez de todas las propiedades).
fr_fr: [Re] compile re Utile par exemple pour les éditeurs GUI re (pour vérifier la validité de toutes les propriétés).
ru_ru: [Re] compile re Usefull, например, для редакторов GUI (чтобы проверить правильность всех свойств).

source: Dump
bg: бунище
es_es: Tugurio
fr_fr: Déverser
ru_ru: свалка

source: dump a compiled regexp in vaguely comprehensible form
es_es: volcar una expresión regular compilada en forma vagamente comprensible
fr_fr: dump une expression rationnelle compilée sous une forme vaguement compréhensible
ru_ru: сбросить скомпилированное регулярное выражение в неопределенно понятной форме

source: Global constants
bg: Глобални константи
es_es: Constantes globales
fr_fr: Constantes globales
ru: Глобальные константы
ru_ru: Глобальные константы

source: EscChar = ‘\\’; // ‘Escape’-char (‘\\’ in common r.e.) used for escaping metachars (\w, \\d etc).
es_es: EscChar = &#39;\\&#39;; // &#39;Escape&#39;-char (&#39; \\ &#39;en común re) se usa para escapar metacargares (\ w, \\ d, etc.).
fr_fr: EscChar = &#39;\\&#39;; // &#39;Escape&#39;-char (&#39; \\ &#39;dans commun re) utilisé pour échapper des métachars (\ w, \\ d etc).
ru_ru: EscChar = &#39;\\&#39;; // &#39;Escape&#39;-char (&#39;\\&#39; в общем re) используется для экранирования метачаров (\ w, \\ d и т. Д.).

source: // it’s may be usefull to redefine it if You are using C++ Builder - to avoide ugly constructions
es_es: // puede ser útil para redefinirlo si está utilizando C ++ Builder - para evitar construcciones feas
fr_fr: // il peut être utile de le redéfinir si vous utilisez C ++ Builder - pour éviter les constructions laides
ru_ru: // может быть полезно переопределить его, если вы используете C ++ Builder - чтобы избежать уродливых конструкций

source: // like ‘\\\w+\\\\\\w+\\.\\w+’ - just define EscChar=‘/’ and use ‘/w+\/w+/./w+’
es_es: // me gusta &#39;\\\ w + \\\\\\ w + \\. \\ w +&#39; - simplemente define EscChar = &#39;/&#39; y usa &#39;/w+\/w+/./w+&#39;
fr_fr: // comme &#39;\\\ w + \\\\\\ w + \\. \\ w +&#39; - définissez simplement EscChar = &#39;/&#39; et utilisez &#39;/w+\/w+/./w+&#39;
ru_ru: // как &#39;\\\ w + \\\\\\ w + \\. \\ w +&#39; - просто определите EscChar = &#39;/&#39; и используйте &#39;/w+\/w+/./w+&#39;

source: Modifiers default values:
es_es: Modificadores de valores por defecto:
fr_fr: Les valeurs par défaut des modificateurs:
ru_ru: Значения модификаторов по умолчанию:

source: RegExprSpaceChars : RegExprString = ‘’#\ :math:`9\#`\ A#\ :math:`D\#`\ C;
es_es: RegExprSpaceChars: RegExprString = &#39;&#39; # \: math: `9 \ #` \ A # \: math: `D \ #` \ C;
fr_fr: RegExprSpaceChars: RegExprString = &#39;&#39; # \: math: `9 \ #` \ A # \: math: `D \ #` \ C;
ru_ru: RegExprSpaceChars: RegExprString = &#39;&#39; # \: математика: `9 \ #` \ A # \: математика: `D \ #` \ C;

source: // default for SpaceChars property
es_es: // por defecto para la propiedad SpaceChars
fr_fr: // valeur par défaut pour la propriété SpaceChars
ru_ru: // по умолчанию для свойства SpaceChars

source: + ‘abcdefghijklmnopqrstuvwxyz’
es_es: + &#39;abcdefghijklmnopqrstuvwxyz&#39;
fr_fr: + &#39;abcdefghijklmnopqrstuvwxyz&#39;
ru_ru: + &#39;abcdefghijklmnopqrstuvwxyz&#39;

source: + ‘ABCDEFGHIJKLMNOPQRSTUVWXYZ\_’;
es_es: + &#39;ABCDEFGHIJKLMNOPQRSTUVWXYZ \ _&#39;;
fr_fr: + &#39;ABCDEFGHIJKLMNOPQRSTUVWXYZ \ _&#39;;
ru_ru: + &#39;ABCDEFGHIJKLMNOPQRSTUVWXYZ \ _&#39;;

source: // default value for WordChars property
es_es: // valor predeterminado para la propiedad WordChars
fr_fr: // valeur par défaut pour la propriété WordChars
ru_ru: // значение по умолчанию для свойства WordChars

source: // default value for LineSeparators property
es_es: // valor predeterminado para la propiedad LineSeparators
fr_fr: // valeur par défaut pour la propriété LineSeparators
ru_ru: // значение по умолчанию для свойства LineSeparators

source: #\ :math:`d\#`\ a;
ru_ru: # \: математика: `d \ #` \ a;

source: // default value for LinePairedSeparator property
es_es: // valor predeterminado para la propiedad LinePairedSeparator
fr_fr: // valeur par défaut pour la propriété LinePairedSeparator
ru_ru: // значение по умолчанию для свойства LinePairedSeparator

source: // default for InvertCase property
es_es: // por defecto para la propiedad InvertCase
fr_fr: // valeur par défaut pour la propriété InvertCase
ru_ru: // по умолчанию для свойства InvertCase

source: Usefull global functions
es_es: Funciones globales útiles.
fr_fr: Fonctions globales utiles
ru_ru: Полезные глобальные функции

source: true if string AInputString match regular expression ARegExpr
es_es: true si la cadena AInputString coincide con la expresión regular ARegExpr
fr_fr: true si la chaîne AInputString correspond à l&#39;expression régulière ARegExpr
ru_ru: истина, если строка AInputString соответствует регулярному выражению ARegExpr

source: ! will raise exeption if syntax errors in ARegExpr
es_es: ! generará excepciones si los errores de sintaxis en ARegExpr
fr_fr: ! lève l&#39;exception si des erreurs de syntaxe dans ARegExpr
ru_ru: ! повысит исключение, если синтаксические ошибки в ARegExpr

source: Split AInputStr into APieces by r.e. ARegExpr occurencies
es_es: Dividir AInputStr en piezas por repeticiones ARegExpr
fr_fr: Fractionner AInputStr en APieces par les occurrences ARegExpr
ru_ru: Разделить AInputStr на APE по повторным событиям ARegExpr

source: Returns AInputStr with r.e. occurencies replaced by AReplaceStr.
es_es: Devuelve AInputStr con repeticiones sustituidas por AReplaceStr.
fr_fr: Renvoie AInputStr avec les occurrences d&#39;origine remplacées par AReplaceStr.
ru_ru: Возвращает AInputStr с повторениями, замененными AReplaceStr.

source: If AUseSubstitution is true, then AReplaceStr will be used as template for Substitution methods.
es_es: Si AUseSubstitution es verdadero, entonces AReplaceStr se usará como plantilla para los métodos de Sustitución.
fr_fr: Si AUseSubstitution est true, alors AReplaceStr sera utilisé comme modèle pour les méthodes de substitution.
ru_ru: Если AUseSubstitution имеет значение true, то AReplaceStr будет использоваться в качестве шаблона для методов подстановки.

source: Replace all metachars with its safe representation, for example ‘abc\ :math:`cd.(' converts into 'abc\\`\ cd\.\(’
es_es: Reemplace todos los metacarares con su representación segura, por ejemplo, &#39;abc \: math: `cd. (&#39; Se convierte en &#39;abc \\` \ cd \. \ (&#39;
fr_fr: Remplacez tous les métachars par sa représentation sûre, par exemple &#39;abc \: math: `cd. (&#39; Est converti en &#39;abc \\` \ cd \. \ (&#39;
ru_ru: Замените все мета-символы его безопасным представлением, например, &#39;abc \: math: `cd. (&#39; Преобразуется в &#39;abc \\` \ cd \. \ (&#39;

source: This function usefull for r.e. autogeneration from user input
bg: Тази функция е полезна за повторно автоматично генериране от потребителския вход
es_es: Esta función es útil para la autogeneración desde la entrada del usuario.
fr_fr: Cette fonction est utile pour la régénération automatique à partir d’une entrée utilisateur.
ru: Эта функция полезна для повторного автогенерации из пользовательского ввода
ru_ru: Эта функция полезна для повторного автогенерации из пользовательского ввода

source: Makes list of subexpressions found in ARegExpr r.e.
es_es: Hace una lista de subexpresiones encontradas en ARegExpr re
fr_fr: Donne la liste des sous-expressions trouvées dans ARegExpr re
ru_ru: Составляет список подвыражений, найденных в ARegExpr re

source: In ASubExps every item represent subexpression, from first to last, in format:
es_es: En ASubExps, cada elemento representa una subexpresión, de la primera a la última, en formato:
fr_fr: Dans ASubExps, chaque élément représente une sous-expression, du premier au dernier, au format suivant:
ru_ru: В ASubExps каждый элемент представляет подвыражение, от первого до последнего, в формате:

source: String - subexpression text (without ‘()’)
bg: String - текст с подекспресия (без „()“)
es_es: Cadena - texto de subexpresión (sin &#39;()&#39;)
fr_fr: String - texte de sous-expression (sans &#39;()&#39;)
ru: String - текст подвыражения (без '()')
ru_ru: String - текст подвыражения (без &#39;()&#39;)

source: low word of Object - starting position in ARegExpr, including ‘(’ if exists! (first position is 1)
bg: ниска дума на обект - начална позиция в ARegExpr, включително &#39;(&#39; ако съществува! (първа позиция е 1)
es_es: baja palabra de Objeto - posición inicial en ARegExpr, incluyendo &#39;(&#39; si existe! (la primera posición es 1)
fr_fr: mot bas de l&#39;objet - position de départ dans ARegExpr, y compris &#39;(&#39; s&#39;il existe! (la première position est 1)
ru: младшее слово Object - начальная позиция в ARegExpr, включая &#39;(&#39; если существует! (первая позиция 1)
ru_ru: младшее слово Object - начальная позиция в ARegExpr, включая &#39;(&#39; если существует! (первая позиция 1)

source: high word of Object - length, including starting ‘(’ and ending ‘)’ if exist!
bg: висока дума на обект - дължина, включително начална &#39;(&#39; и завършваща &#39;)&#39; ако съществуват!
es_es: palabra alta de Objeto - longitud, incluyendo el inicio &#39;(&#39; y el final &#39;)&#39; si existe!
fr_fr: mot haut de longueur d&#39;objet, y compris le début &#39;(&#39; et la fin &#39;)&#39; s&#39;il existe!
ru: старшее слово Object - длина, включая начало ((и окончание)), если существует!
ru_ru: старшее слово Object - длина, включая начало &#39;(&#39; и окончание &#39;)&#39;, если существует!

source: AExtendedSyntax - must be True if modifier /x will be On while using the r.e.
es_es: AExtendedSyntax: debe ser True si el modificador / x estará activado mientras se usa la re
fr_fr: AExtendedSyntax - doit être True si modificateur / x sera activé lors de l&#39;utilisation de la
ru_ru: AExtendedSyntax - должно быть True, если модификатор / x будет включен при использовании re

source: Usefull for GUI editors of r.e. etc (You can find example of using in `TestRExp.dpr <#regexpstudio.html>`__ project)
es_es: Útil para los editores de GUI de re, etc. (Puede encontrar un ejemplo de uso en `TestRExp.dpr &lt;# regexpstudio.html&gt;` __ project)
fr_fr: Utile pour les éditeurs graphiques, etc. (vous pouvez trouver des exemples d&#39;utilisation dans `TestRExp.dpr &lt;# regexpstudio.html&gt;` __ projet)
ru_ru: Полезно для графических редакторов и т. Д. (Вы можете найти пример использования в `TestRExp.dpr &lt;# regexpstudio.html&gt;` __ project)

source: Result code Meaning
es_es: Código de resultado Significado
fr_fr: Code de résultat Signification
ru_ru: Код результата Значение

source: 0 Success. No unbalanced brackets was found;
es_es: 0 Éxito. No se encontraron corchetes desequilibrados;
fr_fr: 0 succès. Aucun support déséquilibré n&#39;a été trouvé;
ru_ru: 0 Успех. Несбалансированные скобки не были найдены;
