Repository: Alexey-T/TRegExpr
Catalog: docs/locale/*/LC_MESSAGES/tregexpr_interface.po
Languages: bg, es_es, fr_fr, ru, ru_ru

source: Public methods and properties of TRegExpr class
es_es: Métodos públicos y propiedades de la clase TRegExpr.
fr_fr: Méthodes publiques et propriétés de la classe TRegExpr
ru_ru: Публичные методы и свойства класса TRegExpr

source: Return major and minor version, for example, for v. 0.944 VersionMajor = 0 and VersionMinor = 944
bg: Върнете основната и второстепенната версия, например, за v. 0.944 VersionMajor = 0 и VersionMinor = 944
es_es: Devuelva las versiones principales y secundarias, por ejemplo, para v. 0.944 VersionMajor = 0 y VersionMinor = 944
fr_fr: Renvoie les versions majeure et mineure, par exemple, pour la version 0.944 VersionMajor = 0 et VersionMinor = 944
ru: Мажорная и минорная версии, например, для версии 0.944 ``VersionMajor = 0`` и ``VersionMinor = 944``
ru_ru: Возврат основной и вспомогательной версии, например, для версии 0.944 VersionMajor = 0 и VersionMinor = 944

source: Expression
bg: изразяване
es_es: Expresión
ru_ru: выражение

source: Regular expression.
bg: Редовен израз.
es_es: Expresión regular.
fr_fr: Expression régulière.
ru: Регулярное выражение.
ru_ru: Регулярное выражение.

source: For optimization, TRegExpr will automatically compiles it into ‘P-code’ (You can see it with help of Dump method) and stores in internal structures. Real [re]compilation occures only when it really needed - while calling Exec[Next], Substitute, Dump, etc and only if Expression or other P-code affected properties was changed after last [re]compilation.
es_es: Para la optimización, TRegExpr lo compilará automáticamente en &#39;código P&#39; (puede verlo con la ayuda del método de volcado) y se almacena en estructuras internas. La [re] compilación real ocurre solo cuando realmente se necesita, al llamar a Exec [Siguiente], Sustituir, Volcar, etc. y solo si la Expresión u otras propiedades afectadas por el código P se cambiaron después de la última [re] compilación.
fr_fr: Pour l&#39;optimisation, TRegExpr le compilera automatiquement en &quot;P-code&quot; (vous pouvez le voir à l&#39;aide de la méthode Dump) et le stockera dans des structures internes. La [re] compilation réelle ne se produit que lorsque cela est vraiment nécessaire - lors de l&#39;appel de Exec [Suivant], Substituer, Dump, etc., et uniquement si Expression ou d&#39;autres propriétés affectées par le code P ont été modifiées après la dernière [re] compilation.
ru_ru: Для оптимизации TRegExpr автоматически скомпилирует его в «P-код» (это можно увидеть с помощью метода Dump) и сохранит во внутренних структурах. Реальная [re] компиляция происходит только тогда, когда это действительно необходимо - при вызове Exec [Next], Substitute, Dump и т. Д., И только в том случае, если после последней [re] компиляции были изменены свойства Expression или другого P-кода.

source: If any errors while [re]compilation occures, Error method is called (by default Error raises exception - see below)
es_es: Si se produce algún error mientras se produce [re] compilación, se llama al método de error (de forma predeterminada, el error genera una excepción, consulte a continuación)
fr_fr: Si des erreurs surviennent pendant la [re] compilation, la méthode Error est appelée (par défaut, Error déclenche une exception - voir ci-dessous).
ru_ru: Если во время компиляции [re] возникают ошибки, вызывается метод Error (по умолчанию Error вызывает исключение - см. Ниже)

source: Set/get default values of `r.e.modifiers <regexp_syntax.html#about_modifiers>`__. Format of the string is similar as in `(?ismx-ismx) <regexp_syntax.html#inline_modifiers>`__. For example ModifierStr := ‘i-x’ will switch on modifier /i, switch off /x and leave unchanged others.
es_es: Establecer / obtener valores predeterminados de `remodificadores <regexp_syntax.html#about_modifiers> `__. El formato de la cadena es similar al de `(? Ismx-ismx) <regexp_syntax.html#inline_modifiers> `__. Por ejemplo, ModifierStr: = &#39;i-x&#39; activará el modificador / i, apagará / x y dejará sin cambios otros.
fr_fr: Définir / obtenir les valeurs par défaut de `remodifiers <regexp_syntax.html#about_modifiers> `__. Le format de la chaîne est similaire à celui de `(?? Ismx-ismx) <regexp_syntax.html#inline_modifiers> `__. Par exemple, ModificateurStr: = &#39;i-x&#39; active le modificateur / i, désactive / x et laisse les autres non modifiés.
ru_ru: Установить / получить значения по умолчанию для remodifiers <regexp_syntax.html#about_modifiers> `__. Формат строки такой же, как в `(? Ismx-ismx) <regexp_syntax.html#inline_modifiers> `__. Например, ModifierStr: = &#39;i-x&#39; включит модификатор / i, выключит / x и оставит остальные без изменений.

source: If you try to set unsupported modifier, Error will be called (by defaul Error raises exception ERegExpr).
es_es: Si intenta establecer un modificador no admitido, se llamará Error (por defecto, el error genera la excepción ERegExpr).
fr_fr: Si vous essayez de définir un modificateur non pris en charge, Error sera appelé (par defaul Error déclenche l&#39;exception ERegExpr).
ru_ru: Если вы попытаетесь установить неподдерживаемый модификатор, будет вызвана ошибка (по умолчанию ошибка вызывает исключение ERegExpr).

source: Modifier /i - (“caseinsensitive”), initialized with `RegExprModifierI <#modifier_defs>`__ value.
bg: Модификатор / i - (&quot;случайно чувствителен&quot;), инициализиран с `RegExprModifierI <#modifier_defs>`__ стойност.
es_es: Modifier / i - (&quot;caseinsensitive&quot;), inicializado con `RegExprModifierI &lt;#modifier_defs&gt;` __ value.
fr_fr: Modificateur / i - («caseinsensitive»), initialisé avec la valeur `RegExprModifierI &lt;#modifier_defs&gt;` __.
ru: Модификатор / i - («caseinsensitive»), инициализируется значением `RegExprModifierI <#regexprmodifieri>`__.
ru_ru: Модификатор / i - («caseinsensitive»), инициализируется значением `RegExprModifierI &lt;#modifier_defs&gt;` __.

source: Modifier /r - (“Russian.syntax extensions), initialized with `RegExprModifierR <#modifier_defs>`__ value.
es_es: Modifier / r - (&quot;Russian.syntax extensions), inicializado con` RegExprModifierR &lt;#modifier_defs&gt; `__ value.
fr_fr: Modificateur / r - («extensions Russian.syntax»), initialisé avec la valeur `RegExprModifierR &lt;#modifier_defs&gt;` __.
ru_ru: Модификатор / r - («Russian.syntax extensions»), инициализируется значением `RegExprModifierR &lt;#modifier_defs&gt;` __.

source: #### ModifierS
es_es: #### modificadores
fr_fr: #### Modificateurs
ru_ru: #### Модификаторы

source: `Modifier /s <regexp_syntax.html#modifier_s>`__ - ‘.’ works as any char (else doesn’t match `LineSeparators <tregexpr_interface.html#lineseparators>`__ and `LinePairedSeparator <tregexpr_interface.html#linepairedseparator>`__), initialized with `RegExprModifierS <#modifier_defs>`__ value.
es_es: `Modificador / s <regexp_syntax.html#modifier_s> `__ - &#39;.&#39; funciona como cualquier char (si no coincide con `LineSeparators <tregexpr_interface.html#lineseparators> `__ y` LinePairedSeparator <tregexpr_interface.html#linepairedseparator> `__), inicializado con` RegExprModifierS &lt;#modifier_defs&gt; `__ valor.
fr_fr: `Modificateur / s <regexp_syntax.html#modifier_s> &quot;__ -&quot;. &quot; fonctionne comme n&#39;importe quel caractère (sinon ne correspond à `LineSeparators <tregexpr_interface.html#lineseparators> `__ et` LinePairedSeparator <tregexpr_interface.html#linepairedseparator> `__), initialisé avec` RegExprModifierS &lt;#modifier_defs&gt; `__ valeur.
ru_ru: `Модификатор / ы <regexp_syntax.html#modifier_s> `__ - &#39;.&#39; работает как любой символ (иначе не соответствует `LineSeparators <tregexpr_interface.html#lineseparators> `__ и` LinePairedSeparator <tregexpr_interface.html#linepairedseparator> `__), инициализируется значением` RegExprModifierS &lt;#modifier_defs&gt; `__.

source: #### ModifierG
ru_ru: #### МодификаторG

source: `Modifier /g <regexp_syntax.html#modifier_g>`__ Switching off modifier /g switchs all operators in non-greedy style, so if ModifierG = False, then all ‘\*’ works as ‘\*?’, all ‘+’ as ‘+?’ and so on, initialized with `RegExprModifierG <#modifier_defs>`__ value.
bg: &quot;Модификатор / g <regexp_syntax.html#modifier_g>`__ Изключване на модификатора / g превключва всички оператори в алчен стил, така че ако ModifierG = False, то всички &#39;&#39; &#39;&#39; работят като &#39;*?&#39;, Всички &#39;+&#39; като &#39;+?&#39; и т.н., инициализирани с `RegExprModifierG <#modifier_defs>`__ стойност.
es_es: `Modificador / g <regexp_syntax.html#modifier_g> `__ Apagar modifier / g cambia todos los operadores en un estilo no codicioso, entonces si ModifierG = False, entonces todos &#39;\ *&#39; funcionan como &#39;\ *?&#39;, Todos &#39;+&#39; como &#39;+?&#39; y así sucesivamente, inicializado con `RegExprModifierG &lt;#modifier_defs&gt;` __ valor.
fr_fr: `Modificateur / g <regexp_syntax.html#modifier_g> `__ La désactivation du modificateur / g bascule tous les opérateurs dans un style non-glouton. Ainsi, si ModificateurG = Faux, tous les &#39;\ *&#39; fonctionnent comme &#39;\ *?&#39;, Tous les &#39;+&#39; comme &#39;+?&#39; et ainsi de suite, initialisé avec `RegExprModifierG &lt;#modifier_defs&gt;` __ valeur.
ru: `Модификатор /g <regexp_syntax.html#g>`__ Отключение модификатора ``/g`` переключает все операторы в не жадном стиле, поэтому если ``ModifierG = False``, то все ``\*`` работают как ``\*?``, Все ``+`` как ``+?`` и так далее, инициализируется значением `RegExprModifierG <##regexprmodifierg>`__.
ru_ru: `Модификатор / г <regexp_syntax.html#modifier_g> `__ Отключение модификатора / g переключает все операторы в не жадном стиле, поэтому если ModifierG = False, то все &#39;\ *&#39; работают как &#39;\ *?&#39;, Все &#39;+&#39; как &#39;+?&#39; и так далее, инициализируется значением `RegExprModifierG &lt;#modifier_defs&gt;` __.

source: `Modifier /m <regexp_syntax.html#modifier_m>`__ Treat string as multiple lines. That is, change \`^‘and \`$’ from matching at only the very start or end of the string to the start or end of any line anywhere within the string, initialized with `RegExprModifierM <#modifier_defs>`__ value.
bg: `Модификатор / m <regexp_syntax.html#modifier_m>`__ Отнесете низ като множество редове. Това означава, че променяте &#39;^&#39; и &#39;$&#39; от съвпадение само в самото начало или край на низ до начало или край на всеки ред, където и да е в низ, инициализиран с `RegExprModifierM <#modifier_defs>`__ стойност.
es_es: `Modificador / m <regexp_syntax.html#modifier_m> `__ Tratar la cadena como múltiples líneas. Es decir, hacer que \ `^ &#39;y \` $&#39; no coincidan solo al principio o al final de la cadena al comienzo o al final de cualquier línea en cualquier parte de la cadena, inicializada con el valor `RegExprModifierM &lt;#modifier_defs&gt;` __.
fr_fr: `Modificateur / m <regexp_syntax.html#modifier_m> `__ Traiter une chaîne comme plusieurs lignes. Autrement dit, modifiez \ &#39;^&#39; et \ &#39;$&#39; de la correspondance au tout début ou à la fin de la chaîne en début ou en fin de ligne dans la chaîne, initialisée avec la valeur `RegExprModifierM &lt;#modifier_defs&gt;` __.
ru: `Модификатор / м <regexp_syntax.html#modifier_m>`__ Обрабатывать строку как несколько строк. Таким образом, измените \ `^ &#39;и \` $&#39; с соответствия только в самом начале или конце строки на начало или конец любой строки в любом месте строки, инициализированной значением `RegExprModifierM <#regexprmodifierm>`__.
ru_ru: `Модификатор / м <regexp_syntax.html#modifier_m> `__ Обрабатывать строку как несколько строк. Таким образом, измените \ `^ &#39;и \` $&#39; с соответствия только в самом начале или конце строки на начало или конец любой строки в любом месте строки, инициализированной значением `RegExprModifierM &lt;#modifier_defs&gt;` __.

source: #### ModifierX
ru_ru: #### МодификаторX

source: `Modifier /x <regexp_syntax.html#modifier_x>`__ - (“eXtended syntax”), initialized with `RegExprModifierX <#modifier_defs>`__ value.
bg: `Модификатор / x <regexp_syntax.html#modifier_x>`__ - (“ eXtended синтаксис ”), инициализиран с` RegExprModifierX <#modifier_defs>`__ стойност.
es_es: `Modificador / x <regexp_syntax.html#modifier_x> `__ - (&quot; sintaxis extendida &quot;), inicializada con el valor` RegExprModifierX &lt;#modifier_defs&gt; `__.
fr_fr: `Modificateur / x <regexp_syntax.html#modifier_x> `__ - (“ syntaxe eXtended ”), initialisée avec la valeur` RegExprModifierX &lt;#modifier_defs&gt; `__.
ru: `Модификатор /х <regexp_syntax.html#modifier_x>`__ - («расширенный синтаксис»), инициализируется значением `RegExprModifierX <#regexprmodifierx>`__.
ru_ru: `Модификатор / х <regexp_syntax.html#modifier_x> `__ - (« расширенный синтаксис »), инициализируется значением` RegExprModifierX &lt;#modifier_defs&gt; `__.

source: match a programm against a string AInputString
es_es: unir un programa con una cadena AInputString
fr_fr: faire correspondre un programme avec une chaîne AInputString
ru_ru: сопоставить программу со строкой AInputString

source: !!! Exec store AInputString into InputString property
es_es: !!! Exec store AInputString en la propiedad InputString
fr_fr: !!! Magasin Exec AInputString dans la propriété InputString
ru_ru: !!! Exec хранить AInputString в свойстве InputString

source: For Delphi 5 and higher available overloaded versions:
es_es: Para Delphi 5 y versiones superiores sobrecargadas disponibles:
fr_fr: Pour les versions surchargées disponibles de Delphi 5 et versions supérieures:
ru_ru: Для Delphi 5 и выше доступны перегруженные версии:

source: without parameter already assigned to InputString property value
es_es: Sin parámetro ya asignado al valor de la propiedad InputString
fr_fr: sans paramètre déjà affecté à la valeur de la propriété InputString
ru_ru: без параметра, уже назначенного значению свойства InputString

source: Find next match:
es_es: Encuentra el siguiente partido:
fr_fr: Trouver le prochain match:
ru_ru: Найти следующий матч:

source: Without parameter works the same as
bg: Без параметър работи същото като
es_es: Sin parámetro funciona igual que
fr_fr: Sans paramètre fonctionne de la même manière que
ru: Без параметра работает так же, как
ru_ru: Без параметра работает так же, как

source: but it’s more simpler !
es_es: ¡Pero es más simple!
fr_fr: mais c&#39;est plus simple!
ru_ru: но это проще!

source: Raises exception if used without preceeding successful call to Exec\* (Exec, ExecPos, ExecNext).
es_es: Aumenta la excepción si se usa sin preceder una llamada exitosa a Exec \ * (Exec, ExecPos, ExecNext).
fr_fr: Lève une exception si utilisé sans précéder l&#39;appel réussi à Exec \ * (Exec, ExecPos, ExecNext).
ru_ru: Вызывает исключение, если используется без предшествующего успешного вызова Exec \ * (Exec, ExecPos, ExecNext).

source: So You always must use something like
es_es: Así que siempre debes usar algo como
fr_fr: Donc, vous devez toujours utiliser quelque chose comme
ru_ru: Таким образом, вы всегда должны использовать что-то вроде

source: finds match for InputString starting from AOffset position
es_es: encuentra coincidencia para InputString a partir de la posición AOffset
fr_fr: trouve une correspondance pour InputString à partir de la position AOffset
ru_ru: находит соответствие для InputString, начиная с позиции AOffset

source: InputString
ru: Строка ввода
ru_ru: Строка ввода

source: returns current input string (from last Exec call or last assign to this property).
es_es: devuelve la cadena de entrada actual (de la última llamada de Exec o la última asignación a esta propiedad).
fr_fr: retourne la chaîne d&#39;entrée en cours (à partir du dernier appel Exec ou de la dernière affectation à cette propriété).
ru_ru: возвращает текущую строку ввода (из последнего вызова Exec или последнего присваивания этому свойству).

source: Any assignment to this property clear ``Match*`` properties !
es_es: Cualquier asignación a esta propiedad borra las propiedades `` Match * ``!
fr_fr: Toute affectation à cette propriété efface les propriétés `` Match * ``!
ru_ru: Любое присвоение этому свойству очищает `` Match * `` свойства!

source: Substitute
bg: заместител
es_es: Sustituir
fr_fr: Remplacer
ru: Замена
ru_ru: Замена

source: Returns ATemplate with ``$&`` or ``$0`` replaced by whole r.e. occurence and ``$n`` replaced by occurence of subexpression number ``n``.
es_es: Devuelve ATemplate con `` $ &amp; `` o `` $ 0`` reemplazado por repetición completa y `` $ n`` reemplazado por ocurrencia del número de subexpresión `` n``.
fr_fr: Renvoie ATemplate en remplaçant «$ &amp;` »ou« $ 0` »par« occurrence entière »et par« $ n` »par l&#39;apparition du numéro de sous-expression« n ».
ru_ru: Возвращает ATemplate с `` $ &amp; `` или `` $ 0``, замененным целым повторением, а `` $ n`` заменяется появлением числа подвыражения `` n``.

source: If you want place into template raw ``$`` or ``\\``, use prefix ``\\``.
es_es: Si desea colocar en la plantilla raw `` $ `` o `` \\ ``, use el prefijo `` \\ ``.
fr_fr: Si vous voulez placer dans le template raw `` $ `` ou `` \\ ``, utilisez le préfixe `` \\ ``.
ru_ru: Если вы хотите поместить в шаблон raw `` $ `` или `` \\ ``, используйте префикс `` \\ ``.

source: Special symbols:
es_es: Símbolos especiales:
fr_fr: Symboles spéciaux:
ru_ru: Специальные символы:

source: symbol
bg: символ
es_es: símbolo
fr_fr: symbole
ru: условное обозначение
ru_ru: условное обозначение

source: replaced with
es_es: Reemplazado con
fr_fr: remplacé par
ru_ru: заменено на

source: just \\
es_es: sólo \\
fr_fr: juste \\
ru_ru: просто \\

source: :raw-latex:`\n`
ru_ru: : Сырой латекс: `\ n`

source: #\ :math:`d#`\ a (:raw-latex:`\r`:raw-latex:`\n `a s end of line in Windows)
es_es: # \: math: `d #` \ a (: raw-latex: `\ r`: raw-latex:` \ n `como final de línea en Windows)
fr_fr: # \: math: `d #` \ a (: raw-latex: `\ r`: raw-latex:` \ n `en fin de ligne dans Windows)
ru_ru: # \: математика: `d #` \ a (: raw-latex: `\ r`: raw-latex:` \ n `как конец строки в Windows)

source: :raw-latex:`\l`
ru_ru: : Сырой латекс: `\ L`

source: lowcase one next char
bg: запълнете един следващ знак
es_es: lowcase una próxima char
fr_fr: lowcase un prochain personnage
ru: строчный следующий символ
ru_ru: строчный следующий символ

source: :raw-latex:`\L`
ru_ru: : Сырой латекс: `\ L`

source: lowercase all chars after that
bg: след това - малки букви
es_es: en minúsculas todos los caracteres después de eso
fr_fr: minuscule tous les caractères après cela
ru: строчные все символы после этого
ru_ru: строчные все символы после этого

source: :raw-latex:`\u |` uppcase one next char
fr_fr: : raw-latex: `\ u |` uppcase un prochain caractère
ru_ru: : raw-latex: `\ u |` uppcase один следующий символ

source: :raw-latex:`\U`
ru_ru: : Сырой латекс: `\ U`

source: uppercase all chars after that
bg: всички букви след това
es_es: mayúsculas todos los caracteres después de eso
fr_fr: majuscule tous les caractères après cela
ru: заглавные буквы после этого
ru_ru: заглавные буквы после этого

source: Example:
es_es: Ejemplo:
fr_fr: Exemple:
ru_ru: Пример:

source: If you want to place raw digit after ‘$n’ you must delimit n with curly braces ``{}``.
es_es: Si desea colocar un dígito en bruto después de &#39;$ n&#39;, debe delimitar n con llaves &#39;`{}` `.
fr_fr: Si vous voulez placer un chiffre brut après &#39;$ n&#39;, vous devez délimiter n avec des accolades `` {} ``.
ru_ru: Если вы хотите поместить необработанную цифру после &#39;$ n&#39;, вы должны разделить n фигурными скобками `` {} ``.

source: Split
bg: разцепване
es_es: División
fr_fr: Divisé
ru: Трещина
ru_ru: Трещина

source: Split AInputStr into APieces by r.e. occurencies
bg: Разделете AInputStr на APieces чрез повторни прояви
es_es: Dividir AInputStr en piezas por repeticiones
fr_fr: Fractionner AInputStr en APieces par répétitions
ru: Разделить AInputStr на AP по повторным событиям
ru_ru: Разделить AInputStr на AP по повторным событиям

source: Internally calls ``Exec[Next]``
es_es: Llama internamente a `` Exec [Next] ``
fr_fr: Appelle en interne `` Exec [Next] ``
ru_ru: Внутренне вызывает `` Exec [Next] ``

source: Returns AInputStr with r.e. occurencies replaced by AReplaceStr
es_es: Devuelve AInputStr con repeticiones sustituidas por AReplaceStr
fr_fr: Renvoie AInputStr avec les occurrences remplacées par AReplaceStr.
ru_ru: Возвращает AInputStr с повторными событиями, замененными на AReplaceStr

source: If AUseSubstitution is true, then AReplaceStr will be used
es_es: Si AUseSubstitution es verdadero, entonces se utilizará AReplaceStr.
fr_fr: Si AUseSubstitution est vrai, alors AReplaceStr sera utilisé
ru_ru: Если AUseSubstitution имеет значение true, будет использоваться AReplaceStr

source: as template for Substitution methods.
es_es: como plantilla para los métodos de sustitución.
fr_fr: comme modèle pour les méthodes de substitution.
ru_ru: как шаблон для методов подстановки.

source: For example:
es_es: Por ejemplo:
fr_fr: Par exemple:
ru_ru: Например:

source: will return: def ‘BLOCK’ value ‘test1’
bg: ще се върне: def &#39;BLOCK&#39; стойност &#39;test1&#39;
es_es: devolverá: def &#39;BLOCK&#39; valor &#39;test1&#39;
fr_fr: retournera: def &#39;BLOCK&#39; valeur &#39;test1&#39;
ru: вернет: def &#39;BLOCK&#39; значение &#39;test1&#39;
ru_ru: вернет: def &#39;BLOCK&#39; значение &#39;test1&#39;

source: will return: def “$1” value “$2”
bg: ще се върне: def „$ 1“ стойност „$ 2“
es_es: volverá: def &quot;$ 1&quot; valor &quot;$ 2&quot;
fr_fr: retournera: def “$ 1” valeur “2 $”
ru: вернет: def «$ 1» значение «$ 2»
ru_ru: вернет: def «$ 1» значение «$ 2»

source: Internally calls Exec[Next]
es_es: Llama internamente a Exec [Siguiente]
fr_fr: Appelle en interne Exec [Suivant]
ru_ru: Внутренне вызывает Exec [Next]

source: Overloaded version and ReplaceEx operate with call-back function,
es_es: La versión sobrecargada y ReplaceEx operan con la función de devolución de llamada,
fr_fr: La version surchargée et ReplaceEx fonctionnent avec la fonction de rappel,
ru_ru: Перегруженная версия и ReplaceEx работают с функцией обратного вызова,

source: so You can implement really complex functionality.
es_es: por lo que puede implementar una funcionalidad realmente compleja.
fr_fr: Vous pouvez donc implémenter des fonctionnalités vraiment complexes.
ru_ru: так что вы можете реализовать действительно сложную функциональность.

source: Number of subexpressions has been found in last Exec\* call.
es_es: Se ha encontrado el número de subexpresiones en la última llamada de Exec \ *.
fr_fr: Le nombre de sous-expressions a été trouvé lors du dernier appel Exec \ *.
ru_ru: Количество подвыражений было найдено в последнем вызове Exec \ *.

source: If there are no subexpr. but whole expr was found (Exec\* returned True), then SubExprMatchCount=0, if no subexpressions nor whole r.e. found (Exec\* returned false) then SubExprMatchCount=-1.
es_es: Si no hay subexpr. pero se encontró el expr completo (Exec \ * devolvió True), luego SubExprMatchCount = 0, si no se encontraron subexpresiones ni se encontró el entero (Exec \ * devolvió false) entonces SubExprMatchCount = -1.
fr_fr: S&#39;il n&#39;y a pas de sous-expression. mais tout expr a été trouvé (Exec \ * renvoyé True), puis SubExprMatchCount = 0, si aucune sous-expression ni aucun entier n&#39;est trouvé (Exec \ * a renvoyé false), puis SubExprMatchCount = -1.
ru_ru: Если нет субэкспр. но был найден весь expr (Exec \ * вернул True), затем SubExprMatchCount = 0, если ни подвыражений, ни целых повторно не найдено (Exec \ * вернул false), тогда SubExprMatchCount = -1.
