Repository: Alexey-T/TRegExpr
Catalog: docs/locale/*/LC_MESSAGES/tregexpr_interface.po
Languages: bg, es_es, fr_fr, ru, ru_ru

source: Returns the string with regular expressions replaced by the ``AReplaceStr``. See also Replace_ if you prefer to create TRegExpr instance explicitly.
bg: Връща низа с регулярни изрази, заменен от ``AReplaceStr``. Вж. Също Replace_, ако предпочитате да създадете TRegExpr например.
ru: Возвращает строку с регулярными выражениями, замененными на `` AReplaceStr``. Смотрите также Replace_, если вы предпочитаете создавать экземпляр TRegExpr явно.

source: If ``AUseSubstitution` is true, then ``AReplaceStr`` will be used as template for ``Substitution methods``.
bg: Ако `` AUseSubstitution` е вярно, то ``AReplaceStr`` ще бъде използван като шаблон за `` Методи за заместване``.
ru: Если `` AUseSubstitution` &#39;имеет значение true, то ``AReplaceStr`` будет использоваться в качестве шаблона для `` методов подстановки``.

source: Version with options
bg: Версия с опции
ru: Версия с опциями

source: With ``Options`` you control ``\n`` behaviour (if ``rroUseOsLineEnd`` then ``\n`` is replaced with ``\n\r`` in Windows and ``\n`` in Linux). And so on.
bg: С ``Опции`` вие контролирате `` `` поведение (ако ``rroUseOsLineEnd`` тогава `` `` се заменя с ``n`` в Windows и `` `` Linux). И така нататък.
ru: С ``Options`` вы управляете поведением ``\n`` (если `` rroUseOsLineEnd``, то ``\n`` заменяется на `` \ n \ r`` в Windows и `` \ n`` в Linux). И так далее.

source: Replace all metachars with its safe representation, for example ``abc'cd.(`` converts into ``abc\'cd\.\(``
bg: Заменете всички метачари със своето безопасно представяне, например &quot;abc&#39;cd. (` `Преобразува в` `abc cd&quot;; \ t
ru: Замените все мета-символы своим безопасным представлением, например, `` abc&#39;cd. (`` Преобразуется в `` abc \ &#39;cd \. \ (``

source: Makes list of subexpressions found in ``ARegExpr``
bg: Прави списък с подекспресии, намерени в ``ARegExpr``
ru: Составляет список подвыражений, найденных в ``ARegExpr``

source: In ``ASubExps`` every item represent subexpression, from first to last, in format:
bg: В ``ASubExps`` всеки елемент представлява субекспресия, от първата до последната във формат:
ru: В ``ASubExps`` каждый элемент представляет подвыражение, от первого до последнего, в формате:

source: ``AExtendedSyntax`` - must be ``True`` if modifier ``/x`` will be ``On`` while using the r.e.
bg: ``AExtendedSyntax`` - трябва да е `` True &#39;&#39;, ако модификаторът `` / x`` е ``On``, докато използвате повторно
ru: ``AExtendedSyntax`` - должно быть ``True``, если модификатор ``/x`` будет ``On`` при использовании re

source: Usefull for GUI editors of r.e. etc (you can find example of using in `REStudioMain.pas <https://github.com/masterandrey/TRegExpr/blob/74ab342b639fc51941a4eea9c7aa53dcdf783592/restudio/REStudioMain.pas#L474>`_)
bg: Полезно за GUI редактори на re и т.н. (можете да намерите пример за използване в `REStudioMain.pas <https://github.com/masterandrey/TRegExpr/blob/74ab342b639fc51941a4eea9c7aa53dcdf783592/restudio/REStudioMain.pas#L474>`_)
ru: Полезно для графических редакторов и т. Д. (Пример использования можно найти в `REStudioMain.pas <https://github.com/masterandrey/TRegExpr/blob/74ab342b639fc51941a4eea9c7aa53dcdf783592/restudio/REStudioMain.pas#L474>`_)

source: Result code
bg: Код на резултатите
ru: Код результата

source: Meaning
bg: значение
ru: Имея в виду

source: Success. No unbalanced brackets was found
bg: Успех. Не бяха намерени небалансирани скоби
ru: Успех. Не найдено несбалансированных скобок

source: there are not enough closing brackets ``)``
bg: няма достатъчно затварящи скоби ``) ``
ru: недостаточно закрывающих скобок``) ``

source: -(n+1)
bg: - (п + 1)
ru: -(п+1)

source: at position n was found opening ``[`` without corresponding closing ``]``
bg: в позиция n е намерено отваряне ``[`` без съответно затваряне ``] ``
ru: в позиции n было найдено открытие ``[`` без соответствующего закрытия ``]``

source: n
bg: п

source: at position n was found closing bracket ``)`` without corresponding opening ``(``
bg: на позиция n е намерена затваряща скоба ``) `` без съответно отваряне ``(``
ru: в позиции n была найдена закрывающая скобка ``) `` без соответствующего открывания ``(``

source: If ``Result <> 0``, then ``ASubExprs`` can contain empty items or illegal ones
bg: Ако `` Резултат <> 0``, то ``ASubExprs`` може да съдържа празни елементи или незаконни
ru: Если `` Result <> 0``, то ``ASubExprs`` может содержать пустые или недопустимые элементы.

source: ModifierM
es_es: Modificador
fr_fr: Modificateur

source: ExecNext
es_es: ExecSiguiente

source: #### ModifierR
fr_fr: #### ModificateurR
