Repository: Alexey-T/TRegExpr
Catalog: docs/locale/*/LC_MESSAGES/tregexpr.po
Languages: de, es, fr

source: Returns ``def "$1" value "$2"``
de: Liefert `` def &quot;$ 1&quot; Wert &quot;$ 2&quot; ``
es: Devuelve el valor `` def &quot;$ 1&quot; valor &quot;$ 2&quot; ``
fr: Retourne `` def &quot;$ 1&quot; valeur &quot;$ 2&quot; ``

source: Version with options
de: Version mit Optionen
es: Versión con opciones
fr: Version avec options

source: With ``Options`` you control ``\n`` behaviour (if ``rroUseOsLineEnd`` then ``\n`` is replaced with ``\n\r`` in Windows and ``\n`` in Linux). And so on.
de: Mit ``Options`` steuern Sie das Verhalten von `\ n`` (wenn` `rroUseOsLineEnd``` dann in` `\ n`` durch` `\ n \ r`` ersetzt wird und` `\ n`` in Linux). Und so weiter.
es: Con ``Options`` usted controla el comportamiento ``\n`` (si `` rroUseOsLineEnd`` entonces ``\n`` se reemplaza con ``\n\r`` en Windows y ``\n`` Linux). Y así.
fr: Avec ``Options`` vous contrôlez le comportement du ``\n`` (si ``rroUseOsLineEnd`` alors ``\n`` est remplacé par ``\n\r`` sous Windows et ``\n`` dans Linux). Etc.

source: Type TRegexReplaceOption = (rroModifierI, rroModifierR, rroModifierS, rroModifierG, rroModifierM, rroModifierX, rroUseSubstitution, rroUseOsLineEnd);
de: Typ TRegexReplaceOption = (rroModifierI, rroModifierR, rroModifierS, rroModifierG, rroModifierM, rroModifierX, rroUseSubstitution, rroUseOsLineEnd);
es: Tipo TRegexReplaceOption = (rroModifierI, rroModifierR, rroModifierS, rroModifierG, rroModifierM, rroModifierX, rroUseSuststitution, rroUseOsLineEnd);

source: Replace all metachars with its safe representation, for example ``abc'cd.(`` converts into ``abc\'cd\.\(``
de: Ersetzen Sie alle Metachars durch ihre sichere Darstellung, zum Beispiel `` abc&#39;cd. (`` Konvertiert in ``abc\'cd\.\(``.)
es: Reemplace todos los metacares con su representación segura, por ejemplo `` abc&#39;cd. (`` Se convierte en `` abc \ &#39;cd \. \ (``
fr: Remplacez tous les métachars par sa représentation sûre, par exemple &quot;abc&#39;cd. (&quot; Convertit en &quot;abc \&quot; cd \. \ ((&quot;

source: This function usefull for r.e. autogeneration from user input
de: Diese Funktion ist nützlich für die erneute Generierung von Benutzereingaben
es: Esta función es útil para la autogeneración desde la entrada del usuario.
fr: Cette fonction est utile pour la régénération automatique à partir d’une entrée utilisateur.

source: Makes list of subexpressions found in ``ARegExpr``
de: Erstellt eine Liste der Unterausdrücke, die in ``ARegExpr`` gefunden werden
es: Hace una lista de subexpresiones encontradas en ``ARegExpr``
fr: Donne la liste des sous-expressions trouvées dans ``ARegExpr``

source: In ``ASubExps`` every item represent subexpression, from first to last, in format:
de: In ``ASubExps`` repräsentiert jedes Element einen ersten Ausdruck vom ersten bis zum letzten Format im Format:
es: En ``ASubExps`` cada elemento representa una subexpresión, de la primera a la última, en formato:
fr: Dans ``ASubExps``, chaque élément représente une sous-expression, du premier au dernier, au format suivant:

source: String - subexpression text (without ‘()’)
de: String - Unterausdruck (ohne &#39;()&#39;)
es: Cadena - texto de subexpresión (sin &#39;()&#39;)
fr: String - texte de sous-expression (sans &#39;()&#39;)

source: low word of Object - starting position in ARegExpr, including ‘(’ if exists! (first position is 1)
de: Low word of Object - Startposition in ARegExpr, einschließlich &#39;(&#39; falls vorhanden! (erste Position ist 1)
es: baja palabra de Objeto - posición inicial en ARegExpr, incluyendo &#39;(&#39; si existe! (la primera posición es 1)
fr: mot bas de l&#39;objet - position de départ dans ARegExpr, y compris &#39;(&#39; s&#39;il existe! (la première position est 1)

source: high word of Object - length, including starting ‘(’ and ending ‘)’ if exist!
de: hohes Wort der Objektlänge, einschließlich &quot;(&quot; und &quot;Endung&quot;) &quot;falls vorhanden!
es: palabra alta de Objeto - longitud, incluyendo el inicio &#39;(&#39; y el final &#39;)&#39; si existe!
fr: mot haut de longueur d&#39;objet, y compris le début &#39;(&#39; et la fin &#39;)&#39; s&#39;il existe!

source: ``AExtendedSyntax`` - must be ``True`` if modifier ``/x`` will be ``On`` while using the r.e.
de: ``AExtendedSyntax`` - muss ``True`` sein, wenn der ``/x`` `` `` `ein ist, während der re verwendet wird
es: ``AExtendedSyntax`` - debe ser ``True`` si el modificador ``/x`` estará ``On`` mientras se usa la re
fr: ``AExtendedSyntax`` - doit être ``True`` si le modificateur ``/x`` sera ``On`` lors de l&#39;utilisation de la

source: Usefull for GUI editors of r.e. etc (you can find example of using in `REStudioMain.pas <https://github.com/masterandrey/TRegExpr/blob/74ab342b639fc51941a4eea9c7aa53dcdf783592/restudio/REStudioMain.pas#L474>`_)
es: Útil para los editores de GUI de re, etc. (puede encontrar un ejemplo de uso en `REStudioMain.pas <https://github.com/masterandrey/TRegExpr/blob/74ab342b639fc51941a4eea9c7aa53dcdf783592/restudio/REStudioMain.pas#L474>`_)
fr: Utile pour les éditeurs de re interface graphique, etc. (vous pouvez trouver des exemples d&#39;utilisation dans `REStudioMain.pas <https://github.com/masterandrey/TRegExpr/blob/74ab342b639fc51941a4eea9c7aa53dcdf783592/restudio/REStudioMain.pas#L474>`_)

source: Result code
de: Ergebniscode
es: Código de resultado
fr: Code de résultat

source: Meaning
de: Bedeutung
es: Sentido
fr: Sens

source: Success. No unbalanced brackets was found
de: Erfolg. Es wurden keine unausgeglichenen Klammern gefunden
es: Éxito. No se encontraron corchetes desequilibrados
fr: Succès. Aucun support déséquilibré n&#39;a été trouvé

source: there are not enough closing brackets ``)``
de: Es gibt nicht genug schließende Klammern ``)``
es: no hay suficientes corchetes de cierre ``)``
fr: il n&#39;y a pas assez de crochets de fermeture ``)``

source: at position n was found opening ``[`` without corresponding closing ``]``
de: An Position n wurde das Öffnen von ``[`` ohne entsprechende Schließung ``] `` gefunden
es: en la posición n se encontró la apertura ``[`` sin el correspondiente cierre ``]``
fr: a été trouvé à la position n ouvrant ``[`` sans la fermeture correspondante ``]``

source: n
es: norte

source: at position n was found closing bracket ``)`` without corresponding opening ``(``
de: In Position n wurde das Schließen der Klammer ``)`` ohne entsprechende Öffnung ``(``) gefunden
es: en la posición n se encontró el corchete de cierre ``)`` sin la correspondiente apertura ``(``
fr: à la position n, on a trouvé un crochet fermant ``)`` sans ouverture correspondante ``(``

source: If ``Result <> 0``, then ``ASubExprs`` can contain empty items or illegal ones
de: Wenn ``Result <> 0`` ```ASubExprs`` kann leere oder illegale Elemente enthalten
es: Si `` Result <> 0``, entonces ``ASubExprs`` puede contener elementos vacíos o ilegales
fr: Si ``Result <> 0``, alors ``ASubExprs`` peut contenir des éléments vides ou illégaux

source: ERegExpr = class (Exception) public ErrorCode : integer; // error code. Compilation error codes are before 1000 CompilerErrorPos : integer; // Position in r.e. where compilation error occured end;
de: ERegExpr = Klasse (Ausnahme) public ErrorCode: integer; // Fehlercode. Kompilierungsfehlercodes liegen vor 1000 CompilerErrorPos: integer; // Position in re, an der der Kompilierungsfehler aufgetreten ist end;
es: ERegExpr = class (Exception) public ErrorCode: integer; // código de error. Los códigos de error de compilación son anteriores a 1000 CompilerErrorPos: integer; // Posición en re donde finalizó el error de compilación;
fr: ERegExpr = class (Exception) public ErrorCode: integer; // code d&#39;erreur. Les codes d&#39;erreur de compilation sont avant 1000 CompilerErrorPos: integer; // Position dans le lieu où l&#39;erreur de compilation s&#39;est produite end;

source: UniCode slows down performance so use it only if you really need Unicode support.
de: UniCode verlangsamt die Leistung. Verwenden Sie ihn daher nur, wenn Sie wirklich Unicode-Unterstützung benötigen.
es: UniCode ralentiza el rendimiento, así que úselo solo si realmente necesita soporte de Unicode.
fr: UniCode ralentit les performances, utilisez-le uniquement si vous avez réellement besoin de la prise en charge de Unicode.

source: To use Unicode uncomment ``{$DEFINE UniCode}`` in `regexpr.pas <https://github.com/masterandrey/TRegExpr/blob/29ec3367f8309ba2ecde7d68d5f14a514de94511/src/RegExpr.pas#L86>`__ (remove ``off``).
es: Para usar Unicode descomentar ``{$DEFINE UniCode}`` en `regexpr.pas <https://github.com/masterandrey/TRegExpr/blob/29ec3367f8309ba2ecde7d68d5f14a514de94511/src/RegExpr.pas#L86> `__ (quitar ``off``).
fr: Pour utiliser le commentaire Unicode ``{$DEFINE UniCode}`` dans `regexpr.pas <https://github.com/masterandrey/TRegExpr/blob/29ec3367f8309ba2ecde7d68d5f14a514de94511/src/RegExpr.pas#L86>`__ (enlever ``off``).

source: After that all strings will be treated as WideString.
de: Danach werden alle Zeichenfolgen als WideString behandelt.
es: Después de eso, todas las cadenas serán tratadas como WideString.
fr: Après cela, toutes les chaînes seront traitées comme WideString.

source: `Français <https://regex.masterandrey.com/fr/latest/index.html>`__
fr: `English <https://regex.masterandrey.com/fr/latest/index.html>`__

source: To use it just copy `source code <https://github.com/andgineer/TRegExpr/blob/master/src/RegExpr.pas>`_ into your project.
de: Um es zu benutzen, kopiere einfach `Quellcode <https://github.com/andgineer/TRegExpr/blob/master/src/RegExpr.pas>`_ in dein Projekt.

source: Usefull for GUI editors of r.e. etc (you can find example of using in `REStudioMain.pas <https://github.com/andgineer/TRegExpr/blob/74ab342b639fc51941a4eea9c7aa53dcdf783592/restudio/REStudioMain.pas#L474>`_)
de: Nützlich für GUI-Editoren von re etc (ein Beispiel für die Verwendung finden Sie in `REStudioMain.pas) <https://github.com/andgineer/TRegExpr/blob/74ab342b639fc51941a4eea9c7aa53dcdf783592/restudio/REStudioMain.pas#L474> _)

source: To use Unicode uncomment ``{$DEFINE UniCode}`` in `regexpr.pas <https://github.com/andgineer/TRegExpr/blob/29ec3367f8309ba2ecde7d68d5f14a514de94511/src/RegExpr.pas#L86>`__ (remove ``off``).
de: Um Unicode zu verwenden, kommentieren Sie ``{$DEFINE UniCode}`` `in` regexpr.pas <https://github.com/andgineer/TRegExpr/blob/29ec3367f8309ba2ecde7d68d5f14a514de94511/src/RegExpr.pas#L86>`__ (entferne ``off``).
