Repository: Alexey-T/TRegExpr
Catalog: docs/locale/*/LC_MESSAGES/tregexpr.po
Languages: de, es, fr

source: If there are no subexpr. but whole expr was found (Exec\* returned True), then ``SubExprMatchCount=0``, if no subexpressions nor whole r.e. found (Exec_ / ExecNext_ returned false) then ``SubExprMatchCount=-1``.
de: Wenn es keinen Subexpr gibt. Es wurde jedoch ein vollständiger Ausdruck gefunden (Exec \ * hat True zurückgegeben), dann `` SubExprMatchCount = 0``, wenn weder Unterausdrücke noch ganze gefunden wurden (Exec_ / ExecNext_ hat false zurückgegeben), dann `` SubExprMatchCount = -1``
es: Si no hay subexpr. pero se encontró el expr completo (Exec \ * devuelto True), luego `` SubExprMatchCount = 0``, si no se encuentran subexpresiones ni se encuentra el entero (Exec_ / ExecNext_ devuelto false) entonces `` SubExprMatchCount = -1``.
fr: S&#39;il n&#39;y a pas de sous-expression. mais tout expr a été trouvé (Exec \ * renvoyé True), puis `` SubExprMatchCount = 0``, si aucune expression ni sous-expression n&#39;a été trouvée (Exec_ / ExecNext_ a renvoyé false), puis `` SubExprMatchCount = -1`.

source: Note, that some subexpr. may be not found and for such subexpr. ``MathPos=MatchLen=-1`` and ``Match=’’``.
de: Beachten Sie, dass einige Unterausdrücke. kann nicht gefunden werden und für einen solchen Unterausdruck. `` MathPos = MatchLen = -1`` und `` Match = &#39;&#39; ``.
es: Tenga en cuenta, que algunos subexpr. No se pueden encontrar y para tales subexpr. `` MathPos = MatchLen = -1`` y `` Match = &#39;&#39; ``.
fr: Notez que certains subexpr. peut ne pas être trouvé et pour ces subexpr. ``MathPos = MatchLen = -1`` et ``Match = &#39;&#39;``.

source: Expression := '(1)?2(3)?'; Exec ('123'): SubExprMatchCount=2, Match[0]='123', [1]='1', [2]='3' Exec ('12'): SubExprMatchCount=1, Match[0]='12', [1]='1' Exec ('23'): SubExprMatchCount=2, Match[0]='23', [1]='', [2]='3' Exec ('2'): SubExprMatchCount=0, Match[0]='2' Exec ('7') - return False: SubExprMatchCount=-1
de: Ausdruck: = &#39;(1) 2 (3)&#39; &#39;; Exec (&#39;123&#39;): SubExprMatchCount = 2, Match [0] = &#39;123&#39;, [1] = &#39;1&#39;, [2] = &#39;3&#39; Exec (&#39;12&#39;): SubExprMatchCount = 1, Match [0] = &#39;12 &#39;, [1] =&#39; 1 &#39;Exec (&#39; 23 &#39;): SubExprMatchCount = 2, Match [0] =&#39; 23 &#39;, [1] =&#39; &#39;, [2] =&#39; 3 &#39;Exec (&#39; 2 &#39;): SubExprMatchCount = 0, Match [0] =&#39; 2 &#39;Exec (&#39; 7 &#39;) - Rückgabe False: SubExprMatchCount = -1
es: Expresión: = &#39;(1)? 2 (3)?&#39;; Exec (&#39;123&#39;): SubExprMatchCount = 2, Match [0] = &#39;123&#39;, [1] = &#39;1&#39;, [2] = &#39;3&#39; Exec (&#39;12&#39;): SubExprMatchCount = 1, Match [0] = &#39;12 &#39;, [1] =&#39; 1 &#39;Exec (&#39; 23 &#39;): SubExprMatchCount = 2, Match [0] =&#39; 23 &#39;, [1] =&#39; &#39;, [2] =&#39; 3 &#39;Exec (&#39; 2 &#39;): SubExprMatchCount = 0, Match [0] =&#39; 2 &#39;Exec (&#39; 7 &#39;) - devuelve False: SubExprMatchCount = -1
fr: Expression: = &#39;(1)? 2 (3)?&#39;; Exec (&#39;123&#39;): SubExprMatchCount = 2, Match [0] = &#39;123&#39;, [1] = &#39;1&#39;, [2] = &#39;3&#39; Exec (&#39;12&#39;): SubExprMatchCount = 1, Match [0] = &#39;12 &#39;, [1] =&#39; 1 &#39;Exec (&#39; 23 &#39;): SubExprMatchCount = 2, Match [0] =&#39; 23 &#39;, [1] =&#39; &#39;, [2] =&#39; 3 &#39;Exec (&#39; 2 &#39;): SubExprMatchCount = 0, Match [0] =&#39; 2 &#39;Exec (&#39; 7 &#39;) - renvoie False: SubExprMatchCount = -1

source: pos of entrance subexpr. ``#Idx`` into tested in last ``Exec*`` string. First subexpr. have ``Idx=1``, last - ``MatchCount``, whole r.e. have ``Idx=0``.
de: pos von Eingang subexpr. ``#Idx`` wurde in der letzten `` Exec * `` Zeichenfolge getestet. Erster Unterausdruck habe ``Idx=1``, zuletzt - `` MatchCount``, ganze hat ``Idx=0``.
es: pos de entrada subexpr. ``#Idx`` en probado en la última cadena `` Exec * ``. Primer subexpr. tiene ``Idx=1``, último - ``MatchCount``, todo lo que tiene ``Idx=0``.
fr: pos d&#39;entrée subexpr. `` # # Idx`` dans testé dans la dernière chaîne `` Exec * ``. Premier sous-représentant ont ``Idx=1``, dernier - ``MatchCount``, tout le monde a ``Idx=0``.

source: Returns ``-1`` if in r.e. no such subexpr. or this subexpr. not found in input string.
de: Gibt ``-1`` zurück, wenn kein solcher Subexpr vorliegt. oder dieser subexpr. nicht in Eingabezeichenfolge gefunden.
es: Devuelve ``-1`` si no existe dicho subexpr. o este subexpr. no se encuentra en la cadena de entrada.
fr: Retourne ``-1`` s&#39;il n&#39;y a pas de tel sous-expression. ou ce subexpr. introuvable dans la chaîne d&#39;entrée.

source: len of entrance subexpr. ``#Idx`` r.e. into tested in last ``Exec*`` string. First subexpr. have ``Idx=1``, last - MatchCount, whole r.e. have ``Idx=0``.
de: len von entry subexpr. ``#Idx`` wird in der letzten `` Exec * `` Zeichenfolge getestet. Erster Unterausdruck habe ``Idx=1``, letzte - MatchCount, ganze hat ``Idx=0``.
es: len de entrada subexpr. ``#Idx`` se probó en la última cadena `` Exec * ``. Primer subexpr. tiene ``Idx=1``, último - MatchCount, todo lo que tiene ``Idx=0``.
fr: len d&#39;entrée subexpr. `` # # Idx`` est testé dans la dernière chaîne ``Exec*``. Premier sous-représentant ont ``Idx=1``, dernier - MatchCount, tout le monde a ``Idx=0``.

source: Returns -1 if in r.e. no such subexpr. or this subexpr. not found in input string.
de: Gibt -1 zurück, wenn kein solcher Unterausdruck vorhanden ist. oder dieser subexpr. nicht in Eingabezeichenfolge gefunden.
es: Devuelve -1 si no hay subexpr. o este subexpr. no se encuentra en la cadena de entrada.
fr: Renvoie -1 s&#39;il n&#39;y a pas de tel sous-expression. ou ce subexpr. introuvable dans la chaîne d&#39;entrée.

source: Match
de: Spiel
es: Partido
fr: Rencontre

source: Returns ``’’`` if in r.e. no such subexpression or this subexpression was not found in the input string.
de: Gibt `` &#39;&#39; `` zurück, wenn in der Eingabezeichenfolge kein solcher Unterausdruck oder dieser Unterausdruck gefunden wurde.
es: Devuelve `` &#39;&#39; `` si no se encuentra dicha subexpresión o esta subexpresión no se encontró en la cadena de entrada.
fr: Retourne `` &#39;&#39; `` s&#39;il n&#39;y a pas de telle sous-expression ou si cette sous-expression n&#39;a pas été trouvée dans la chaîne d&#39;entrée.

source: Returns ``ID`` of last error, ``0`` if no errors (unusable if ``Error`` method raises exception) and clear internal status into ``0`` (no errors).
de: Gibt ``ID`` des letzten Fehlers zurück, ``0``, wenn keine Fehler vorliegen (unbrauchbar, wenn die &#39;Fehler&#39;-Methode eine Ausnahmebedingung auslöst) und den internen Status in ``0`` löschen (keine Fehler).
es: Devuelve ``ID`` del último error, ``0`` si no hay errores (no se puede utilizar si el método ``Error`` genera una excepción) y borra el estado interno en ``0`` (no hay errores).
fr: Retourne ``ID`` de la dernière erreur, `0`` si aucune erreur (inutilisable si la méthode` `Error`` lève l&#39;exception) et efface le statut interne en` `0`` (pas d&#39;erreurs).

source: Returns ``Error`` message for error with ``ID = AErrorID``.
de: Gibt die ``Error``-Nachricht für einen Fehler mit `` ID = AErrorID`` zurück.
es: Devuelve el mensaje ``Error`` por error con `` ID = AErrorID``.
fr: Renvoie le message ``Error`` en cas d&#39;erreur avec `` ID = AErrorID``.

source: Returns pos in r.e. there compiler stopped.
de: Gibt pos in re zurück, wo der Compiler gestoppt wurde.
es: Devuelve pos en el compilador re detenido.
fr: Retourne le poseur là où le compilateur est arrêté.

source: Useful for error diagnostics
de: Nützlich für die Fehlerdiagnose
es: Útil para el diagnóstico de errores.
fr: Utile pour le diagnostic d&#39;erreur

source: Contains chars, treated as ``\s`` (initially filled with RegExprSpaceChars_ global constant)
de: Enthält Zeichen, die als ``\s`` behandelt werden (anfänglich mit der globalen Konstante RegExprSpaceChars_ gefüllt)
es: Contiene caracteres, tratados como ``\s`` (inicialmente rellenados con la constante global RegExprSpaceChars_)
fr: Contient des caractères, traités comme ``\s`` (initialement remplis avec la constante globale RegExprSpaceChars_)

source: Contains chars, treated as ``\w`` (initially filled with RegExprWordChars_ global constant)
de: Enthält Zeichen, die als ``\w`` behandelt werden (anfänglich mit der globalen Konstante RegExprWordChars_ gefüllt)
es: Contiene caracteres, tratados como ``\w`` (inicialmente rellenados con la constante global RegExprWordChars_)
fr: Contient des caractères, traités comme ``\w`` (initialement remplis avec la constante globale RegExprWordChars_)

source: line separators (like ``\n`` in Unix), initially filled with RegExprLineSeparators_ global constant)
de: Zeilentrennzeichen (wie ``\n`` in Unix), anfänglich gefüllt mit RegExprLineSeparators_ (globale Konstante)
es: separadores de línea (como ``\n`` en Unix), inicialmente llenos con RegExprLineSeparators_ constante global)
fr: séparateurs de lignes (comme ``\n`` dans Unix), initialement renseignés avec la constante globale RegExprLineSeparators_)

source: see also `Line Boundaries <regular_expressions.html#lineseparators>`__
de: Siehe auch `Zeilengrenzen <regular_expressions.html#lineseparators> __
es: ver también `Límites de línea <regular_expressions.html#lineseparators>`__
fr: voir aussi `Limites de lignes <regular_expressions.html#lineseparators>`__

source: paired line separator (like ``\r\n`` in DOS and Windows).
de: gepaartes Trennzeichen (wie ``\r\n`` in DOS und Windows).
es: separador de línea emparejado (como ``\r\n`` en DOS y Windows).
fr: séparateur de lignes jumelé (comme `` \ \ r \ n`` sous DOS et Windows).

source: must contain exactly two chars or no chars at all, initially filled with RegExprLinePairedSeparator global constant)
de: muss genau zwei Zeichen oder keine Zeichen enthalten, die anfangs mit der globalen Konstante RegExprLinePairedSeparator gefüllt sind.
es: debe contener exactamente dos caracteres o ningún carácter, inicialmente con la constante global RegExprLinePairedSeparator)
fr: doit contenir exactement deux caractères ou aucun caractère, initialement renseignés avec la constante globale RegExprLinePairedSeparator)

source: For example, if you need Unix-style behaviour, assign ``LineSeparators := #$a`` and ``LinePairedSeparator := ''`` (empty string).
de: Wenn Sie beispielsweise ein Verhalten im Unix-Stil benötigen, weisen Sie `` LineSeparators: = # $ a`` und `` LinePairedSeparator: = &#39;&#39; `` (leere Zeichenfolge) zu.
es: Por ejemplo, si necesita un comportamiento estilo Unix, asigne `` LineSeparators: = # $ a`` y `` LinePairedSeparator: = &#39;&#39; `` (cadena vacía).
fr: Par exemple, si vous avez besoin d&#39;un comportement de style Unix, affectez `` LineSeparators: = # $ a`` et `` LinePairedSeparator: = &#39;&#39; `(chaîne vide).

source: If you want to accept as line separators only ``\x0D\x0A`` but not ``\x0D`` or ``\x0A`` alone, then assign ``LineSeparators := ''`` (empty string) and ``LinePairedSeparator := #$d#$a``.
de: Wenn Sie als Linientrennzeichen nur `\ x0D \ x0A`` aber nicht` `x0D`` oder` `\ x0A`` allein akzeptieren möchten, weisen Sie` `LineSeparators: = &#39;&#39;` `(leere Zeichenfolge) und `` LinePairedSeparator: = # $ d # $ a``.
es: Si desea aceptar solo como separadores de línea ``\x0D\x0A`` pero no ``\x0D`` o `` \ x0A`` solo, asigne `` LineSeparators: = &#39;&#39; `` (cadena vacía) y `` LinePairedSeparator: = # $ d # $ a``.
fr: Si vous souhaitez n&#39;accepter que les séparateurs de lignes `` \ \ x0D \ x0A`` mais pas les ``\x0D`` ou `` \ x0A``, attribuez ``LineSeparators: = &#39;&#39; (chaîne vide) et ``LinePairedSeparator: = # $d#$a``.

source: By default ‘mixed’ mode is used (defined in RegExprLine[Paired]Separator[s] global constants):
de: Standardmäßig wird der gemischte Modus verwendet (definiert in RegExprLine [Paired] Separator [s] globale Konstanten):
es: Por defecto, se usa el modo &#39;mixto&#39; (definido en RegExprLine [Paired] Separator [s] constantes globales):
fr: Par défaut, le mode &quot;mixte&quot; est utilisé (défini dans les constantes globales RegExprLine [Paired] Separator [s]):

source: LineSeparators := #$d#$a; LinePairedSeparator := #$d#$a
es: Separadores de líneas: = # $ d # $ a; LinePairedSeparator: = # $ d # $ a

source: Behaviour of this mode is detailed described in the `Line Boundaries <regular_expressions.html#lineseparators>`__.
de: Das Verhalten dieses Modus wird ausführlich in den Zeilengrenzen beschrieben <regular_expressions.html#lineseparators> __.
es: El comportamiento de este modo se describe detalladamente en `Límites de línea <regular_expressions.html#lineseparators>`__.
fr: Le comportement de ce mode est décrit en détail dans la section `Line Boundaries <regular_expressions.html#lineseparators>`__.

source: Invertion of character case. Redefine it if you want different behaviour.
de: Invertierung des Zeichenkastens. Definieren Sie es neu, wenn Sie ein anderes Verhalten wünschen.
es: Inversión del caso del personaje. Redefinirlo si quieres un comportamiento diferente.
fr: Inversion de la casse. Redéfinissez-le si vous voulez un comportement différent.

source: Compile
de: Kompilieren
es: Compilar
fr: Compiler

source: Compiles regular expression.
de: Kompiliert regulären Ausdruck.
es: Compila expresiones regulares.
fr: Compile l&#39;expression régulière.

source: Useful for example for GUI regular expressions editors - to check regular expression without using it.
de: Nützlich zum Beispiel für GUI-Editoren für reguläre Ausdrücke, um reguläre Ausdrücke zu überprüfen, ohne ihn zu verwenden.
es: Útil, por ejemplo, para los editores de expresiones regulares de GUI: para verificar expresiones regulares sin usarlas.
fr: Utile par exemple pour les éditeurs d&#39;expressions régulières GUI - pour vérifier les expressions régulières sans les utiliser.

source: Dump
es: Tugurio
fr: Déverser

source: Show ``P-code`` (compiled regular expression) as human-readable string.
de: Zeigen Sie ``P-Code`` (kompilierter regulärer Ausdruck) als vom Menschen lesbare Zeichenfolge.
es: Mostrar ``P-code`` (expresión regular compilada) como una cadena legible por humanos.
fr: Affichez ``P-code`` (expression régulière compilée) sous forme de chaîne lisible par l&#39;homme.

source: Global constants
de: Globale Konstanten
es: Constantes globales
fr: Constantes globales

source: Escape-char, by default ``\``.
de: Escape-char, standardmäßig ``\``.
es: Escape-char, por defecto ``\``.
fr: Escape-char, par défaut ``\``.

source: `Modifier i <regular_expressions.html#i>`_ default value
de: Modifier i <regular_expressions.html#i> _ Standardwert
es: `Modificador i <regular_expressions.html#i>`_ valor por defecto
fr: `Modificateur i <regular_expressions.html#i>`_ valeur par défaut

source: `Modifier r <regular_expressions.html#r>`_ default value
de: Modifier r <regular_expressions.html#r> _ Standardwert
es: `Modificador r <regular_expressions.html#r>`_ valor por defecto
fr: `Modificateur r <regular_expressions.html#r>`_ valeur par défaut

source: `Modifier s <regular_expressions.html#s>`_ default value
de: `Modifier s <regular_expressions.html#s> _ Standardwert
es: `Modificador s <regular_expressions.html#s>`_ valor por defecto
fr: `Modificateur s <regular_expressions.html#s>`_ valeur par défaut

source: `Modifier g <regular_expressions.html#g>`_ default value
de: `Modifikator g <regular_expressions.html#g> _ Standardwert
es: `Modificador g <regular_expressions.html#g>`_ valor por defecto
fr: `Modificateur g <regular_expressions.html#g>`_ valeur par défaut

source: `Modifier m <regular_expressions.html#m>`_ default value
de: Modifier m <regular_expressions.html#m> _ Standardwert
es: `Modificador m <regular_expressions.html#m>`_ valor por defecto
fr: `Modificateur m <regular_expressions.html#m>`_ valeur par défaut

source: `Modifier x <regular_expressions.html#x>`_ default value
de: `Modifikator x <regular_expressions.html#x> _ Standardwert
es: `Modificador x <regular_expressions.html#x>`_ valor por defecto
fr: `Modificateur x <regular_expressions.html#x>`_ valeur par défaut

source: Default for SpaceChars_ property
de: Standardwert für die SpaceChars_-Eigenschaft
es: Predeterminado para la propiedad SpaceChars_
fr: Valeur par défaut pour la propriété SpaceChars_

source: Default value for WordChars_ property
de: Standardwert für die Eigenschaft WordChars_
es: Valor predeterminado para la propiedad WordChars_
fr: Valeur par défaut pour la propriété WordChars_

source: Default value for LineSeparators_ property
de: Standardwert für die LineSeparators_-Eigenschaft
es: Valor predeterminado para la propiedad LineSeparators_
fr: Valeur par défaut pour la propriété LineSeparators_

source: Default value for LinePairedSeparator_ property
de: Standardwert für die LinePairedSeparator_-Eigenschaft
es: Valor predeterminado para la propiedad LinePairedSeparator_
fr: Valeur par défaut pour la propriété LinePairedSeparator_

source: Default for InvertCase_ property
de: Standard für die Eigenschaft InvertCase_
es: Predeterminado para la propiedad InvertCase_
fr: Valeur par défaut pour la propriété InvertCase_

source: Global functions
de: Globale Funktionen
es: Funciones globales
fr: Fonctions globales

source: All this functionality is available as methods of ``TRegExpr``, but with global functions you do not need to create ``TReExpr`` instance so your code would be more simple if you just need one function.
de: Alle diese Funktionen stehen als Methoden von ``TRegExpr`` zur Verfügung, aber mit globalen Funktionen müssen Sie keine ``TReExpr``-Instanz erstellen, sodass Ihr Code einfacher wäre, wenn Sie nur eine Funktion benötigen.
es: Toda esta funcionalidad está disponible como métodos de ``TRegExpr``, pero con las funciones globales no necesita crear una instancia de ``TReExpr``, por lo que su código sería más simple si solo necesita una función.
fr: Toutes ces fonctionnalités sont disponibles en tant que méthodes de ``TRegExpr``, mais avec les fonctions globales, il n&#39;est pas nécessaire de créer une instance ``TReExpr`` pour que votre code soit plus simple si vous n&#39;avez besoin que d&#39;une seule fonction.

source: true if the string matches the regular expression. Just as Exec_ in ``TRegExpr``.
de: true, wenn die Zeichenfolge mit dem regulären Ausdruck übereinstimmt. So wie Exec_ in ``TRegExpr``.
es: Es cierto si la cadena coincide con la expresión regular. Al igual que Exec_ en ``TRegExpr``.
fr: true si la chaîne correspond à l&#39;expression régulière. Tout comme Exec_ dans ``TRegExpr``.

source: Splits the string by regular expressions. See also Split_ if you prefer to create ``TRegExpr`` instance explicitly.
de: Teilt den String mit regulären Ausdrücken. Siehe auch Split_, wenn Sie die ``TRegExpr``-Instanz explizit erstellen möchten.
es: Divide la cadena por expresiones regulares. Vea también Dividir_ si prefiere crear una instancia ``TRegExpr`` explícitamente.
fr: Divise la chaîne en expressions régulières. Voir aussi Split_ si vous préférez créer explicitement l&#39;instance ``TRegExpr``.

source: function ReplaceRegExpr ( const ARegExpr, AInputStr, AReplaceStr : RegExprString; AUseSubstitution : boolean= False ) : RegExprString; overload; Type TRegexReplaceOption = (rroModifierI, rroModifierR, rroModifierS, rroModifierG, rroModifierM, rroModifierX, rroUseSubstitution, rroUseOsLineEnd); TRegexReplaceOptions = Set of TRegexReplaceOption; function ReplaceRegExpr ( const ARegExpr, AInputStr, AReplaceStr : RegExprString; Options :TRegexReplaceOptions ) : RegExprString; overload;
de: Funktion ReplaceRegExpr (const ARegExpr, AInputStr, AReplaceStr: RegExprString; AUseSubstitution: boolean = False): RegExprString; Überlast; Typ TRegexReplaceOption = (rroModifierI, rroModifierR, rroModifierS, rroModifierG, rroModifierM, rroModifierX, rroUseSubstitution, rroUseOsLineEnd); TRegexReplaceOptions = Set von TRegexReplaceOption; Funktion ReplaceRegExpr (const ARegExpr, AInputStr, AReplaceStr: RegExprString; Optionen: TRegexReplaceOptions): RegExprString; Überlast;
es: función ReplaceRegExpr (const ARegExpr, AInputStr, AReplaceStr: RegExprString; AUseSubstitution: boolean = False): RegExprString; sobrecarga; Tipo TRegexReplaceOption = (rroModifierI, rroModifierR, rroModifierS, rroModifierG, rroModifierM, rroModifierX, rroUseSuststitution, rroUseOsLineEnd); TRegexReplaceOptions = Conjunto de TRegexReplaceOption; función ReplaceRegExpr (const ARegExpr, AInputStr, AReplaceStr: RegExprString; Opciones: TRegexReplaceOptions): RegExprString; sobrecarga;
fr: function ReplaceRegExpr (const ARegExpr, AInputStr, AReplaceStr: RegExprString; AUseSubstitution: boolean = False): RegExprString; surcharge; Type TRegexReplaceOption = (rroModifierI, rroModifierR, rroModifierS, rroModifierG, rroModifierM, rroModifierX, rroUseSubstitution, rroUseOsLineEnd); TRegexReplaceOptions = Ensemble de TRegexReplaceOption; fonction ReplaceRegExpr (const ARegExpr, AInputStr, AReplaceStr: RegExprString; Options: TRegexReplaceOptions): RegExprString; surcharge;

source: Returns the string with regular expressions replaced by the ``AReplaceStr``. See also Replace_ if you prefer to create TRegExpr instance explicitly.
de: Gibt den String mit regulären Ausdrücken zurück, die durch ``AReplaceStr`` ersetzt werden. Siehe auch Replace_, wenn Sie es vorziehen, die TRegExpr-Instanz explizit zu erstellen.
es: Devuelve la cadena con expresiones regulares reemplazadas por `` AReplaceStr``. Vea también Reemplazar_ si prefiere crear la instancia de TRegExpr explícitamente.
fr: Retourne la chaîne avec les expressions régulières remplacées par le ``AReplaceStr``. Voir aussi Replace_ si vous préférez créer explicitement l&#39;instance de TRegExpr.

source: If last argument (``AUseSubstitution``) is true, then ``AReplaceStr`` will be used as template for ``Substitution methods``:
de: Wenn das letzte Argument (``AUseSubstitution``) wahr ist, wird `` AReplaceStr`` als Vorlage für `` Substitutionsmethoden`` verwendet:
es: Si el último argumento (`` AUseSubstitution``) es verdadero, entonces `` AReplaceStr`` se usará como plantilla para `` Métodos de sustitución``:
fr: Si le dernier argument (`` AUseSubstitution``) est vrai, alors ``AReplaceStr`` sera utilisé comme modèle pour `` Méthodes de substitution``:

source: ReplaceRegExpr ( '((?i)block|var)\s*(\s*\([^ ]*\)\s*)\s*', 'BLOCK(test1)', 'def "$1" value "$2"', True )
de: ReplaceRegExpr (&#39;((?)) Block | var) \ s * (\ s * \ ([^] * \) \ s *) \ s *&#39;, &#39;BLOCK (test1)&#39;, &#39;def &quot;$ 1&quot; value &quot; $ 2 &quot;, wahr)
es: ReplaceRegExpr (&#39;((? I) block | var) \ s * (\ s * \ ([^] * \) \ s *) \ s *&#39;, &#39;BLOCK (test1)&#39;, &#39;def &quot;$ 1&quot; value &quot; $ 2 &quot;&#39;, Verdadero)
fr: ReplaceRegExpr (&#39;((? I) bloc | var) \ s * (\ s * \ ([^] * \) \ s *) \ s *&#39;, &#39;BLOCK (test1)&#39;, &#39;def &quot;$ 1&quot; valeur &quot; 2 $ &#39;&#39;, True)

source: Returns ``def 'BLOCK' value 'test1'``
de: Gibt den `` def &#39;BLOCK&#39;-Wert&#39; test1 &#39;`zurück
es: Devuelve el valor `` def &#39;BLOCK&#39; &#39;test1&#39;``
fr: Renvoie la valeur `&#39;def&#39; BLOCK &#39;&#39; test1&#39;``

source: But this one (note there is no last argument):
de: Aber dieses hier (Anmerkung: Es gibt kein letztes Argument):
es: Pero este (note que no hay un último argumento):
fr: Mais celui-ci (notez qu&#39;il n&#39;y a pas de dernier argument):

source: ReplaceRegExpr ( '((?i)block|var)\s*(\s*\([^ ]*\)\s*)\s*', 'BLOCK(test1)', 'def "$1" value "$2"' )
de: ReplaceRegExpr (&#39;((?)) Block | var) \ s * (\ s * \ ([^] * \) \ s *) \ s *&#39;, &#39;BLOCK (test1)&#39;, &#39;def &quot;$ 1&quot; value &quot; $ 2 &quot;&#39;)
es: ReplaceRegExpr (&#39;((? I) block | var) \ s * (\ s * \ ([^] * \) \ s *) \ s *&#39;, &#39;BLOCK (test1)&#39;, &#39;def &quot;$ 1&quot; value &quot; $ 2 &quot;&#39;)
fr: ReplaceRegExpr (&#39;((? I) bloc | var) \ s * (\ s * \ ([^] * \) \ s *) \ s *&#39;, &#39;BLOCK (test1)&#39;, &#39;def &quot;$ 1&quot; valeur &quot; 2 $ &#39;&#39;
